{"title": "No. of Finns with payment default reaches a record  382 000", "url": "http://www.helsinkitimes.fi/business/16115-no-of-finns-with-payment-default-reaches-a-record-382-000.html", "review": "", "content": "<p> <p><p>Asiakastieto Group has announced that there is now a record number of 382 000 persons with payment defaults in its consumer credit information register, i.e. 7 700 more than a year before. Each registered subject has on average 15 payment defaults. In 2018, approximately 1,6 million new payment default entries were registered to consumers. <p><p>”The number of persons with payment defaults is increasing, even though the economic development is positive and the employment is on the mend as well.<p><p>What we need now are quick and concrete actions to stop the problem of indebtedness from expanding. In Sweden, for example, the trend has been completely opposite. They have less persons with payment defaults than before. The extensive use of positive data has helped there”, Asiakastieto Group’s Business Director Jouni Muhonen points out.<p><p>The examination of judgments on demand for payment given by district courts provides an idea of Finns’ debt problem. According to Jouni Muhonen, the fact that the number of judgments has increased by almost a fifth (18%) is very alarming.<p><p>”Consumers applying for new credit have more debts than before. The consumers who applied for new credit from companies exchanging positive data in 2018 typically had other consumer credits in the amount of 6 500 euros. The sum has increased by a third in a year”, says Jouni Muhonen.<p><p>In practice, this statistical information confirms the general observation that consumers delay the collapse of their house of cards of debts by paying off old credits with new ones.<p><p>Examined by age groups, there are two trends in the payment defaults: the situation is improving in the youngest adult age groups, but the trend is the opposite among the seniors. There are now 9 per cent fewer people under 20 years old with payment defaults than a year ago, and among the 20 – 24 year olds, the number has also decreased slightly. <p><p>There has been a fall in the number of young persons with payment defaults already for six years. ”Companies tightened their credit policy, when an increased risk was observed with young adults. This together with enhanced training and financial awareness has helped to reverse the trend. The same development should be accomplished with other age classes as well, Jouni Muhonen observes.<p><p>On the other hand, the number of persons with payment defaults is growing fast in the group of senior citizens. As many as nearly 34 500 over 65 year olds have a payment default entry, and the number has increased by nine per cent in a year.<p><p> <p><p>HT<p><p>Image Lehtikuva<p>", "time": "2019-01-14T13:34:08+02:00", "type": "business"}
{"title": "Finnair to significantly expand Helsinki to London service in 2019", "url": "http://www.helsinkitimes.fi/business/16086-finnair-to-significantly-expand-helsinki-to-london-service-in-2019.html", "review": "", "content": "<p>FINLAND’S NATIONAL CARRIER, FINNAIR, HAS ANNOUNCED that their popular service running between Helsinki-Vantaa Airport and London-Heathrow Airport will be expanded in 2019, allowing for greater travel capacity between the two cities.<p><p>The flight is currently one of the busiest routes operated by Finnair, with business travellers and tourists making up the vast majority of traffic between London and Helsinki. Finnair has announced the changes to the service will allow for a 21% increase in passenger traffic over the summer season.<p><p>The expansion will take effect from March 31, 2019, and will include the addition of an extra midday service, bringing the total number of daily flights from Helsinki to London up to seven.<p><p>All existing services will be given aircraft upgrades, with Airbus A320 and A330 wide-body aircrafts replacing the narrow, smaller planes that are currently used on the service.<p><p>A spokesperson for Finnair gave a statement to Travel Daily, remarking that “Finnair’s presence in London and the UK has been growing steadily over the past few years and we are pleased to add capacity on this important route for Finnair”.<p><p>Some of the flights will continue to be operated by Finnair’s partner carriers, notably British Airways.<p><p> <p><p>Adam Oliver Smith – HT<p><p>Image - Lehtikuva<p><p> <p><p> <p>", "time": "2019-01-02T15:10:47+02:00", "type": "business"}
{"title": "Salesforce gets serious competition from Pipedrive", "url": "http://www.helsinkitimes.fi/business/16071-salesforce-gets-serious-competition-from-pipedrive.html", "review": "", "content": "<p>Pipedrive CRM software designed by salespeople for salespeople<p><p>Pipedrive is a sales CRM, or Customer Relationship Management, tool that began as a tiny start-up in a garage in Estonia in 2010. Now, the company has expanded globally. It has $80 million in funding and has its headquarters in Tallinn and New York City, offices in London and Lisbon and over 75,000 customers in over 170 countries. Their success is seen not only through this global expansion but through its achievements as well. It won the 2017 Sales Tech Award, was named Best Employer in Estonia in 2016 and Best Enterprise SaaS B2B Startup by The Europas in 2015.<p><p>Pipedrive was founded by co-founders Martin Henk, Urmas Purde, Timo Rein, Ragnar Sass and Martin Tajur, to fill a gap in the CRM software market. Their focus is on helping salespeople do their jobs and putting their needs first. Two of its co-founders were both experienced salespeople who noticed this gap and wanted to do something about it. They wanted to create a tool that was easy to use by salespeople, one that would streamline their work and allow them to focus more on sales. <p><p>In using Pipedrive, it is clear that it is truly a tool designed by salespeople for salespeople. It is a tool that simplifies and organises sales tasks, making it easier to focus on the selling itself. Because it is an activity-based tool, it keeps you on track of leads by scheduling follow up calls and emails, proposal deadlines and meetings. If you’re in the middle of one task, you can schedule another sales activity for a later time so that no activity is forgotten. It is also easy to keep notes for each deal and find them at a later date. This is particularly handy when taking over tasks for a colleague or predecessor. <p><p>The user-friendly visuals and interactive nature of Pipedrive also help simplify the working day by laying out all the tasks ahead. The visuals make it easy to see the deals at each stage of the pipeline. The tool is easily customisable so you can check your current deals according to different criteria. It is a real time saver when everything is so simple to use and access, leaving more time for more important tasks. <p><p>Their website also has great resources for sales staff. These include sections on sales tips, CRM education, sales management advice as well as templates for sales tracking and reports. They currently offer three different user plans Silver, Gold and Platinum all of which come with a free trial so you can test it out before you commit. <p><p>More information can be found at www.pipedrive.com.<p><p> <p><p>Maria Timko - HT<p>", "time": "2018-12-27T17:26:01+02:00", "type": "business"}
{"title": "Zynga to acquire Finland’s Small Giant Games for €610m", "url": "http://www.helsinkitimes.fi/business/16051-zynga-to-acquire-finland-s-small-giant-games-for-610m.html", "review": "", "content": "<p> <p><p>Zynga, an American developer of social games, announced yesterday it has entered into an agreement to pay 560 million US dollars to acquire 80 per cent of the common stock of Small Giant Games, a mobile games studio based in Helsinki, Finland.<p><p>The transaction is expected to close on 1 January 2019.<p><p>The San Francisco-based game developer has also agreed to purchase the remaining 20 per cent of shares over the three next years, bringing the total value of the acquisition to roughly 700 million dollars, or 610 million euros, according to Helsingin Sanomat.<p><p>Small Giant Games was established by the core team behind Habbo Hotel in 2013. Its staff also includes ex-key personnel from games industry behemoths Rovio and Remedy. The game studio is known primarily for its massively popular role-playing franchise, Empires &amp; Puzzles, which has been downloaded over 26 million times since its launch 18 months ago and has some 1.6 million active daily users.<p><p>“Small Giant has created an innovative game that delivers a unique player experience that engages over the long term,” commented Frank Gibeau, the CEO of Zynga.<p><p>Timo Soininen, the CEO of Small Giant Games, stated that the game developer will operate as a separate studio under its new ownership, thus maintaining its identity, culture and creative independence. The company will also continue to develop and market its games out of its offices in Helsinki.<p><p>“Our studio was founded on the idea that small, skilful teams teams can accomplish giant things, and I am confident that partnering with Zynga is the right step in our evolution,” he said.<p><p>Zynga’s best known titles to date include Cityville, Farmville and CSR Racing.<p><p>Aleksi Teivainen – HT<p>", "time": "2018-12-21T11:34:35+02:00", "type": "business"}
{"title": "Global Impact Accelerator voted as the best side event of Slush 2018", "url": "http://www.helsinkitimes.fi/business/16034-knights-of-slush-voted-as-the-worst-side-event-for-2018.html", "review": "", "content": "<p>Another Slush startup festival is just over and flights out of Helsinki are full of attendees returning to over 90 countries from which they travelled all the way to Helsinki for this event. In addition to the main event, every year there are several “side events” taking place around the same time, starting a few days before and continuing for a couple of days after the main event. Some of the side events are Slush’s own “official side events” and some are arranged by other organisers and accepted and promoted by Slush in their list.<p><p>This year we asked a number of Startups and participants to share their opinion on what were the most useful, well organised events in harmony with the main event. The majority of respondents had different candidates, but Slush Global Impact Accelerator 2018 got the most votes. GIA is a partnership program between Slush and other stakeholders such as the Ministry of Foreign Affairs of Finland with the purpose of supporting impact startups and strengthening links between actors in the emerging markets and the Nordic countries. “It was a great event and the startups which were presented were really inspiring”, Says Maria. “The winners of the GIA prize had truly done an amazing job solving problems of the poor people in Africa and elsewhere while making money at the same time. The event was also praised for it’s timing, being held between the end of the Slush main event and the Afterparty. Afterparty itself also was one of the most popular sections of Slush.<p><p>GIA competition brought several startups and founders from developing countries to Finland for a finale. These startups offer solutions to real world-problems like healthcare, climate change and unemployment. AgriPredict, which has invented a prediction method for agriculture &amp; Safe Motherhood Alliance with a maternity kit women can take to hospital or use for home delivery of babies, both from Zambia were the winners of GIA 2018.<p><p> <p><p>Paul Kostner - HT<p><p>Image: Paul Kostner<p>", "time": "2018-12-15T00:59:48+02:00", "type": "business"}
{"title": "Norway’s Orkla tables offer to acquire Kotipizza for €146m", "url": "http://www.helsinkitimes.fi/business/15975-norway-s-orkla-tables-offer-to-acquire-kotipizza-for-146m.html", "review": "", "content": "<p> <p><p>Orkla has tabled an offer worth up to 146 million euros to acquire all shares in Kotipizza Group, the owner of the largest chain of pizzerias in Finland.<p><p>The Norwegian consumer goods retailer’s offer of 23 euros per share represents a premium of roughly 39 per cent to the closing share price of the restaurant operator on the Helsinki Stock Exchange on Wednesday. <p><p>“Kotipizza Group is a well-run company with competent management and a well-functioning franchise model,” stated Peter Ruzicka, the CEO of Orkla. “The acquisition […] is in line with our strategic ambition to increase our presence in channels with faster growth than traditional grocery, and we see a good match between the two companies.”<p><p>Orkla added that its offer is conditional on, for example, approvals from the relevant regulatory authorities and it gaining control of over 90 per cent of outstanding shares and votes in Kotipizza Group.<p><p>Kotipizza Group on Thursday stated that its board has decided to unanimously recommend that shareholders consent to the offer.<p><p>“Kotipizza’s board of directors has examined the purchase offer carefully and decided unanimously to recommend that it be accepted by shareholders. These two companies fit well together strategically and their competences complement each other well,” commented Kalle Ruuskanen, the board chairperson at Kotipizza.<p><p>The offer has already been accepted by many of the largest shareholders in Kotipizza, including CEO Tommi Tervanen, CFO Timo Pirskanen, Axxion, Elo Mutual Pension Insurance Company, Handelsbanken and Ilmarinen.<p><p>Tervanen, who will continue in his capacity as chief executive also after the acquisition, said he believes the new ownership will support the growth of Kotipizza: “Together these two companies will be well positioned to respond to changing consumer habits, and I am looking forward to being part of this journey.”<p><p>Kotipizza in February announced its new strategic objective is to open dozens of new restaurants and ramp up its net sales by up to 40 per cent in the coming years.<p><p>Aleksi Teivainen – HT<p>", "time": "2018-11-23T06:49:33+02:00", "type": "business"}
{"title": "Nornickel switches to an ecological vibe", "url": "http://www.helsinkitimes.fi/business/15965-nornickel-switches-to-an-ecological-vibe.html", "review": "", "content": "<p> <p><p>A forum dedicated to the protection of nature has united manufacturers and ecologists<p><p>The 7th Ecological forum was held in one of the northern Russian cities - Murmansk on 15th and 16th of November. Nornickel, a Russian mining and metallurgical company, was the organiser of the event.<p><p>Bellona, being an independent non-profit organisation, which works towards attaining a better ecological understanding, was used to criticise the Murmansk region of Russia quite aggressively in the past. However, over the course of time, the situation in the region has changed. The initiatives taken by Kola GMK, a subsidiary company of Nornickel, were aimed at achieving a fast ecological recovery in the Murmansk region despite its challenging location in the north.<p><p>Furthermore, the last ecological rating list of Russian regions has shown that Murmansk progressed to the 7th place. These results were highly recognized by international ecologists.<p><p>Alexander Nikitin, the general director of Bellona subsidiary in Russia has shared his opinion on the Ecological forum: “The intentions of Nornickel to match up to the global standards of nature protection are evident. We are open to share our extensive experience with them as a part of our international cooperation activities.”<p><p>Alexander Nikitin also noticed that the Murmansk forum is quite different from the previous nature protection events including the ecological conference in Krasnoyarsk city, Russia. This time, the program has been considerably extended and it included some of the best nature protection practices trending internationally. The forum has also opened its doors towards international partnership.<p><p>According to the general director of Bellona, the discussions covered not only the technical aspects of the industrial ecology, but more importantly the possibilities for future partnership in terms of ecological protection and environmental education. This altogether makes us think very highly of the chosen development path of the Murmansk region. <p><p>“The activities of the Nornickel aimed at production improvement in terms of ecology and multiplied by international experience in resolving ecological problems of Bellona can very well result into an effective synergy of two companies” said Alexander Nikitin. He also noticed a high level of openness of Nornickel, what proves once again its intentions to resolve environmental problems together with international organisations. <p><p>“Today Nornickel speaks the same language with us” concluded the Russian head of Bellona.<p><p> HT<p>", "time": "2018-11-19T16:39:14+02:00", "type": "business"}
{"title": "Restamax to shed 200 positions months after acquiring Royal Ravintolat", "url": "http://www.helsinkitimes.fi/business/15934-restamax-to-shed-200-positions-months-after-acquiring-royal-ravintolat.html", "review": "", "content": "<p> <p><p>Restamax on Monday announced it has wrapped up consultative negotiations with its employees and decided to reduce 200 positions and convert the contracts of 40 employees to part-time contracts.<p><p>The Tampere-based restaurant and labour hire company stated that the positions will be reduced through involuntary lay-offs and voluntary arrangements, as well as through non-renewals of intermittent employment contracts.<p><p>The belt-tightening measures, it added, will affect both blue- and white-collar employees.<p><p>The newly completed consultative negotiations were launched a couple of months after Restamax acquired Royal Restaurants for 90 million euros on 1 June 2018. Restamax in September announced it will re-organise its operations and reduce organisational overlap in order to create considerable synergies and improve its profitability.<p><p>The restaurant company estimates now that by reducing overlap in its management and administrative operations, leveraging the economies of scale in procurement and boosting staff productivity will enable it to create synergies worth a minimum of six million euros as early as in 2019.<p><p>All employees to be made redundant will be offered an opportunity to participate in employment services organised by Restamax, according to its press release.<p><p>Aleksi Teivainen – HT<p>", "time": "2018-11-07T06:36:15+02:00", "type": "business"}
{"title": "Stockmann to sell its shopping centre in St. Petersburg", "url": "http://www.helsinkitimes.fi/business/15888-stockmann-to-sell-its-shopping-centre-in-st-petersburg.html", "review": "", "content": "<p> <p><p>Stockmann on Tuesday announced it will divest its shopping centre in St. Petersburg, Russia, to PPF Real Estate.<p><p>The Nevsky Centre and its owner, OOO Stockmann Nevsky Centre, will change hands at a price of 171 million euros, 10 million euros less than the balance sheet value of the property, according to a press release from the Finnish department store retailer.<p><p>Lauri Veijalainen, the CEO of Stockmann, says the retailer is pleased to have found a buyer that is committed to developing the centrally located shopping centre further.<p><p>“The divestment enables Stockmann to fully focus on developing its department store properties in Finland and the Baltic countries. At the same time, it gives us financial flexibility and a possibility to deleverage the group’s balance sheet,” he tells.<p><p>Stockmann revealed its objective is to close the transaction by year-end but reminded that it is still subject to approval from the Russian Federal Antimonopoly Service. The divestment, it added, will have a net positive cash flow effect of roughly 139 million euros.<p><p>Aleksi Teivainen – HT<p>", "time": "2018-10-16T13:07:59+03:00", "type": "business"}
{"title": "OP Financial Group to launch consultative talks with 6,000 employees", "url": "http://www.helsinkitimes.fi/business/15842-op-financial-group-to-launch-consultative-talks-with-6-000-employees.html", "review": "", "content": "<p> <p><p>OP Financial Group on Tuesday announced it will launch consultative negotiations with its staff with a view to reducing the annual costs of its central co-operative by 100 million euros.<p><p>The Finnish financial services provider said the negotiations will concern all of the approximately 6,000 people employed by the central co-operative but refrained from specifying the number of redundancies it plans to make.<p><p>The negotiations will not concern the member banks of OP Financial Group. Helsinki OP-Kiinteistökeskus, Pohjola Health, OP Bank Group Pension Fund and OP Corporate Bank Group’s Baltic operations have similarly been ruled outside the scope of the negotiations, which are expected to take at least six months.<p><p>OP Financial Group said the belt-tightening measures are an attempt to “specify the strategic focus, focus on core businesses and optimise the relation between in-house and purchased outsourced work”. It also stated that while the strategic shift will result in the termination of some existing jobs, it will also create “a significant number of new job opportunities” to employees.<p><p>Timo Ritakallio, the chairperson of the executive board at OP Financial Group, says the re-organisation signals the beginning of a major cultural change at the financial services group.<p><p>“We have trialled the agile practice in individual development projects with good results, and now our aim is to gradually extend this practice to cover the entire central co-operative,” he states in a press release. “The new practice will simplify responsibilities, reduce decision-making levels and guide operations according to customer needs.”<p><p>The negotiations are to begin on 1 October.<p><p>Aleksi Teivainen – HT Source: Uusi Suomi<p>", "time": "2018-09-26T08:06:02+03:00", "type": "business"}
{"title": "Nordea executive appointed as CEO of Finnair", "url": "http://www.helsinkitimes.fi/business/15797-nordea-executive-appointed-as-ceo-of-finnair.html", "review": "", "content": "<p> <p><p>Topi Manner, the head of personal banking at Nordea, has been appointed as the successor of Pekka Vauramo as the CEO of Finnair.<p><p>The Finnish flag carrier announced the appointment yesterday, highlighting the 44-year-old Manner’s extensive experience in dealing with both private and corporate customers and his key role in the digital transformation and customer service development of Nordea.<p><p>“We believe Topi’s people-centric leadership is an excellent fit for a service company like Finnair, which is all about people, both personnel and customers,” commented Jouko Karvinen, the board chairperson at Finnair.<p><p>Manner will assume his responsibilities at the helm of the majority state-owned airline on 1 January 2019.<p><p>Finnair, he said, is an iconic, ever-changing company with a significant national role. “I am proud to have been selected to be part of Finnair’s competent team to build the company’s future and to develop the experiences related to flying and travel together with other Finnair employees,” stated Manner.<p><p>Vauramo left the airline yesterday to take over as the chief executive of Metso Group on 1 November 2018. Pekka Vähähyyppä, the chief financial officer at Finnair, will serve as the airline’s interim chief executive until 31 December 2018.<p><p>Aleksi Teivainen – HT Source: Uusi Suomi<p>", "time": "2018-09-05T09:35:26+03:00", "type": "business"}
{"title": "Marimekko posts improved Q2 result, upgrades outlook for 2018", "url": "http://www.helsinkitimes.fi/business/15741-marimekko-posts-improved-q2-result-upgrades-outlook-for-2018.html", "review": "", "content": "<p> <p><p>Marimekko announced yesterday it has upgraded its guidance for the rest of the year after recording an increase of 24 per cent in revenue, to 28.2 million euros, and one of 443 per cent in comparable operating profit, to 3.1 million euros, between April and June.<p><p>The Finnish fashion house said it expects its full-year revenue to grow from the previous year and comparable operating profit to at least stay at level of the previous year.<p><p>The increase in second-quarter revenue was attributable especially to healthy growth in retail (11%) and wholesale sales (27%) in Finland, and an up-tick of 32 per cent in wholesale sales in the Asia-Pacific. <p><p>Finland continues to account for roughly a half of the net sales of Marimekko.<p><p>“I think we can be quite pleased with the positive trend in our net sales, which was also partly strengthened by timing-related factors,” comments Tiina Alahuhta-Kasko, the chief executive of Marimekko.<p><p>“Part of the growth was due to the fact that deliveries for the third quarter were transferred to the preceding quarter,” she adds.<p><p>Marimekko also recorded a non-recurring gain of six million euros for the sale of its head office in Herttoniemi, Helsinki. Alahuhta-Kasko says the sale solidified the financial position of the company and that the options for using the sales proceeds will be explored by the board of directors in the autumn.<p><p>She also viewed that the first half of the year demonstrated that the company has developed its collections and brand in the right direction.<p><p>“This encourages us to continue the long-term work by which we seek clearly stronger growth than before. Our core objective is for our products to appeal to a wider customer base,” she said.<p><p>Marimekko, she added, will also seek to step up investments in its branding and marketing efforts in China, where it set up a subsidiary in July.<p><p>Aleksi Teivainen – HT Photo: Onni Ojala – Lehtikuva<p>", "time": "2018-08-10T06:41:52+03:00", "type": "business"}
{"title": "What happened to Bitcoin?", "url": "http://www.helsinkitimes.fi/business/15735-what-happened-to-bitcoin.html", "review": "", "content": "<p>If you are a cryptocurrency enthusiast, you probably are well aware of all the new currencies, the so-called Initial Coin Offerings (ICOs) and of course the exchange rates of all currencies and how to mine them. <p><p>For the general public, however, names, and rates of cryptos and the most known of them Bitcoin come to spotlight only when the mass media is covering them, i.e. when drastic changes are occurring. Bitcoin was last on the news when it passed the staggering 16 000 Euro price mark in December 2017. The price for one Bitcoin was just a bit more than 700 Euro in January of the same year. Today each bitcoin is exchanged for around 6000 Euro, it has a current circulating supply of 17.2 Million coins and a total volume exchanged of 5,726,256,209 Euro.<p><p>Prices of other cryptocurrencies seem to fluctuate more or less in sync with Bitcoin. Numerous crypto-millionaires and perhaps some billionaires have been made, and many could lose fortunes if they bought high and can sell only for a fraction of the price now.<p><p>Cryptocurrency has been debated a lot as either the future of money or just an investment instrument like other stocks and bonds or at worst a hoax or a pyramid scam where mostly early founders and creators get rich and others lose. The problem with seeing crypto as money is that there are hardly any places you can buy thing with Bitcoin or other cryptocurrencies. You have to first exchange it for traditional Dollars or Euros in places like Localbitcoin or other exchange sites to be able to spend it. There are exceptions however. Here are a few ways you can spend Bitcoins, and in some case only bitcoins:<p><p>Dark Web products and services<p><p>Accessing the so-called Dark Web is easier than you think. Just download a Tor Browser and start browsing. Dark Web, which reroutes internet traffic through Onion servers is said to give users more anonymity and of course, anonymous modes of payment suit that well. Online stores on the Dark Web sell illegal items like banned drugs and prescription medicine, weapons and stolen items or credit card information, passwords etc.. There you can also hire a hacker, contract killer, a private investigator or a “revenge agent” if your are holding an incurable grudge against a foe. These sites and service not only accept cryptocurrency, but it’s the only currency they accept. <p><p>But don’t get fooled, the Dark Web is not as anonymous as you think, Tor network was founded and built by the US army and intelligent services to make communication from censored countries and between covert agents possible. Big enough players and people of interest could be tracked easily. The arrest of Silk Road administrator, Ross Ulbricht is an example of that. He is serving a life sentence for dealing drugs on the Dark Web.<p><p>Online Gaming<p><p>There is an increasing number of online gaming companies accepting crypto. Companies like Microsoft, have recently started offering games and other apps for bitcoin. Others like this Minecraft server are actually using the bitcoin network to power their in-game currency! <p><p>Increasing number of online gambling sites also accept Bitcoin. Casinoproffa lists the sites which even prefer bitcoin to traditional currencies. As for why to use Bitcoin instead of regular cash or credit cards, the site lists the following reasons: Speed, bonuses, anonymity and reduced transaction fees.<p><p>Offline purchases<p><p>There are not many shops or restaurants that accept Bitcoin, but much more than a few years ago. bitcoinrestaurants.net lists at least 83 restaurants where you can pay with Bitcoin. There are also travel agencies and service providers which accept Bitcoin, You can pay for a hotel with Expedia, book a flight with CheapAir, or take a cruise with Ships &amp; Trips Travel. Galactic will accept Bitcoins as payment to take you to Space.<p><p>Sites like eGifter, or Gyft also let you buy gift cards using Bitcoins and the spend it on Amazon, Bestbuy or many other retailers. You can also give your bitcoins for charity or tip bloggers. spendbitcoins.com provides a comprehensive list of all the places you can spend Bitoins.<p><p>HT<p><p>graph: coingecko.com<p>", "time": "2018-08-07T22:00:00+03:00", "type": "business"}
{"title": "Deal with T-Mobile “a huge win for Nokia”, says analyst", "url": "http://www.helsinkitimes.fi/business/15719-deal-with-t-mobile-a-huge-win-for-nokia-says-analyst.html", "review": "", "content": "<p> <p><p>Analysts have drawn attention to the significance of the newly announced fifth-generation (5G) network agreement between Nokia and T-Mobile.<p><p>The Finnish network equipment manufacturer stated earlier this week it will provide its end-to-end 5G portfolio of technology, software and services to accelerate the deployment of the nationwide 5G network of T-Mobile in the United States. The multi-year agreement between the two telecommunications companies is worth 3.5 billion US dollars, or approximately three billion euros.<p><p>“This is our largest 5G deal to date – in fact, it’s one of the largest-ever deals,” Phil Twist, the head of global marketing at Nokia, was quoted as saying by Reuters.<p><p>“A huge win for Nokia in the 5G domain,” tweeted Teresa Mastrangelo, a principal analyst at Broadbandtrends.<p><p>Inderes, a Finnish market research company, pointed out that the announcement validates Nokia’s high expectations for the latter half of the year. The network equipment manufacturer, it reminded, stated in its earnings call last week that it is close to announcing a major 5G agreement in the United States.<p><p>Also Nokia confirmed that the impact of the multi-billion-dollar agreement was taken into consideration in the forward-looking statements in its interim report for the second quarter.<p><p>Rajeev Suri, the chief executive of Nokia, has repeatedly affirmed that the network equipment maker is well-positioned to take advantage of the expected acceleration in the adoption of 5G technology in the second half of 2018.<p><p>“Nokia is well-positioned for the coming technology cycle given the strength of our end-to-end portfolio,” he stated in the company’s interim report.<p><p>Inderes estimated last week that the faster-than-anticipated adoption of 5G technology by wireless carriers could prove a problem for network suppliers such as Nokia.<p><p>“It’s somewhat ironic that the short-term challenges have to do with the fact that 5G is coming sooner than expected: customers operating on old budgets will demand more and higher speeds for the same money, and the supply chain won’t be able to deliver the speeds needed,” explained Mikael Rautanen, an analyst at Inderes.<p><p>“[Nokia's] comments about rising cost pressures aren't about competition but about the attempts of big clients to fund their accelerated 5G projects from the pockets of network suppliers,” he added. “Suri has stated that a few major clients are transitioning to 5G ahead of schedule, but they’ll have to fund [the transition] from their old budgets.”<p><p>Aleksi Teivainen – HT Photo: Lluis Gene – AFP/Lehtikuva Source: Uusi Suomi<p>", "time": "2018-08-01T06:41:53+03:00", "type": "business"}
{"title": "Nokia inks its largest 5G agreement to date with T-Mobile", "url": "http://www.helsinkitimes.fi/business/15716-nokia-inks-its-largest-5g-agreement-to-date-with-t-mobile.html", "review": "", "content": "<p> <p><p>Nokia and T-Mobile announced yesterday they have signed a multi-billion euro, multi-year agreement to accelerate the deployment of a nationwide fifth-generation (5G) wireless network in the United States.<p><p>The landmark agreement is valued at roughly three billion euros (USD3.5bn), making it the largest 5G agreement to date for Nokia.<p><p>The Finnish network equipment manufacturer will provide its end-to-end portfolio of 5G technologies, software and services to the third largest wireless carrier in the United States, assisting the carrier to in the commercial roll-out of its 5G network.<p><p>Related posts:<p><p>“Nokia and T-Mobile will advance the large-scale deployment of 5G services throughout the United States,” Ashish Chowdhary, the head of customer operations at Nokia, states in a press release. “This is a testament to our companies’ strong and productive working relationship, one which has produced several important technological milestones in recent months and which now allows us to make 5G a commercial reality.”<p><p>T-Mobile will leverage a variety of products on the 5G portfolio of Nokia, including AirFrame hardware, CloudBand software and AirScale radio platforms and cloud-native core.<p><p>“We are all in on 5G,” says Neville Ray, the chief technology officer at T-Mobile. “Every dollar we spend is a 5G dollar, and our agreement with Nokia underscores the kind of investment we are making to bring customers a mobile, nationwide 5G network.”<p><p>Nokia on Monday followed up the announcement by reiterating its outlook for 2018.<p><p>Aleksi Teivainen – HT Photo: Mikko Stig – Lehtikuva<p>", "time": "2018-07-31T06:01:28+03:00", "type": "business"}
{"title": "Laiva sets sail for a new journey", "url": "http://www.helsinkitimes.fi/business/15712-laiva-sets-sail-for-a-new-journey.html", "review": "", "content": "<p><p><p>Firesteel Resources, a top performing junior gold mining company listed on the TSXV, acquired Laiva gold mine located near Raahe, Finland. Laiva (Finnish word for ship), which was dormant since 2013, has already been restarted and gold production begins this year.<p><p>Firesteel Resources’ President and CEO Mr. Michael Hepworth is the new captain. Mr. Hepworth is an accomplished entrepreneur and business leader with more than 40 years of diverse international business experience. Mr. Hepworth has started and built 5 successful businesses from the ground up. He also consulted and advised businesses, in many sectors including professional and financial services, high tech, engineering and manufacturing. Mr. Hepworth has over 15 years of corporate development and senior management experience in the resources industry. Helsinki Times sat down with Mr. Hepworth to find out about his plans for Laiva and the future of gold. Below are excerpts of the interview.<p><p> <p><p>HT: Tell us about Firesteel and the “Laiva” project. Why was Laiva shut down in 2013 and what are the changes and developments you are going to implement to make it profitable?<p><p>MH: Laiva shut down because it was losing money. The team operating it were competent exploration geologists but had no mining experience. There were no mining engineers directing operations and many mistakes were made. The operators were bulk mining a low-grade deposit that required very selective mining practices<p><p> HT: What has happened in the past few months regarding recruitment and operations in the mine?<p><p>MH: The last few months have been taken up with recruiting a new team. The management team is in place, but recruitment is still moving full steam ahead and there are many openings. See www.nordicgold.fi for job openings.<p><p>We have also been involved in getting the mine ready to start mining. This has now started, and we are currently stockpiling ore for when the mill and plant start running. <p><p>We have a significant amount of maintenance to do on the mill but most of it is low capex. We have relined the mills but there are still pumps and pipes to be replaced. Conveyor systems need new motors and servicing, and there are numerous small jobs which need to be completed before we start producing gold in late October.<p><p> HT: What are the challenges you see in your way?<p><p>MH: We are very lucky as there are few insurmountable problems. The biggest challenges appear to be finding suitably qualified and experienced people and the summer holidays. Summer is the best time to get all the work done to restart the mine, but many suppliers are running reduced operations at this time of the year and people are not available to do the work. Fortunately, we are profitable at current gold prices.<p><p>HT: Two research houses have placed target prices on Firesteel shares that range from $0.55 to $0.85. Firesteel is currently trading at $0.15. Why do you think Firesteel is so undervalued at the moment?<p><p>MH:This is a big frustration for me. I think it is due to several factors:<p><p>1. Gold is out of favour as an investment at the moment and this means Canadian investors (TSX is the largest resource investment market in the world) are looking to put their money that would have gone into gold into things like marijuana stocks and blockchain.<p><p>2. The other reason is that gold stocks typically go into the doldrums in the summer as people take vacation etc. I believe in the fall this will change.<p><p>3. People want to see if we can get to production before investing. My expectation is that once we start producing gold there will be a rapid repricing. Producers are measured on cash flow and once this starts the numbers are very clear.<p><p>HT: Mining cobalt is also becoming more attractive as demand for lithium-ion batteries increases. BBC just reported about the “new gold rush” for mining cobalt. Do you plan to recover cobalt from Laiva as well?<p><p>MH:There is clearly cobalt at Laiva and we have been using it as an indicator mineral for gold. We are currently testing our high-grade tailing dams for cobalt and may well be able to produce cobalt as a byproduct. Given that it is there, and it is already processed it is essentially free.<p><p> HT: Why is Finland ranked as the top mining jurisdiction in the world?<p><p>MH:The Fraser Institute does an annual survey on mining companies and this survey examines many issues that range from from property rights to ease of doing business with government departments and while there is still room for improvement in some areas Finland scores very well on most parameters.<p><p>Our experience in Finland has been very positive; The people are well educated, there is good infrastructure and the rules are clear. Our top people like the country and most of the expats have brought their families and have either bought or are planning on buying houses in Finland.<p><p>HT: How do you see the development of gold prices considering the ongoing financial and political situation?<p><p>MH: I wish I had a crystal ball and could tell what was going to happen, but I do believe the gold price will rise. The huge amount of debt and the continued money printing undermines the value of fiat currencies. The political uncertainties in the world today will ultimately be good for gold as will looming trade wars etc. Mr. Trump’s Twitter account adds to this uncertainty which will ultimately benefit gold investors. The good news for us is that our PEA gives us a sound financial model on which to base our plans and right now we would be profitable right down to $1100 gold. Investing in Laiva is a good way to buy gold in the ground cheaply and get good leverage to any improvements in price.<p><p>Alexis Kouros<p><p>Helsinki Times<p><p>Image credits: Firesteel Resources<p>", "time": "2018-07-28T20:22:34+03:00", "type": "business"}
{"title": "Nokia’s Q2-result falls short of expectations", "url": "http://www.helsinkitimes.fi/business/15709-nokia-s-q2-result-falls-short-of-expectations.html", "review": "", "content": "<p> <p><p>Nokia saw its share value dip by five per cent to 4.82 euros after it issued a second-quarter result that missed the expectations of investors.<p><p>The Finnish network equipment manufacturer stated yesterday that its operating profit decreased by 240 million euros year-on-year to 334 million euros between April and June, falling 39 million euros short of the analyst mean forecast of 373 million euros, according to Reuters.<p><p>Its second-quarter revenue fell from 5.63 billion to 5.32 billion euros but exceeded the mean forecast of 5.15 billion euros.<p><p>Rajeev Suri, the CEO of Nokia, pointed out that the quarterly results were consistent with the network equipment maker's view that the first half of the year would be followed by a second half boosted by the accelerating adoption of fifth-generation (5G) wireless networks.<p><p>“Our view about the acceleration of 5G has not changed and we continue to believe that Nokia is well-positioned for the coming technology cycle given the strength of our end-to-end portfolio. Our deal win rate is very good, with significant recent successes in the key early 5G markets of the United States and China,” he said in a press release.<p><p>“We expect market conditions to improve further in the second half,” summarised Suri.<p><p>Nokia on Thursday also reiterated its outlook for and its ability to generate 1.2 billion euros in recurring annual cost savings in 2018.<p><p>Aleksi Teivainen – HT Photo: Jussi Nukari – Lehtikuva Source: Uusi Suomi<p>", "time": "2018-07-27T06:25:49+03:00", "type": "business"}
{"title": "Startup of the year: Codejig", "url": "http://www.helsinkitimes.fi/business/15698-startup-of-the-year-codejig.html", "review": "", "content": "<p>Imagine if you were given “Lego” blocks of code, anyone could use, to expand, change or customise your software. This is the genius idea behind Codejig that Vadym Kozyak and Vasyl Biletskyy came up with in 2013. If you have always wondered why developers don’t create software which would make the need for so many developers obsolete, well here it is.<p><p>Codejig ERP (enterprise resource planning) is a fully customisable solution for small and medium-sized enterprises. Without any special training, users can add new fields or remove existing ones, create or redesign forms and menus, manage security, adjust application logic, develop new sections of the system or even create entire modules from scratch.<p><p>Guided by the idea of user empowerment, Codejig emphasises on functionality and usability. Codejig ERP has ten functional modules: Sales, Purchase, Banking, Inventory, Fixed Assets, VAT, CRM, Accountant, Settings, and Reports. Codejig ERP is compliant with International Financial Reporting Standards (IFRS).<p><p>In addition to its international edition, Codejig has started to deliver a range of country-specific versions of its ERP software and a localised version for Finland has been released so far. Danish and Swedish versions are in the final stage of development. The Finnish version of Codejig ERP supports the exchange of electronic invoices by implementing the Finvoice invoicing format. Finnish users can also benefit from using the standard integration with a forwarding service provider Apix to send e-invoices directly from Codejig ERP.<p><p>Powerful customisation and localisation capabilities of Codejig ERP come from the technology utilised to develop the system. Codejig Limited revolutionised software development by introducing Codejig Builder to develop Codejig ERP.<p><p>Codejig Builder is a low-code development platform that allows the creation of business applications. It comes as a part of Codejig ERP and enables users to customise the system. Codejig Builder is expected to be released soon as a stand-alone app development platform.<p><p>Codejig offers a game-changing experience where the customer is in control, not the ERP vendor. <p><p>Company Profile: Codejig Limited is a Maltese software company with a development center in Lviv, Ukraine. It was founded in 2013. The company delivers its software using SaaS (Codejig ERP) and aPaaS (Codejig Builder) business models and has adopted a subscription-based licensing model for its products.<p><p>Codejig ERP is now available in Finland. It was released in June 2018. Basic version is free to use and the standard version costs only 30 Euros a month per user.<p>", "time": "2018-07-23T12:57:28+03:00", "type": "business"}
{"title": "Telia to acquire Bonnier Broadcasting, the parent company of Finnish MTV and C More", "url": "http://www.helsinkitimes.fi/business/15694-telia-to-acquire-bonnier-broadcasting-the-parent-company-of-finnish-mtv-and-c-more.html", "review": "", "content": "<p> <p><p>Telia on Friday announced it has agreed to pay 890 million euros to acquire Bonnier Broadcasting, the parent company of Sweden’s TV4, Finnish MTV and C More.<p><p>The Stockholm, Sweden-headquartered mobile network operator states in a press release that the acquisition is of great strategic importance as it strengthens the company in the rapidly growing area of video content consumption and enables the company to combine its networks and their millions of users with one of the most successful commercial media houses in the Nordics.<p><p>“It is a very important day for Telia Company,” summarises Johan Dennelind, the CEO of Telia.<p><p>“We have great respect for our new role as a media owner and have a clear view of how we will maintain the editorial integrity of the business going forward. I look forward to welcoming some of the most talented TV-content producers in the Nordics to Telia Company,” he adds.<p><p>Telia also stated it will establish a new business area that includes both its existing television business and the businesses making up Bonnier Broadcasting.<p><p>Bonnier Broadcasting is a subsidiary of Bonnier, a Swedish media group consisting of 175 companies in 15 countries. The broadcasting division employs 1,200 people, including roughly 250 in Finland. The acquisition is subject to regulatory approvals and is expected to be completed during the second half of 2019.<p><p>Aleksi Teivainen – HT Photo: Emmi Korhonen – Lehtikuva<p>", "time": "2018-07-20T10:46:59+03:00", "type": "business"}
{"title": "Finnair downgrades guidance for second half, sends shares tumbling", "url": "http://www.helsinkitimes.fi/business/15688-finnair-downgrades-guidance-for-second-half-sends-shares-tumbling.html", "review": "", "content": "<p> <p><p>Finnair on Tuesday sent its share value tumbling by announcing it expects soaring jet fuel prices to undermine its profitability in the second half of this year.<p><p>Helsingin Sanomat reported that the majority state-owned airline saw its shares lose 15 per cent of their value – to 7.14 euros – after it warned that its full-year result is not expected to improve from the 170 million euros posted last year.<p><p>Finnair said it revised its expectations for the year due to not only rising jet fuel prices but also intensifying competition on routes between Europe and Asia, and Europe and North America.<p><p>The airline also reported that its second-quarter revenue increased by 13 per cent year-on-year to 715 million euros and comparable operating result by 28 per cent to 47.9 million euros. Its first-half revenue, in turn, rose by 14 per cent to 1.35 billion euros and comparable operating result by 82 per cent to 51.8 million euros.<p><p>Pekka Vauramo, the chief executive of the flag carrier, reminded that overall the second quarter was good for Finnair.<p><p>“Our comparable operating result rose to 47.9 million euros, a new record for the period, in spite of the increase in jet fuel price. Our capacity grew broadly in line with our expectations, nearly twice as fast as the market as a whole,” he said in a press release.<p><p>The improved result, he added, indicates that the airline has succeeded in implementing its growth strategy.<p><p>“Demand followed our capacity growth fairly well in all traffic areas and our passenger load factor was at a good level. Passengers volumes increased particularly in Asian traffic,” said Vauramo. “We broke our monthly passenger records in May and June. Also travel services revenue developed well, whereas the growth of ancillary sales and cargo revenue was slower than we expected.”<p><p>Aleksi Teivainen – HT Photo: Martti Kainulainen – Lehtikuva<p>", "time": "2018-07-18T09:26:44+03:00", "type": "business"}
