{"title": "Finland-China International Contemporary Ink Art Exhibition", "url": "http://www.helsinkitimes.fi/culture/16052-finland-china-international-contemporary-ink-art-exhibition.html", "review": "", "content": "<p><p><p>The opening reception of Finland-China International Contemporary Ink Art Exhibition was successfully held at Red Gallery on 15th December 2018. The exhibition is a diverse and international / intercultural event presenting works of artists from different countries.<p><p>The exhibiting artists, Zhang Miao, Yu Cun, Liang Yue and Zhang Du are from China, the artist Maya Zhang is from Canada, the artist Xiao Qing is from France, the artist Chen Sijia is from the US, and the artists Rain Lin, Mikko Ilmari Hallikainen and Mia Waire are from Finland.<p><p> <p><p>Mr. Gao Yuhang, Head of Education Sector, Chinese Embassy in Finland, attended the opening reception. Meanwhile, The event was also covered by Chinese and international media, among others Mr. Li Jizhi, chief correspondent of Xinhua Helsinki Bureau, covered this exhibition and interviewed the exhibiting artists.<p><p> <p><p> <p><p> <p><p>Exhibition Info<p><p>FINLAND-CHINA INTERNATIONAL CONTEMPORARY INK ART EXHIBITION<p><p>Curator<p><p>RAIN LIN <p><p>Artists：<p><p>ZHANG MIAO (CHINA)<p><p>YU CUN (CHINA) <p><p>LIANG YUE (CHINA)<p><p>ZHANG DU (CHINA) <p><p>MAYA ZHANG (CANADA) <p><p>CHEN SIJIA (US) <p><p>XIAO QING (FRANCE)<p><p>RAIN LIN (FINLAND)<p><p>MiIKKO ILMARI HALLIKAINEN (FINLAND ) <p><p>MIA WAIRE (FINLAND) <p><p>Exhibition Duration：<p><p>15. 12. 2018 — 15. 02. 2019<p><p>Open Hours：<p><p>12:00 - 18:00<p><p>Venue：<p><p>Red Gallery<p><p>Pursimiehenkatu 16, 00150 Helsinki<p><p> <p><p>CHINESE ARTISTS<p><p> <p><p><p><p>ZHANG MIAO<p><p> <p><p>Existence<p><p>I am a realist<p><p> I only care about myself and about what happens around me<p><p>Reality does not exist only in the world we live in<p><p>It also exists in my heart<p><p>My mind’s reality is often absurd, distorted and abstract<p><p>so when I show my inner world out<p><p>people may see a strange world<p><p>For me, this is a real existence <p><p> <p><p> <p><p> | Paradise | 40X40 cm | 2018<p><p> <p><p> <p><p> | Bird in the cage | 40X40 cm | 2018<p><p> <p><p> <p><p> | Ex Machine | 40X40 cm | 2018<p><p> <p><p> <p><p> <p><p><p><p>YU CUN <p><p> <p><p> Art sometimes<p><p> can only be grasped by the mind but not expressed with words<p><p> especially from inarticulate people like myself<p><p> <p><p> <p><p> <p><p> | Ungainly Freedom | 180 X 97 cm | 2018<p><p> <p><p> <p><p> |How Many Years | 138 X69 cm | 2018<p><p> <p><p> <p><p> <p><p> <p><p><p><p> LIANG YUE<p><p> <p><p>The artwork is an artist’s way to spread their own experience into place for themselves and for others, always to combine life experiences to find a breakthrough point. <p><p> <p><p> <p><p> | PORTRAIT | 37X57 cm | 2018<p><p> <p><p> <p><p> <p><p>| FIVE AVATARS | 35X70.5 cm | 2018<p><p> <p><p> <p><p> | PEOPLE WEARING A MASK | 49X34 cm | 2018<p><p> <p><p> <p><p> <p><p><p><p> ZHANG DU<p><p> <p><p>All the recognition and expression in my painting “The codification of mental state and liberation of inertial thinking”, is presented through subjective initiative and the ability of logical thinking. My painting is mainly a discussion of personal painting consciousness, using the right hand to draw which is not often used, thus liberating the former work inertia of the left hand. Those uncertain morphological structures get rid of the entanglement of habitual modeling. By then, the painting’s orientation is the disordered and uncertain factor. It may be the way of visual thinking, about my concerns, the way I want to express myself.<p><p> <p><p> <p><p>| Hello Finland | 138X70 cm | 2018<p><p> <p><p> <p><p> <p><p><p><p>| XUE DINGE’S CAT | 138X70 cm | 2018<p><p> <p><p> <p><p> | TOWER | 138X70 cm | 2018<p><p> <p><p> <p><p> <p><p> <p><p> <p><p>INTERNATIONAL ARTISTS<p><p> <p><p> <p><p><p><p> MAYA ZHANG<p><p> <p><p>My works are my personal subjective feeling through different time-periods. It all comes from the observation of inner visions of the present world around me. Whether I wish to be carried on wings or describe a scene in real life, between image and reality, reappearances and expressions, I always go back and forth between reality and imagination. Ultimately, a process of expressing one's inner world.<p><p> <p><p> <p><p> <p><p>| Maya Zhang | Wings | 2018<p><p> <p><p> <p><p> <p><p><p><p> | Beyond | 2018<p><p> <p><p> <p><p> | Passerby | 2018<p><p> <p><p> <p><p> <p><p> <p><p><p><p>RAIN LIN<p><p> <p><p>I like to give myself unlimited freedom in my creation, express my emotion with the most innocent feeling, so that I can completely forget everything, immerse myself into my own world, and be powerful and unconstrained style… <p><p>This is my most enjoyable creation status.<p><p> <p><p>| Walking the dog series 1 | 2018<p><p> <p><p> <p><p> <p><p> | Walking the dog series 2 | 2018<p><p> <p><p> <p><p> <p><p> | Walking the dog series 3 | 2018<p><p> <p><p> <p><p> <p><p> <p><p><p><p> CHEN SIJIA<p><p> <p><p>Stroke<p><p>This series of artwork refers to elements of abstraction, depicting environments through several interwoven layers. They contain personal narratives through the use of shapes, symbols, and colour fields, which are characterised by a liberal yet focused application of colour and strokes.<p><p> <p><p> <p><p> | Strike 2 | 2018<p><p> <p><p> <p><p> <p><p> | Strike 4 | 2018<p><p> <p><p> | Strike 7 | 2018<p><p> <p><p> <p><p> <p><p><p><p>XIAO QING<p><p> <p><p>My paintings are based on ink, I combine them with western abstract elements. The character of ink’s black-and-white, thick-and-light evokes the scenery of lakes and mountains, the hazy beauty of mist and cloud, like a dream-scene. At the same time, it also pursues musical beauty, a kind of melody and rhythm. I strive to interpret Chinese aesthetics “The great Form is without Shape\", hoping to bring endless reverie to the audiences.<p><p> <p><p> <p><p> | Nuage rouge| 42 X 38 cm | 2004<p><p> <p><p> | Beauté du Soir | 46 X 34 cm | 2005<p><p> <p><p> <p><p>| Brouillard matinal | 46 X 34 cm | 2004<p><p> <p><p> <p><p> <p><p><p><p>MIKKO ILMARI HALLIKAINEN<p><p>I have been using ink as material since I was a little boy. Its flexibility, characteristic tone and power fascinate me. My themes are often linked to my daily experiences and moods. I see myself as an expressionist composer. <p><p> <p><p> <p><p>Mikko Ilmari Hallikainen| Snowblind | 30 X 50 cm | 2016<p><p> <p><p> Mikko Ilmari Hallikainen | Death Stand | 70 X 50 cm | 2018<p><p> <p><p> <p><p><p><p>Mikko Ilmari Hallikainen | Gardener of death | 35 X 26 cm | 2018<p><p> <p><p> <p><p> <p><p> <p><p><p><p>MIA WAIRE<p><p> <p><p>Goddesses<p><p>It was a time when we prayed to the female god. These goddesses protected the home, children, food, love, and justice. <p><p>Works of Goddesses is a series of drawings of ancient Egyptian goddesses. The technique I've used ink, paper and cane<p><p> <p><p> <p><p>Mia Waire | The Queen of heaven II | 2014<p><p> <p><p> <p><p><p><p>Mia Waire | The goddes of death | 2014<p><p> <p><p> <p><p>Mia Waire | The War Goddess | 2014<p><p> <p><p> <p>", "time": "2019-01-11T14:10:00+02:00", "type": "culture"}
{"title": "AS ALIKE AS EACH", "url": "http://www.helsinkitimes.fi/culture/15998-as-alike-as-each.html", "review": "", "content": "<p> <p><p>Contemporary Illustrations and Images Exhibition of China and Europe <p><p> In October 2018 in Shanghai, China, the Sino-European Illustrations and Images Exhibition have been successfully organized, with the support from artists, schools, organizations, and governments of China and Finland and other European countries.<p><p>Now we bring the traveling exhibition to Helsinki. We have invited Finnish artists Leena Kisonen and Sari Airola, as well as Chinese artists Gao Jing, Zhai Wensi, Hanqin, and Zhu Gege.<p><p>Meanwhile, students from Shanghai printing and publishing College and students from visual communication of Aalto University are also invited to exhibit their selected works and projects. The exhibition sets up an international cultural and creative platform of art education, creation, and communication.<p><p>The inspiration for artistic practice derives from the unique perspective and personal experience of artists, which are between reality and personal perceptions. Whether it is from the perspective of creation, teaching or researching, this subtle but ever-changing experience varies from person to person. It’s always worthy of being explored excitedly by artists and educators. In true life, if you listened to and respect inspirations brought by “truth”, you will realize clearly your own direction in the art creation process. During practice, the direction will be clearer over time. On the basis of such thoughts, we came up the theme of the exhibition as “As Alike As Each”.<p><p> <p><p><p><p>Exhibition Info<p><p>Artist：<p><p>Sari Airola Finland<p><p>Leena Kisonen Finland<p><p>翟文思 Zhai Wensi China<p><p>高婧 Gao Jing China <p><p>朱戈戈 Zhu Gege China<p><p>韩琴 Han Qin China<p><p>Students from Shanghai printing and publishing College <p><p>Students from visual communication of Aalto University<p><p>Exhibition Duration：16. 11. 2018 — 05. 12. 2018<p><p>Curator：Aixia Li/ Wensi Zhai<p><p>Unit: <p><p>Shanghai Children’s Book Research Center<p><p>China-EU International Children’s Picture Book Art Studio<p><p>Venue：Red Gallery, Pursimiehenkatu 16, 00150 Helsinki<p><p> <p><p>Artists: <p><p> Sari Airola<p><p> Chairperson in the Finnish illustration Association<p><p>Teaches in Aalto University, Helsinki, Finland<p><p>Sari Airola is a Helsinki based illustrator, author, and teacher<p><p> She has been the illustrator since 1997. And author since 2006<p><p>Her background is in Art Education<p><p>Sari Airola works on picture books and editorial illustration<p><p>Her special interests are in contemporary illustration, reading skills and multicultural education<p><p>Sari Airola is a chairperson in the Finnish illustration Association<p><p>She teaches in Aalto University, Helsinki, Finland<p><p> <p><p>Leena Kisonen<p><p> Illustrator/Artist/Graphic designer<p><p>Specializing in lifestyle illustration for products, packaging, and spaces<p><p>Her work is a colorful swirl of motifs, patterns, and lettering<p><p>Leena is a native of the North, and her illustrations have a lot of Scandinavian influence<p><p>Leena loves all things Japanese, which also shows strongly in her work<p><p>Leena is based in Helsinki, Finland and she works with clients in Europe, Asia, and the US. Her clients include Google, Intercom, Snapchat and Isetan Department Store in Tokyo among many more<p><p>In 2018 she has received an Applied Arts Award and the 3x3 Magazine honorary mention for her work for Google created wi Anyways Creative<p><p> <p><p>Zhai Wensi<p><p> Illustrator/Member of the Graphic Design Association<p><p>Graduated from center academy of fine arts and also graduated from Aalto University with MA in Environmental Art<p><p>Her work won the 'Best of the Best (Commercial)' award in Hiii Illustration 2016 international competition<p><p>In recent years, she focuses on focus on illustration practice<p><p> <p><p>Gao Jing<p><p> A professional member of the Shenzhen Illustration Association<p><p>Specializes in illustration and picture book, her picture book won the National Bingxin Award<p><p>The picture book &lt;Howl's Moving Castle&gt; was selected for Hiii illustration international competition<p><p> Her work was also selected for Hundreds of Excellent Publications Recommended to Teenagers by the SARFT<p><p> <p><p>Zhu Gege<p><p>Artist/Designer<p><p>Graduated from the China Academy of Art and École nationale supérieure d'art de Dijon with MA in plastic arts<p><p>Since 2010, she works as a performer and focuses on the relationship between body and public space<p><p>From 2017, she starts to practice in new ways and materials- ink and digital. Her work was inspired by everyday life and surrounding<p><p> <p><p>Han Qin<p><p>Artist and Curator<p><p>The curator of the Shanghai 99 art museum<p><p>MA degree from École Nationale supérieure des beaux-arts de Paris<p><p>Her personal works have been exhibited in many galleries all over Europe<p><p> <p><p>Worth to mention:<p><p>Counselor Gao Yuhang of the Ministry of Education of the Chinese Embassy in Finland attended the exhibition<p>", "time": "2018-11-30T15:52:23+02:00", "type": "culture"}
{"title": "The 31st Helsinki International Film Festival wrapped up on Sunday", "url": "http://www.helsinkitimes.fi/culture/15857-the-31st-helsinki-international-film-festival-wrapped-up-on-sunday.html", "review": "", "content": "<p> <p><p>THE 31st HELSINKI INTERNATIONAL FILM FESTIVAL, also referred to as Rakkautta &amp; Anarkiaa (Love &amp; Anarchy), came to a close on Sunday, having drawn in record breaking numbers. This year’s film festival attracted more than 60,000 visitors and featured almost 500 screenings. The numbers reveal how the festival’s popularity continues to grow, this year one out of every four screenings was sold out. <p><p>The festival brings together films and filmmakers from all over the world. This year’s honorary guest was none other than Spike Lee, who came to present his latest film, BlacKkKlansman. In addition to the screening of his Cannes Grand Prix-winning film, his 1989 film Do the Right Thing was presented in combination with a Masterclass on September 22 at the newly renovated Korjaamo Kino Bio Rex theatre. <p><p>Other guests included Australian director Stephan Elliott, known for his film Priscilla: Queen of the Desert, who returned to HIFF to present his latest film Swinging Safari, a satire of Australian suburbia set in the 1970s. Actor Shia La Beouf also featured on this year’s list of guests presenting #TakeMeAnywhere, a documentary produced by art collective La Beouf, Rönkkö and Turner. The film documents the trio’s digital road trip where strangers were invited to pick up the artists from coordinates posted on the project’s website and take them to a location of their choosing. German-French-Iranian director Emily Atef also visited the festival to present her film, 3 Days in Quiberon, a depiction of actress Romy Scheider’s final interview. <p><p>Local talent was also celebrated during the festival. Finnish films that were featured at the festival included Selma Vilhunen’s Stupid Young Heart (2018), Anna Eriksson’s M (2018), and Teemu Nikki’s Euthanizer (2017). Finnish actress, Laura Birn, won this year’s Nordic Flair Award, an award granted to those who have helped draw international attention to Nordic talent. <p><p>The festival also features an industry sidebar, Finnish Film Affair, which presents Finnish films to international buyers and journalists. This year’s winner of the Best Pitch Award, given to works in progress, was Tuffi Films’ One-Off Incident, a project directed by 15 female writers and directors. <p><p>To those who missed out on the festival – you still have a chance to catch some of the films featured. Yle will feature a selection of the festival’s films on its channels. In addition to this, the Love &amp; Anarchy Tour will present the festival’s most popular films to selected locations including Turku, Kuopio, Joensuu and Vaasa. <p><p> <p><p>MARIA TIMKO<p><p>Source: HIFF <p><p>Photo: Mari Mur/Rakkautta &amp; Anarkiaa<p>", "time": "2018-10-02T12:09:57+03:00", "type": "culture"}
{"title": "Three Titles Dominate Finland’s Mobile Gaming Scene", "url": "http://www.helsinkitimes.fi/culture/15795-three-titles-dominate-finland-s-mobile-gaming-scene.html", "review": "", "content": "<p><p><p>Mobile gaming has taken over the whole world. Almost everyone has a mobile phone, and almost everyone with a mobile phone has downloaded at least one or two games or bookmarked a mobile gaming site. It’s completely understandable, while these games lack the depth of traditional console games, they provide quick doses of entertainment which fill the time, challenge the user, and even have the chance of winning the player money.<p><p>In Finland, a different game rules the charts on Apple devices, Android devices, and mobile websites, with each bringing mobile gamers a different way to enjoy themselves. These are those games that are currently ruling the smallest screens in Finland.<p><p> <p><p>Apple App Store: Happy Glass<p><p>A simple little puzzle game, Happy Glass has shot to the top of the App Store game charts in Finland. Players simply scribble lines in order to get the liquid into the sad cup – which is sad because it’s empty. The puzzles get more difficult as the player progresses, with different obstacles and tools becoming available through the levels. However, all the player needs is to touch and drag to draw the lines that lead the liquid.<p><p>Its creators, Game5mobile, have released many popular games to mobile devices, such as Wheels Escape and Tanky Tank, but Happy Glass’ sustained popularity has made it their most successful game to date. Having overtaken Hello Stars at the top of the iOS gaming charts in Finland, per similarweb.com, there’s no doubt that players are enjoying making the little cup happy time and again.<p><p> <p><p>Online Mobile Casino: Medusa II<p><p>Medusa II is the follow up to the much-loved online slot game Medusa, both of which have collected a huge fan base in Finland. To win big in this game, simply collect the snakes, stone soldiers, and arrow quiver along a payline. Medusa plays as the wild and is stacked on the reels, while three or more scatters pay wherever they land. The game also boasts random bonuses.<p><p>Created by NextGen Gaming for many online casinos at suomicasinot.net, Medusa II has quickly become the most-played game at online casinos in Finland. The hype of it being a sequel will have helped, but the sustained popularity is a credit to the gameplay, Greek mythology theme, and stunning art. Another way in which it has become popular across Finland is that online casinos that boast the game, like Lucky Me Slots, are available on Android and iOS devices.<p><p><p><p>Android Play Store: Tomb of the Mask<p><p>Much like many of the great classic games of yesteryear, Tomb of the Mask is all about collecting coins in a troublesome environment. This much-loved game app takes players and their little yellow character through an infinite vertical labyrinth, as shown by appadvice.com, in which they collect coins while trying to avoid the ever-rising force that’s closing down on the character. The game requires quick flick reflexes to keep ahead of the force while working through the labyrinth.<p><p>Founded in 2016, Playgendary has made a name for itself through creating skilful and enjoyable games, like the virtual reality game Samurai Chef, Kick the Buddy, and Bowmasters. In Finland’s Android Play Store, Tomb of the Mask is the number one game and has been for some time. Given the infinite labyrinth and progressively increasing difficulty, the game has become a challenge for mobile gamers; one that players can use to gloat about their high scores.<p><p>Despite the platform being mobile for all of these games, three different titles have been able to work their way to the very top of the App Store, online casinos, and Play Store. Happy Glass, Tomb of the Mask, and Medusa II stand as the most popular mobile games in Finland right now. <p><p>Image Source: Snappzilla, via Twitter<p>", "time": "2018-09-04T12:06:33+03:00", "type": "culture"}
{"title": "Q & A with Martin Solveig", "url": "http://www.helsinkitimes.fi/culture/15773-q-a-with-martin-solveig.html", "review": "", "content": "<p><p><p>Martin Solveig (age 41) is a French DJ who started his career in 2002. He started by playing in nightclubs in Paris to now having his own radio show, a studio in L.A and playing almost two shows a day. We got the chance to interview him at the WKND-festival in Helsinki 19.8.2018. Here are the excerpts:<p><p>Q: You have been in Finland before, how do you like it here?<p><p>A: I landed an hour ago so I'm happy to be here, but I don't know much about it. Right now, I'm playing almost two shows a day, so it's a little bit you know, in and out. But in general the vibe in Finland it's super, it's great. My impression is that it's chill and quite beautiful, the weather is great right now.<p><p>Q: What has changed since you started making music in 2002, both for you and the industry?<p><p>A: Everything. I get this question a lot but I don't know how to sum up in a one minute answer, twenty years of everything changing. When I started making music there were no social networks. We were going to shops and buying vinyl that we were going to eventually play. I was making music with very slow computers. And everything was completely different.<p><p> <p><p>Q: You have released one single called All Stars with the Finnish singer Alma. Can you tell us about that co-operation?<p><p>A: Yes. I'm glad that you talk about that. It was super cool encounter. During the winter I work in a studio, most often in Los Angeles. And what I do is I basically work on music, composition and when there is a singer around, or when there is an opportunity we try to make it happen witch is exactly what happened with Alma. We actually met in London not in Los Angeles. And we clicked pretty much instantly because on top of being a great singer, she's also a great character, she has a strong personality, she's super fun. I think we share, I'd say a sense of humour, of irony, in the way we like to present ourselves. And so actually the connection was instant and I'm so glad that the song became a big one.<p><p>Q: Can you tell us about your new single: My Love, and your summers tour, and maybe any possible future collaborations?<p><p>A: So I answer directly to the last question, cause that's three questions, last question no I cannot talk about future collaborations. My Love is the opener of a new series of songs. Most of them will be collaborations. Both with new singers who I have not worked with before and with producers as well. I'm clearly exploring a bit more. I'm going a little bit more left and right and everywhere. And will release more music than what I used to do in the last three four years where I was sort of super focused I a sort of zone that I worked on precisely around Intoxicated, +1 up to All Stars. That was kind of a chapter of my musical life. The new chapter is gonna be more open, it's going to also probably be the announcement of a live tour, during witch I won’t be, at least I won't be only DJ ing and probably I will be doing more this, witch is going to be a new way of performing for me as well.<p><p>Q: I guess you are talking about the 2019 live tour starting at L´Olympia in Paris?<p><p>A: That’s right. I'm opening this new cycle of live shows. I don't wanna talk too much about it in terms of what it's gonna be like cause I want people too see for themselves and to make their own opinion, but for me the only starting point of this is wanting to experiment on the way we can perform our shows in the future and also just to change and to evolve. I don't like things to become routine. As an echo to your first question, the line that I followed during my twenty years of career is a line of change and evolution. That’s what keeps me excited and thats what I wanna keep doing.<p><p> <p><p>Tara Kouros<p><p>Helsinki Times<p><p>Image: Listen Up<p>", "time": "2018-08-26T15:50:45+03:00", "type": "culture"}
{"title": "Helsinki Fashion Week 2018", "url": "http://www.helsinkitimes.fi/culture/15763-helsinki-fashion-week-2018.html", "review": "", "content": "<p><p><p>The eco village with organic vegan food, a water bottle refilling spot, mobile sustainable home on show, eco-boat by the see, and a water circulating shower and sauna underlined the ecological approach of the festival.<p><p>There were 4 to 5 shows every day. Seminars, presentations and lectures were scheduled between the shows. All the designers had a 100% sustainable collection and brand. Each show was a whole universe of its own, and had its own vibe which was created by the collection and the accompanying music. The designers had got inspiration from different cultures and countries for their collections.<p><p>The week was opened by shows by Estonian Designer Liisa Soolepp and Saneras from Italy.<p><p>On The second day, Hoh Pabissi from UK had a very beautiful and unique show of her evening dress collection. Most of the pieces had a lot of golden details and colours like sand, dark blue and turquoise. All of the pieces were hand crafted in London.<p><p>Next there was MEM from Finland with the amazing collection named ENDURE. Most of the pieces had the colour black, and either red or blue. The last piece of the series - a long and big dress with tons of colours such as red, yellow, green, blue and pink broke ties with the rest of the collection in an elegant way. <p><p>Last show of the second day was by AITO Studios, a street-style focused brand from Finland witch gathered a lot of crowd. The pieces dominated by colours black, white and pink, and spiced by a cool vibe. A perfect finish for the day.<p><p>On day three the Colombian-American designer Nathalia Jmag, presented a stunning collection called Maria. Summery, denim pieces in white, blue, yellow and red, with occasional stripes were inspired by the Colombian and American flags. <p><p>One of the interesting Finnish designers in the programme was Mai Niemi, with a focus on Nordic nature and timeless contemporary design. Mai Niemi’s ethically crafted and locally produced designs and organic accessories were a perfect match for the nordic setup and the theme of the week.<p><p>Hungarian Kata Szegedi played with “Hungarian sensibilities and global motifs”. Szegedi used custom fabrics and tailoring to provide cosmopolitans with clothing fit for self assured dressers proud of their individual image. Berlin based FUENF, on the other hand focused on street-style, but elegant design, bringing digital culture and fashion closer.<p><p>Seminars and exhibitions related to sustainability and innovation, Future-focused technology and circular lifestyle, and an startup panel were intelligent additions to the runway rounds.<p><p>Can a regular consumer impact the future of fashion, making it more sustainable? We interviewed some of the designers and team members to find out. Here are some of their tips from different designers in the programme: “Next time you buy something, think about whats essential for you, find out about the conditions of the people who make the clothes. Buy more consciously, buy less, recycle, wear vintage, think about what you’re buying and why you’re buying it. Creating a better future is about everyday choices, so make them wisely.”<p><p>These may sound strange coming form designers who’s interest is expected to be in selling more. For that reason, this change in mind set is a welcome sign of social conciseness which doesn’t start or end with fashion.<p><p> <p><p>Text and images<p><p>Tara Kouros<p>", "time": "2018-08-21T13:20:44+03:00", "type": "culture"}
{"title": "No summer without The Weekend!", "url": "http://www.helsinkitimes.fi/culture/15705-no-summer-without-the-weekend.html", "review": "", "content": "<p><p><p>The Weekend festival is just around the corner. The main beach of the city of Helsinki, Hietaniemenranta will be transformed into a mega festival area from 17th to 19th of August. These years lineup includes David Guetta, Axwell &amp; Ingrosso, Hardwell, Lil Yachty, Macklemore, Martin Garrix, and The Prodigy<p><p>The electronic music festival which started in 2012 has grown in size and character to a mega event and expanded to Estonia and Sweden. the festival has had more than 40 000 attendants each year and the popularity has been growing. This year, with a new venue in the Hietaniemenranta beach, the capacity of the festival will grow and the attendance level seems promising with 90% of the ticket types having been sold out. <p><p>Hitaniemenranta is a beautiful surrounding which provides a mesmerising background in the sunset for the festivals live music and partying audience. The venue is also very easy to reach by foot from the centre or using public transport or bicycles.<p><p>The Weekend usually offers performances in several stages simultaneously. Last year the festival area offered plenty of other amusements, such as bungee jumping and a Ferris Wheel from which you could see the entire area and beyond. Also, several food and drink outlets are usually available to the audience.<p><p>Among this year's artists, David Guetta is probably the most known to the general public with less knowledge of electronic music. The French music producer and DJ. has produced several hits with well-known artists such as Nicki Minaj, Kelly Rowland, Will I Am, Flo Rida, and Zara Larsson. Some of his latest hits were Flames and Titanium featuring Sia and Who’s That Chick with Rihanna.<p><p>Another group from this years line up is The Prodigy. The band which first emerged in underground rave scenes in the early 90s have grown to world-wide popularity and have been branded as “The Godfathers of Rave” by the media and audiences. The group has won numerous music awards during their career and have sold more that 30 million records worldwide.<p><p>Previous festivals have had impressive lineups including world-famous artists such as Avicii , David Guetta, Calvin Harris, Armin van Buuren, deadmau5, Hardwell, Martin Garrix, Tiësto, Steve Aoki, Axwell &amp; Ingrosso, The Marshmallows, The Chainsmokers and Skrillex<p><p>The Weekend Festival<p><p>Dates: Friday 17th to Sunday 19th Aug. 2018<p><p>Location: Hietaniemenranta, Helsinki<p><p>Age limit: 15 + with restricted zones for 18+<p><p>Ticket types:<p><p>Regular tickets: <p><p>1 Day ticket (Friday / Saturday / Sunday) AVAILABLE 99€ 2 Day ticket (Firiday &amp; Saturday or Saturday &amp; Sunday) AVAILABLE 145€ 3 Day ticket (Festival pass for all days) AVAILABLE 165€<p><p>Priority tickets: <p><p>1 Day priority ticket (Friday / Saturday / Sunday) SOLD OUT 2 Day priority ticket Firiday &amp; Saturday or Saturday &amp; Sunday) SOLD OUT 3 Day priority ticket (Priority access for all days) SOLD OUT<p><p>VIP tickets: <p><p>1 Day VIP ticket (Friday / Saturday / Sunday) SOLD OUT 2 Day VIP ticket Firiday &amp; Saturday or Saturday &amp; Sunday) SOLD OUT 3 Day VIP ticket (Priority access for all days) SOLD OUT<p><p>Extras: <p><p>VIP Table<p><p>VIP Booth <p><p>After parties: <p><p>The Circus Afterparty<p><p>Club Capital Afterparty<p><p>Contact: Hietaniemenranta Hiekkarannantie 11 00100 Helsinki Email: info[at]wknd.fi<p><p>The Weekend Festival has been nominated for the best festival in 2013 and 2016 in the Music and Media Industry Awards. Yle X radio, favourite among young listeners, organises a poll about summer festivals every year, in which The Weekend Festival has been selected by listeners as the best festival for several consecutive years. The festival has also been nominated for the best midd size festival by the European Festival Awards several years.<p><p>The festival has a “Cashless” wristband, where you can load money beforehand to use in the festival area so no need to carry cash or wait in lines.<p><p>Your ticket will be added to the wristband as well<p><p>Via the Cashless system, you will be able to pay all your festival services with your wristband. You can manage the features of your wristband and the money that was added to your wristband via your MyWKND account.<p><p>All purchases made at the Weekend Festival will be made via the Cashless system and all the festival wristbands will be connected to the Cashless system. All ticket types are exchanged for a Cashless wristband, which will be used to pay for all purchases in the festival area. Unused funds will be refunded after the event.<p><p>There is also a flexible payment plan available for those over 20. With “Jousto Payment Plan” you can pay your ticket in after 90 days without any extra charges. After that, you will have an option to pay for your ticket in installments.<p><p>To get your ticket before its all sold out, go to www.wknd.fi<p><p>Ticket prices will rise on 1.8.2018.<p>", "time": "2018-07-25T14:53:42+03:00", "type": "culture"}
{"title": "Metal under a northern sky", "url": "http://www.helsinkitimes.fi/culture/15659-metal-under-a-northern-sky.html", "review": "", "content": "<p>THE FORECAST for the weekend of the 21st Tuska Open Air Metal Festival was not looking too good the week before. Torrential rains were promised for Friday and Saturday with temperatures around 10 degrees Celsius - Finnish summer at its best. Metal heads from all around the world were praying to the weather gods and stocking up on raincoats, rubber boots and gloves in preparation for yet another wet festival. But the gods seemed to listen: While Friday started off cloudy and temperatures did not reach proper summer heights, it stayed dry for the whole weekend with some blue skies and sun on Saturday and Sunday – summer festival atmosphere was a go!<p><p>During these three days, overall 34 000 metal heads found their way to Suvilahti with Saturday being the most popular day with 13 000 visitors. As every year, the area improved ever so slightly from the varied food selection to carts not only delivering beer but also wine and bubbly directly to you, to more seating areas and better located beer areas. The whole festival was decorated with various art installation and Belzebubs comics so there was always something new to discover during the weekend. Not only the area, also the festival goers were once again dressed up and decorated to the max and if one didn’t have time for that at home, a corpse paint and flower crown (or flower beard adornment) station made sure everyone could get their festival style going. <p><p>On Friday, the crowd was already going strong (just like the wind that day) for Tribulation from Sweden who played on the Helsinki Stage as the second band on there, before Turmion Kätilöt on the main stage made sure to deliver some more up-beat tunes that got the audience dancing. The evening continued with powerful shows by Mantar and Moonsorrow as well as Arch Enemy and Meshuggah who pumped the festival goes up for the grand finale: Body Count ft. Ice-T took the night away with a performance that blew the festival crowd away and will stay in many minds for a long time to come.<p><p>The dancing continued on Saturday with The 69 Eyes and Carpenter Brut, and it was noticeable that the festival was much more crowded that day. Black metal heavy weights Emperor who played on the main stage next certainly had something to do with that as well. Seeing them on a sunny day with blue skies was quite a different experience to the last time they played at Tuska when it was cold, grey and rainy aka much more black metal but the band was in a great mood and the audience of course as well – and who said you cannot enjoy some black metal with a huge smile on your sunlit face?! The mood got more gloomy and melancholic with Hallatar and tears could be seen in a many corner of an eye, before German Thrash machine Kreator made sure to up the ante again. At The Gates and Gojira caped off the official part of the day, but the party and the dancing continued until the early morning hours at the after parties.<p><p>Sunday presented itself as the warmest and sunniest day so far which helped the possibly slightly tired festival goers wake up for the last festival day. Tuska regulars Timo Rautiainen &amp; Trio Niskalaukaus took many in the audience on a trip down memory lane with their classics before Emperor front man Ihsahn took the Helsinki Stage with his solo project, the tent above the stage providing some welcome wind protection. From Ihsahn’s atmospheric and groove filled show it was onward to some Sunday dancing at Kattilahalli with Grave Pleasures at Inferno Stage while Europe played on the main stage and heralded the (almost) final (festival) countdown. The evening ended with Clutch and Parkway Drive, who put on an intense, pyro heavy show including a rotating drum kit to end this year’s Tuska Festival in style.<p><p>TEXT: NINA RATAVAARA<p><p>PHOTOGRAPHER: JESSE KÄMÄRÄINEN<p>", "time": "2018-07-04T18:58:41+03:00", "type": "culture"}
{"title": "Here goes The Weekend!", "url": "http://www.helsinkitimes.fi/culture/15647-here-goes-the-weekend.html", "review": "", "content": "<p><p><p>Weekend festival is a music festival witch is held every year in Finland, Sweden and Estonia. The music genre is mainly EDM and dance music but other genres for example pop, rap and R&amp;B are also presented. <p><p>This year it was held in Kyläsaari / Kalasatama, in Helsinki on Aug 4, - 5. The theme of the year was “Neon Dreams2. Previous themes have been “Year of the Tiger” (2016), “Super Digital” (2015) and “Electro Disco” (2014).<p><p>The artists performing there were mainly from the US, the UK and Finland, such as The chainsmokers, Marshmello, Rae Shemmurd, Alan Walker, Mikael Gabriel and Teflon Brothers, to name a few.<p><p>The festival area had five stages: Loop Stage, WKND Stage, Future Stage, The Dome K18 and Digital Stage. The Loop Stage was the biggest stage and was right in front of the entrance. The other stages were smaller and located in the outer parts of the festival area. The main artists mostly performed on the Loop Stage. Since the theme was Neon Dreams, the visual effects were full of neon colours and of course included some fireworks.<p><p>Friday started off with lots of glittery and excited people waiting in a long line. The whole area was basically a big pond because of the raining earlier, but that didn’t kill the vibe. Staff had done a lot of work to pump out the water and clean the area. On the Loop Stage Alan Walker opened the festival, and was followed by Don Diablo and Armin van Buuren. The duo performing for the first time in Finland gathered a lot of crowd. Rae Sremmurd had released their most popular song Black Beatles just last year and had reached a lot of listeners around the world. The masked DJ Marshmello performed as the second-last artist (of the Loop Stage) of the night. And last but definitely not least, another duo again for the first time in Finland, The Chainsmokers. In the middle of the show it started raining, but it didn’t stop the cheerful audience, some of which were having the time of their lives. In fact it just gave everyone more energy; jus cooling the jumping and dancing masses down.<p><p>As for the other stages on Friday, The Dome had most artists performing, and the WKND Stage had least. WKND Stage had for example: Inna and Teflon Brothers. The Future Stage had among others Dillon Francis, GTA and Alok. The Dome had more finnish artists like: Alex Nieminen. The Digital Stages artists included Wasted Penguins and Code Black.<p><p>The first artist of Saturday on the main stage was Reino Nordin, followed by Tungevaag &amp; Raaban. These artists got everyone excited for the second day, making the crowd forget the muscle pain from the previous day’s jumping. Clean Bandit - also for the first time in Finland -rocked the stage next. Pendulum performed next, with a whole different vibe. And another masked DJ: Deadmau5 brought an energetic end to the line up. <p><p>During Saturday the other stages were filled with artists like the iconic Icona Pop, the finnish rap-artist Mikael Gabriel and lots of other artists like Cheat Codes, Kungs and Mike Perry in addition to some other Finnish artists.<p><p>As usual, the festival area provided lots of food spots for getting some fuel for the day. For the adrenaline junkies there was the possibility of bungee jumping from a crane, which many took either solo or with a friend. For others who no appetite for a jump but a will to fly, a ferris wheel offered a great birds eye view to the Loop Stage.<p><p>To see all the excitement and fun, take a look at the Weekend Festival 2017 aftermovie.<p><p>The American DJ and production duo The Chainsmokers were in Finland for the first time. The members are Alex Pall 32 and Andrew Taggart 28. Alex is the DJ and Andrew is the producer, writer and vocalist of The Chainsmokers. They met in New York in 2012 when Alex was already a part of the group, Andrew was informed that there is a spot open in the group since an old member named Rhett Bixler had left. Alex had grown up DJing and Andrew had taken an interest in it too.They started off making remixes of indie bands, and later moved to making collaborations and original songs. Their breakthrough was the song “#Selfie” witch reached the Dance/Electronic Songs chart in 2014.<p><p>Mikael Gabriel is a Finnish rap-artist born Feb 25, 1990. He started his career in 2007 as an Idols Finland participant, but did not make it to the show. After that he decided to become a rap-artist and singed a deal with Helsinki Freedom Records in 2008. A lot happened since, and in 2017 he had his first tour and was a judge in X-factor Finland together with Michael Monroe, Saara Aalto and Suvi Teräsniska. His most famous songs are for example “Kipua”, “Timanttei”, “Älä herätä mua unesta” and “Viimeisen kerran”.<p><p> Weekend Festival will change its venue to the Hietalahti beach in 2018. The festival will be held on 17 - 19 August 2018.<p><p>Text and Image<p><p>Tara Kouros<p><p>HT<p>", "time": "2018-07-01T00:18:58+03:00", "type": "culture"}
{"title": "Is the Nordic-Nurture Approach Making Finland a World-Leader in Game Development?", "url": "http://www.helsinkitimes.fi/culture/15631-is-the-nordic-nurture-approach-making-finland-a-world-leader-in-game-development.html", "review": "", "content": "<p>If there’s one thing that unites Nordic countries, it’s a spirit of political, cultural and social friendliness. We're the world’s good guys. Whether it’s the environment or financial regulation, an ethos seems to persist that values people rather than power, connection rather than competition, and fun rather than frenetic and brain-frying work culture.<p><p>This kind of approach endears the Nordic countries to the world at large, and is manifest in international phenomena like hygge, which can be roughly summarised as the national export of the idea of having a really nice time. There are very few nations or peoples from whom such an export would seem anything other than bizarre.<p><p>But, as critics often rush to argue, while such a people-centred approach is surely commendable, isn’t it, in some essential way, just a little half-baked and, when you get right down to it... silly? You won’t make the trains run on time by giving all the drivers chocolate watches could be said to describe the feeling of the other side: Those who favour a more let-the-best-man-win approach, an approach that would be critiqued for its gendered language by any good Nordic citizen.<p><p>And yet the vindication of this kind of collaborative philosophy can often be found in the places you’d least expect. Video game design is a highly technical and profitable industry, and though it is by definition creative, most would agree that the deep waters of the human heart are generally left to film and literature. That acknowledged, one might feel safe in assuming that this is one industry where the hygge-ian must lose out to the traditionalist. But that’s not the case.<p><p>Sweden is one of the world’s leading countries in terms of game design and development and is home to studios such as King, Starbreeze and Paradox Interactive. If these names don’t ring a bell - and there may be many for whom they do not - then you’re far less likely to have escaped encountering some of the world-renowned titles these studios have produced: that’s Minecraft, Battlefield, and even games in the Angry Birds series, to name but a few.<p><p>But even more impressive and more salient to the question at hand, is the booming success of the gaming industry in Finland. Finish video game companies are hitting the stock market like a Tekken fighter at the crescendo of a brutal combo. In recent years, they’ve put out everything from blockbuster titles like Max Payne, to the latest and greatest in online casino gaming, which includes themed slots following Nordic mythology, blackjack, roulette and many other titles. And the thing is, this is all due to an industry that takes a decidedly Nordic approach.<p><p><p><p>Enter the game jam, which is just what it sounds like: the free-flowing, artistic collaboration of artists freed from the usual corporate impositions. Jammers are game developers of all walks of life who come together to create games with like-minded souls in a short space of time, and the proliferation of this tech-jazz movement has been largely credited with the explosion of the industry within Finland. They’re jamming, and the sales revenue of the industry as a whole within the nation of Finland likes jamming too. <p><p> <p><p>HT<p><p>Image Source: Pixabay.com<p>", "time": "2018-06-22T15:12:20+03:00", "type": "culture"}
{"title": "Pedal to the metal for Tuska Open Air Metal Festival 2018", "url": "http://www.helsinkitimes.fi/culture/15609-pedal-to-the-metal-for-tuska-open-air-metal-festival-2018.html", "review": "", "content": "<p>SCANDINAVIA’S LARGEST METAL FESTIVAL shows no sign of slowing down with its 21st edition this year. After the 20 year celebration last summer, the metal party continues this year with a jam-packed and very diverse line-up. From Friday, June 29 to Sunday, July 1 Suvilahti will once again turn into a sea of (mostly) black clad metal heads that will be rocking out to the tunes of Finnish favorites and international heavy hitters. <p><p>During the three days, 46 bands will perform on the three stages: Radio Rock Stage (main stage), Helsinki Stage (2nd outdoor stage) and Inferno Stage (inside stage in Kattilahalli). Death metallers Baest from Denmark will kick off the 21st Tuska Open Air Metal Festival on Friday, followed by the mighty Crowbar. And as legendary Finnish industrial metal band Turmion Kätilöt came back from its hiatus, they of course have to perform at Tuska. Another Finnish favorite on Friday for sure will be Moonsorrow, while Arch Enemy, Mantar and Meshuggah bring international metal power to the stage. Body Count ft. Ice T will end the first day with a blast, playing until midnight.<p><p>Saturday kicks off with a slew of Finnish bands on all stages from Tyrantti, Six Inch, Crimfall, Foreseen, Beast In Black, and Mokoma to Helsinki’s own vampires The 69 Eyes. Those who haven’t danced enough to Gothic Girl can continue the dance party with Carpenter Brut before the vibe will get a lot blacker and bleaker with Norwegian black metal masters Emperor and Hallatar, the new doom supergroup by Juho Raivio (Swallow The Sun), Tomi Joutsen (Amorphis, Sinishtra), and drummer Gas Lipstick (Dropzone, ex-HIM), who will weave a web of beautiful melancholy over Suvilahti. Kreator and Gojira will close the day on the main stage with some powerful blast beats.<p><p>On Sunday, Ishahn (Emperor) returns to the stage solo, and bands like Blind Channel, Timo Rautiainen &amp; Trio Niskalaukaus, Europe and Grave Pleasures will take the audience on a wild ride between genres before Parkway Drive will end this year’s Tuska Festival. For those festival goers that want to add a bit of extra comfort to their festival experience, Tuska for the first time presents the VIP grandstand that grants a direct view of the main stage and pampers the owners of the 25 exclusive seats with its own restaurant. Festival goers can upgrade their tickets to include the grandstand (50€ for early evening concerts, 100€ for headline concerts).<p><p>The musical program is accompanied by the Solmusali discussion/alternative program during all three days where festival goers can listen to interesting panels on topics like darkness and nostalgia in metal and watch short films by Night Vision. The many bars, the ever-growing food court, the Alepa supermarket container and the indoor Black Dining à la carte restaurant make sure no one goes hungry or thirsty while the sauna tent offers a very Finnish way to refresh oneself during a long festival day.<p><p>And if all that still is not enough for you, there is the Tuska Heatseeker pre-party on Thursday, June 28 at Tavastia where Medeia and I Revolt will get the festival mood going and the festival days themselves are followed by the official Tuska afterparties in the city center. Bands like Bloodred Hourglass and Fear of Domination play at Virgin Oil Co. and the party program with DJ’s at On The Rocks will make sure the music never stops until late on Sunday where the last after party continues with Lost Society.The ticket options this year are as follows: 259 € for the three-day Turbo-VIP ticket, 129€ for a regular three-day ticket and 109€ respectively 79€ for a two or one day ticket. All information and updates can be found on http://www.tuska-festival.fi/ as well as on the Tuska app (available for iOS and Android). Three and two-day tickets can be exchanged for wristbands beforehand at Feel Vegas Helsinki (Mannerheimintie 3, 00100 Helsinki – only for festival goers over 18) or at Tiketti Galleria (Urho Kekkosen katu 4-6, 00100 Helsinki – for festival goers of all ages) from 12 noon to 6 p.m. from June 26 to 29.<p><p> <p>", "time": "2018-06-13T15:31:10+03:00", "type": "culture"}
{"title": "On the road to Mänttä Art Festival with curator Veikko Halmetoja", "url": "http://www.helsinkitimes.fi/culture/15449-on-the-road-to-maenttae-art-festival-with-curator-veikko-halmetoja.html", "review": "", "content": "<p> <p><p>Mänttä Art Festival has been organized by its founding association 'Mänttä Art Lovers' since 1993, first as a biennial and, since 1999, annually. The event was recently awarded the prestigious Finland Prize, recognizing its long-standing work in the field of Finnish contemporary art. The title of the festival held this summer will be Roadmap. The festival, celebrating its 25th anniversary this year, will open to the public on June 17 and close at the end of August. <p><p>Helsinki Times spoke to Veikko Halmetoja, the curator and artistic director of the 2018 exhibition. Veikko, a gallery owner, art critic, and curator is an all-around expert on visual arts, not least because he spent his childhood and youth in Mänttä. He first became involved with the Art Festival as an 18-year-old intern in 1995. Veikko has seen every Mänttä Art Festival exhibition from the very first edition of 1993, most of them numerous times. <p><p>When asked about how the exhibition has changed throughout the years, Veikko turns the conversation to the professionalization of the exhibition’s preparation process and the exhibition’s venue. Since 2002, the main exhibition venue has been Pekilo, a former animal feed refinery next to Mänttä's tallest chimney-stack. Veikko articulates that Pekilo has been extensively remodeled and adds that this year there are new gallery spaces. <p><p>Despite the aesthetic changes, the principal idea has stayed the same. Finnish contemporary art remains cemented as the heart of the exhibition. This year 56 artists will lead the exhibition visitors on a winding road to map the world. Veikko traveled around Finland meeting with artists of various ages and backgrounds. A wide range of artists have been selected, some of them still unknown by the public at large. <p><p>”I have discovered interesting talents while teaching at art schools. Of course, I have also included several established artists and some very well-known names.” Notably, the exhibition will feature pieces by Tellervo Kalleinen and Oliver Kochta-Kalleinen and Antti Laitinen. <p><p>The festival will display a video piece by Antti Laitinen. Laitinen represented Finland at the 2013 Venice Biennale. (Photo Antti Laitinen: Marionette, 2017, from a still video)<p><p>Veikko suggests that viewers and connoisseurs devote some time to emerging artists such as Mikko and Melina Paakkonen, Einari Hyvärinen and Aura Kotkavuori. He sees that the spirit of the exhibition is largely connected to the fact that the viewer is able to view art that is not yet familiar to the public. <p><p>This year viewers can expect to find a strong theme. ”Roadmap delves into people's need to understand and control the reality that surrounds us. It offers commentary on boundaries and the exercise of power”, Veikko explains. <p><p> <p><p>Veikko compares the chosen artists to modern day explorers who explore the world on behalf of the rest of us. ”I have also invited artists who I find are seriously investing in the kind of art that helps us understand and discern the world a little better. They are the true mappers and explorers of today”, Veikko notes. ”I am building an exhibition where you are allowed to get comfortable…The exhibition also deals with charting the worlds inside the mind, different worldviews and superpower politics. Even though some of the artworks present a critical point of view into difficult topics, they won't avert laughter.” <p><p> <p><p> <p><p>In other words, or as Veikko eloquently puts it, it’s about trying to find beauty in the world. He pictures the viewer walking through the exhibition and finding a sense of hope. The exhibition also contains abstract paintings that Veikko hopes will allow the viewer to experience meditative moments. He recommends to reserve a few hours to fully enjoy the experience. <p><p> ”I promise the audience an eventful visit with food for thought, beauty, ugliness and artworks that will leave an imprint in their memories. I myself can still recall several artworks from the first Mänttä Art Festival of 1993, and it would be an honour for me if 25 years from now, someone would say the same about the exhibition of 2018”, Veikko concludes.<p><p>More info can be found here.<p><p>XXII Mänttä Art Festival<p><p>18.6. - 31.8.2018<p><p>Exhibition Centre Pekilo Tehtaankatu 21 FI-35800, Mänttä Finland<p><p>Jagoda SeKular HT<p><p>Images: Mänttä Art Festival<p><p> <p>", "time": "2018-04-14T23:29:00+03:00", "type": "culture"}
{"title": "Come to Kotka", "url": "http://www.helsinkitimes.fi/culture/15266-come-to-kotka.html", "review": "", "content": "<p>GLASSWORKS AND FINNISH TOURISM POSTERS ON DISPLAY IN MARITIME CENTER VELLAMO<p><p>Maritime Center Vellamo’s two museums are hosting historical Finnish exhibitions relating to glass design and tourism in Finnish history. <p><p>The Glass for Everyone exhibition opened on May 19, 2017, and portrays the history and relevance of the Karhula glassworks from 1889 until 2009.<p><p>Known for both artistic and practical glass production, Karhula glass factory had an impact on the day-to-day lives of Finns before becoming known internationally in the 1930s. The physical design of the display was arranged by Partanen &amp; Lamusuo Oy and contains mostly authentic artefacts from the Milan Triennial (1933, 1936), and the World Fairs (Barcelona 1929, Paris 1937, New York 1939), as well as the original Finlandia vodka bottle design by Tapio Wirkkala. <p><p>“The exhibition is based on our own glass collection, which belonged to Karhula Glass Museum,” says curator Vesa Alén. Karhula glassworks opened in 1889 and closed in 2009. It was a major employer in the region for many decades and formed a large part of the community’s identity, and thus the exhibition is closely linked to Finnish industrial history. “Karhula glassworks was one of the pioneers of Finnish glass design in the 1930s, so the exhibition has both local and national significance,” Alén continues. <p><p><p><p>Museum-goers also have a new exhibition this month called Come to Finland, which displays a collection of posters from the 1890s to the 1960s that were designed to promote tourism in Finland. Designed by “poster-hunter” Magnus Londén, the exhibition will be an edited version of the same display from the National Museum in Helsinki earlier this spring, says curator Erik Tirkkonen. Around sixty posters are on display, not only showing the language used to draw tourists to Finland but also discussing design, art and how the various modes of transportation have developed. <p><p>“This is a good exhibition to present, especially this year when Finland is celebrating her 100th anniversary,” Tirkkonen says. “The exhibition shows that Finland has always been international and outwardly oriented. Many of the designers are famous artists, architects, etc., but not known for their posters.” <p><p>The Maritime Center Vellamo in Kotka was designed by Ilmari Lahdelma and opened in 2008, and is host to both the Maritime Museum of Finland and Kymenlaakso Museum. Glass for Everyone will be on display in the Kymenlaakso Museum until January 21st, 2021. Come to Finland opened in the Maritime Museum of Finland on December 3, 2017, and closes April 29, 2018. •<p><p> <p><p>For more information about the exhibitions please visit www.merikeskusvellamo.fi <p><p> <p><p>Text by Amy Wiseman / Helsinki Times<p><p>Images: Merikeskus Vellamo<p>", "time": "2018-01-17T11:54:56+02:00", "type": "culture"}
{"title": "WorldCon 75: A glimpse into the convention", "url": "http://www.helsinkitimes.fi/culture/14985-worldcon-75-a-glimpse-into-the-convention.html", "review": "", "content": "<p>When the 75th anniversary of WorldCon was announced, the big question was: “Where will it be held?” There were a few options in mind, but the most popular one - the option promoted by A Song of Ice and Fire author George R.R. Martin - was none other than Helsinki. Be it Martin’s influence or not, the vote indeed went to Helsinki, and so the local convention center, Messukeskus, became host to over 6,100 eager fans of science fiction and fantasy.<p><p>The convention took place from August 9th until August 13th, spanning not only Messukeskus and the surrounding facilities, but the Pasila Library as well. Upon entry, one had the option to register or check-in, allowing for the earlier registrants to skip the queue (and there were a lot of early registrants). The doors opened and the bright and cheerful hours of 09:00 on Wednesday, with the sun shining overhead to welcome visitors from all over the world - an unusual greeting from this lovely country, no?<p><p>Considering WorldCon is a vast and fascinating event, we’d like to walk you around some of the event areas:<p><p> <p><p>The Opening Ceremonies Taking place at the surprisingly late hour of 15:00 on Wednesday, convention-goers had the opportunity to browse Messukeskus and perhaps check out a few panels before the event officially began. The opening ceremonies took place in Room 101a&amp;b, and in spite of being a rather large hall, still had to kick a few attendees out since it was overly full.<p><p><p><p>For those who were able to enter, they were treated to toastmistress Karen Lord reading some translated Finnish poems about the seasons (and midsummer). There was dancing, though it would be a lie to suggest that it was anything beyond an amateur level - the choreography was basic at best and the execution was nothing to write home about. The acapella choir, Savosphere, offered at least a professionally-executed performance, sounding very nice, and the Finnish WorldCon chairman appeared on stage in a sort of troll costume, before introducing the guests of honor: John-Henri Holmberg, Nalo Hopkinson, Johanna Sinisalo, Walter Jon Williams, Ian Stewart (guest of honor: science), Guff winner Donna Maree Hanson, and Taff winner John Purcell. Sadly, Claire Wendling had to cancel due to illness.<p><p>All in all, it was a nice enough introduction to the convention, if a bit lackluster. The chairman in particular expressed his gratitude and pride at having his hometown host this event, and profusely thanked everyone for attending.<p><p>You can watch the opening ceremonies here:<p><p> WorldCon 75 Opening Ceremonies<p><p> <p><p> <p><p>Panels &amp; Events One of the biggest draws to the convention were the panels and events offered by authors, academics, artists, scientists, and more. Held in the larger main-and-lower-level halls, or the smaller upper-level rooms, nearly every guest on the list participated in at least one panel over the course of the weekend. Whether it was an academic discussing tragedy in Scott Lynch’s Gentleman Bastards series, or learning about rules of enchantment from some of the best world-builders, there was truly something for everyone.<p><p><p><p>One problem with these panels, however, was that the rooms were often far too small to host the magnitude of attendees with a desire to participate. The local security guards often had to kick dozens of people out of the room in question, as standing observers were not allowed and the seating was minimal. Big names like Elizabeth Bear and Robin Hobb can certainly bring in a crowd, yet perhaps up to half of the interested parties were unable to listen in on the discussions, even from the hallways, due to the Finnish fire code regulations on room capacity.<p><p>We did hear from one author that the organizers were rather astounded at how many people ended up signing up for the convention. It was suggested that it’s uncommon for first-time hosts to have a big turn-out, so the 6,100 pre-registered names had shocked many people.<p><p> <p><p> <p><p>The Signings Perhaps our pick for best part of the weekend, the signing booths were a clearly underappreciated part of the convention. While a few names like George R.R. Martin, Scott Lynch, Robert Silverberg, Robin Hobb, and Joe Abercrombie had rather lengthy lines for the better part of their hours (Hobb’s line, in the end, was nearly as long as Martin’s, and security was clearly unprepared for so many people), most authors were willing to sign at least a few items for you (three if they were not George R.R. Martin, and likely more if they didn’t have an extremely long line). The best (or worst?) part though, was that the lines cleared out rather rapidly, so it was quite possible to go have a conversation with nearly all of them, be it about world-building with Jo Walton, or asking either new or established authors like Russell Smith or Auston Habershaw to tell you about their books, and perhaps even sell you one on the spot. Seeing as how many of the lines were more or less empty after 45 minutes, it was clear that this was a sadly underrated part of the event and the guests were missing out on some fun.<p><p><p><p> <p><p>The Art Room Whether you wanted to bid on originals or purchase prints, the art room had something for everyone. We mentioned already that Claire Wendling hadn’t been able to attend due to illness, but her artwork remained on display, and was one of our favorite displays no less, with its Asian influence and beautiful execution. Unfortunately, we were forbidden from taken photos, but here were a few other artists that stood out to us:<p><p>Minna Louhelainen: her bit-inspired (8-bit, 16-bit, 32-bit) work was unique and intricate. Rob Carlos: art for lovers of high fantasy -style fairies and dragons. Paula Alavesa: top-quality mystical and/or mythological styles and themes. Juliu Tao: Asian-style character designs with gorgeous details. Sergey Shikin: his art was what you want your book's cover art to look like. Vitaly Yekleris: images that look like hand-painted movie posters.<p><p> <p><p>The Trade Room Perhaps the most under-prepared part of the entire convention, the Trade Room is meant to be the place where attendees frolic and spend money. Situated next to the signing booths, it was an excellent place to find people in costume, though the number and selection of vendors was shockingly small. Perhaps the worst part about the entire week was that there were no vendors selling books from most of the authors at the signings. I, for one, would have gladly spent money buying books from Elizabeth Bear and Jo Walton to get signed, but there was simply no option to do so. I did hear that there was some import trouble for the convention, but surely that doesn’t excuse the fact that there was only one full-fledged bookstore present in the whole of Messukeskus (and not exactly the best bookstore in town either).<p><p><p><p>If you had some time to kill or wanted to do something with friends, new and old - and we could imagine that being commonplace here, as many attendees come from all over the world every year - one had the option to book a table at in the gaming area and reserve a board game or tabletop game of some sort. It seemed a popular place, as the tables filled up for the better part of each day. <p><p><p><p>The trade room did boast a nice used book table, though it was more of a place to browse, since there was no rhyme or reason to the book order. One could find board games and newly released books, though frankly, the options for non-Finnish-speaking attendees were also rather disappointing. There were plenty of opportunities to buy souvenirs and memorabilia, and if you happened to be a big fan of a popular series (like Game of Thrones or Harry Potter), there was surely something of interest to browse. There were even a few stalls with fantasy or steampunk -themed handicrafts, if one were so inclined.<p><p><p><p> <p><p>The Courtyard Every morning, a team of strangely-attired steampunk blacksmiths opened shop in the Messukeskus courtyard, giving lessons in blacksmithing basics and peddling their wares. These guys had a great selection of trinkets and souvenirs, and were a perfect place to pick up a bit of new information, if one was so inclined.<p><p>As well, the courtyard also offered a “Stroll with Stars” with either Walter Jon Williams, Edward James, Scott Edelmann, Lawrence M. Schoen, or Eva Elasigue, which was a 60 minute walk around the convention venue with the author of choice. There were also Pokemon Go team meetups, a walk/picnic to the Kumpula Botanic Garden, an introduction to rapier fencing, or a meetup for those interested in Ingress (the augmented reality game).<p><p><p><p> <p><p>The Masquerade We were unable to attend the masquerade, unfortunately, but as luck would have it, WorldCon streamed it and it is available now on their YouTube channel:<p><p>WorldCon75 Masquerade<p><p> <p><p>The Hugo Awards The big event of the weekend was, of course, the Hugo Awards. Though we hadn’t personally read any of the books on the list, and thus our engagement in the event was low, we still want to offer our congratulations to the victors. As such, here is the list:<p><p>Best Novel: The Obelisk Gate by N. K. Jemisin (Orbit Books) Best Novella: Every Heart a Doorway by Seanan McGuire (Tor.com Publishing) Best Novelette: “The Tomato Thief” by Ursula Vernon (Apex Magazine, January 2016) Best Short Story: “Seasons of Glass and Iron” by Amal El-Mohtar (The Starlit Wood: New Fairy Tales, Saga Press) Best Related Work: Words Are My Matter: Writings About Life and Books, 2000-2016 by Ursula K. Le Guin (Small Beer) Best Graphic Story: Monstress, Volume 1: Awakening, written by Marjorie Liu, illustrated by Sana Takeda (Image) Best Dramatic Presentation (long-form): Arrival, screenplay by Eric Heisserer based on a short story by Ted Chiang, directed by Denis Villeneuve (21 Laps Entertainment/FilmNation Entertainment/Lava Bear Films) Best Dramatic Presentation (short-form): The Expanse: “Leviathan Wakes” written by Mark Fergus and Hawk Ostby, directed by Terry McDonough (SyFy) Best Editor (short-form): Ellen Datlow Best Editor (long-form): Liz Gorinsky Best Professional Artist: Julie Dillon Best Semiprozine: Uncanny Magazine, edited by Lynne M. Thomas &amp; Michael Damian Thomas, Michi Trota, Julia Rios, and podcast produced by Erika Ensign &amp; Steven Schapansky Best Fanzine: “Lady Business” edited by Clare, Ira, Jodie, KJ, Renay, and Susan Best Fancast: Tea and Jeopardy, presented by Emma Newman with Peter Newman Best Fan Writer: Abigail Nussbaum Best Fan Artist: Elizabeth Leggett Best Series: The Vorkosigan Saga by Lois McMaster Bujold (Baen)<p><p>John W. Campbell Award for Best New Writer: Ada Palmer (1st year of eligibility)<p><p><p><p> <p><p>Conclusion WorldCon75 was a wonderful experience on the whole. Much to the surprise of the organizers, this event turned out to be the second-largest WorldCon of all time! With so much to see and do, we would have needed a time turner to do everything we would have wanted to, having to trade panels for signings or meet-n'-greets for panels. However, it would be quite a feat to attend WorldCon and find yourself bored or uninterested. <p><p>The convention wasn't without its faults though. Security was often underprepared for the enthusiasm of some of the fans when it came to things like signings, and the convention on the whole was unprepared for how popular the panels would be, and it was unfortunate to see so many people removed from the rooms due to fire regulations. <p><p>As well, it was a true shame to have so few options available when it came to buying books. If a location is hosting WorldCon for the first time, they are usually recommended to hold back a bit, but in this case, that was poor advice. I would be willing to say that a lot of authors missed out on the opportunity to sell books because no one had them in stock, and if spreading awareness of one's work isn't what this whole thing is about, I don't know what is. <p><p>However, it would be a lie to say that we didn't have a blast, and the happy faces on everyone in attendance would suggest that we were not alone in that. A big thank you goes out to the organizers, guests, volunteers, and anyone else involved, and we wish WorldCon the best of luck in the future! We hope to see you again someday!<p><p><p><p>Photos by Jana Blomqvist<p><p> <p>", "time": "2017-08-27T10:42:00+03:00", "type": "culture"}
{"title": "WorldCon 75: Interview with author Scott Lynch", "url": "http://www.helsinkitimes.fi/culture/14975-worldcon-75-interview-with-author-scott-lynch.html", "review": "", "content": "<p>Some authors manage to grasp you by the collar and never let go, and Scott Lynch is one of those. With his stories often described as “Ocean’s Eleven, but fantasy,” Lynch has proved to be top-notch at writing exemplary characters, as well as fantastic plots and plot twists. When his name appeared on the WorldCon 75 guest list, we knew that we couldn’t let the week go by without having a few words with him.<p><p>For those sensitive to swear words, we advise caution reading onward from here.<p><p>First of all and unrelated to the rest of my questions, but congratulations on getting married and moving. Thank you! Moving was the bigger problem.<p><p>How’s everything going these days? Everything seems to be going pretty well, except for… I’m constantly at science fiction conventions when I should really be working on my next book.<p><p>Getting the obligatory question that no one wants to answer out of the way then, how is the book coming along? Everything with my fourth book, The Thorn of Emberlain, is coming along really well. I’m only being slightly facetious when I’m saying that I should be at home working on it [laughs] rather than here in Sweden and Finland traveling between conventions, but some of these things are unavoidable; as strange as it seems to look at this as a professional commitment, I suppose it really is.<p><p>My wife and I will have an uninterrupted 2 month period after we go home, during which I basically hope to get the book turned in, and then we can begin setting a firmer schedule for its publication. For the most part I’m very pleased with it. I’m pretty sure that I can fix the stuff that I’m not pleased about in the next 8 weeks or so.<p><p>Great! Now for example, George R.R. Martin and Patrick Rothfuss get a whole lot of crap from people about being late with their novels... [sighs] They do, yes, it’s kind of ridiculous sometimes. Pat gets a tremendous amount of vituperation, online in particular. I mean, George gets it, but George is also kind of above it. George doesn’t really give a shit; George is big enough to not give a shit, and Pat is still, relatively speaking, a little bit closer to his readers and does not quite have a Scrooge McDuck money-bin to dive into just yet. I mean, he doesn’t do badly for himself, but Pat gets, I think, the most vicious of all the online comments, and I just don’t understand it. We are human beings, we are human artists, we produce at the rate we produce, and telling us that you really want our work, but that you fucking hate us and that we should nail ourselves to our desks and produce until it’s finished… it doesn’t make any sense. You can’t have both. \"You’re a lazy bastard! Now give me that thing that I really want that’s beautiful, that only you do!\" [laughter]<p><p>Do you feel like you get a piece of that crap pie, or have you been avoiding it? I’ve just begun; it’s just started in the last, let’s say 2 months especially, because there was a lot of stuff that I wanted to be able to talk about, a lot of developments not just related to my books but to various other things, which have to stay under badge for the time being. As it turns out, I have not been able to talk about any of them at all. And that, for a change, is not entirely my fault. So it’s just one of the ways in which the wheels of publishing and the industry just grind very slowly. What I expected to be a gigantic series of announcements has actually been a long, stupid summer of silence. Possibly we can fix that soon-ish, but still…<p><p>It’s one of those things where my wife and I both discovered, as we’ve become more involved in our careers, that the travel and publicity aspect of it is very valuable and it’s wonderful to meet readers. It’s good to get out of the house and take vacations, meet editors and agents and so forth in other countries, but no work gets done while we’re doing this. A little bit here and there, and a lot of research, a lot of useful stuff, but no actual production of the next book. So I’m looking forward to finally nailing that son of a bitch.<p><p>In that vein, is there anything that you wish people knew about writing that people clearly don’t understand? Inherent in producing anything, basically - and very few people realize, or think about it - is that something you consume in hours or minutes takes months or years for someone to actually make. A 20-page comic book or a portion of a graphic novel... it takes a writer and an artist a month to make. It takes you 20 minutes to read it. So as far as you’re concerned, it’s 20 minutes of emotional investment.<p><p>With regard to writing itself, how long would you say your compositing period is before you even actually start writing? That phase where you’re just thinking things through. For The Thorn of Emberlain, it’s different because this is the book that I set out to write originally back in about 2000-2001, so I’ve had 15-odd years to think about this one, and that’s not usual.<p><p>Ordinarily, I would say that the lead I process to any given novel - which usually involves the writing of the previous novel - is a year or two, and ideally the writing of it would be a year or two. That’s how it went with my first two novels, but things have been a little more difficult since. I would like to get back to that point where the actual writing of a novel is a 6-8 month affair, rather than a long, drawn-out, anxiety-filled 4-year process.<p><p>Again, if someone’s going to read it, it’s going to take them 8-12 hours, and it took me 4 years to make it. The discrepancy in the emotional involvement, I think some people just don’t think about it.<p><p>Related to what you just said there, I’ve read that the seven book series was meant to have the first three as the introduction to the world and characters, with the four later books being the actual starting-point of the story. Is that true? Yeah, that’s still pretty true. I was originally dead set on starting the story with what will be book 4 in the sequence, The Thorn of Emberlain, and I realized about two chapters into trying to write it that I did not feel that I knew the characters involved well enough. It just did not feel right. So I went back and essentially wrote three prequels to it. That cheapens the other novels, you know, in memory - that’s not entirely what I mean to do to them - but I wondered how my readers could feel involved in a setting and these characters if I myself did not feel sufficiently involved in them.<p><p>So yes, there will be a major structural difference in the first half of the sequence and the second half, in that the first half was location change, location change, location change, and the second half will be a lot more anchored in place. We will see some new locations, but we’re always going to be returning to Emberlain and the Kingdom of the Seven Marrows, as returning scene settings.<p><p>Is there anything you’re allowed or willing to tell us about The Thorn of Emberlain and what to expect, such as who we might be reading about, or is it still very hush-hush? [ed: for those who want to avoid any and all story spoilers, skip down to the next question] It’s not entirely hush-hush. I can reaffirm stuff I’ve already said and try hard not to spoil anything. It does follow about 6 months after the end of The Republic of Thieves. It picks up on the northwest coast of the continent Locke lives on, in the city-state of Emberlain. It does focus on the actual civil war in the Kingdom of the Seven Marrows.<p><p>Every book has had a thematic shift and a plot shift. The first book was essentially the revenge tale, the second book was a heist novel, the third book was politics and romance, and this book is war. Locke and Jean will engage in a scheme that brings them into direct contact with an unfolding civil war and their efforts to profit from it are going to complicate their lives forever.<p><p>We’re also going to meet a new cast of recurring characters, who are going to be in total political opposition to everything Locke and Jean want to accomplish, and that is Anton Strata and his family. He’s a teenager who finds himself essentially fighting in a suddenly very vicious portion of the civil war to stay alive, let alone claim his eventual succession to the throne.<p><p>Locke and Jean, in previous books, have used the rumored threat of a civil war in the Kingdom of the Seven Marrows to make money as part of a scam, and now it’s actually happened and it’s going to severely fuck the world up, pardon my French.<p><p>So it is the biggest of the Gentleman Bastards sequence thus far in terms of scale. We’re going to see actual battles. There’s a lot of stuff that we’ve not previously seen and it’s going to be the biggest challenge and the most complicated infiltration scheme that Locke has ever run.<p><p>I’m looking very forward to reading it! Republic of Thieves ended in a very unexpected way, both for the readers and for the characters. The series feels like it took a complete turn into a different direction from there. Can you talk a bit about those endings, and did they shock you or did you already know the books were building up to that? For the most part I knew. I work from a very elaborate and anal-retentive plan. I graph everything out, draw little lines to a lot of preliminary work - I’m an outliner. Everything was proceeding firmly according to plan, although there was one gigantic twist at the end of the third book, and those who have read it will know what happens in the last scene and who returns from a previous novel. Originally that was not going to happen. Originally we were never going to see that person again. Once that scene sort of popped into my head, once I saw what they were doing, I couldn’t un-see it. I just had to. So the story has taken one significant shift and that would be it. Everything else is still basically exactly where it was.<p><p>You’ve already mentioned that you plot your stories out a lot beforehand. Do you let much of anything just happen as you go? I’m fascinated by that notion - it seems so romantic to me - but I have a lot of difficulty with actually doing so. Although, typically… what I’ve often said before is that I write a strict plan, I get about 30-40% of the way into the work, but by the time I’ve spent that much time with the characters, I’ve gotten to know them a little better. It’s not that they take over; I don’t believe in that sort of anthropomorphisation - I think that’s a little bit precious - but you’ve spent more time with them and angles and opportunities that may not have been previously obvious suddenly become obvious, because you have a better mental model of what the characters might do. They might take paths that you did not previously conceive of as possible. You can still get to the ending point you wanted, but the path becomes a little more meandering. So that’s about as far as I go toward just getting lost in my own story.<p><p>I consider you one of the top worldbuilders, or at least I love your world- Oh yeah! [laughter]<p><p>…what do you like best and worst about creating new worlds, and what do you think is the base requirement for a world to feel organic and real? I obviously love doing it. The difficulty is… there are two major points of difficulty. First off, giving yourself permission not to tell every damn thing. It’s a very difficult skill to acquire. It takes years to basically decide, how much can I get away with? The real question in worldbuilding is not how much can I dump on the page, but how much can I get away with not actually telling people? Because the alternative is to get this inelegant info-dumpy writing style, in which everyone who is meeting everyone else is taking extra time in their dialogue to explain what they’re doing.<p><p>“As an author, I find that doing these interviews, which my publisher helps arrange with newspapers, which you guys work for...”<p><p>“As you know, Bob, yes, we are in a room on a planet, which is orbiting the sun.” [laughter]<p><p>Like I was saying on a panel earlier, people repeat things. They tell each other the same stories over and over. They use the same tidbits in interviews over and over, wink wink, nudge nudge. We don’t constantly explain, “The chair you’re sitting in was made from wood and plastic, and these things blah, blah, blah,” unless you’re a fucking crazy person. Okay, maybe there are some crazy people out there that do that sort of thing, but it’s not symptomatic of mental health. But that’s what you end up with in a lot of stories, when characters inelegantly - with the best of intentions - explain the world to people who already live in it. There’s a really fine art to providing just enough clues for the reader to get the point without overwhelming the story and the people inside it. That’s what I really enjoy.<p><p>The other thing is the realization that everything is worldbuilding. Worldbuilding has this negative connotation as sort of this homework that you have to do beforehand. Like, “If you want to enjoy this book, first here’s the glossary and then here’s the map and then let’s tell you this, and here’s the backstory about who killed such-and-such and who fucked such-and-such and who wanted to kill such-and-such and who wanted to fuck such-and-such, all the way back to the first such-and-such 3 billion years ago.” [laughter]<p><p>Everything in a story is worldbuilding in the same way that everything about us is worldbuilding. Every piece of technology we are carrying, every piece of clothing we’re wearing, the passports in our pockets, the contents of our wallets, that weird thing that you’ve got on that strap around your neck and what it does [ed: he is referring to the photographer's camera] and why you’re carrying it and why we’re in this building, the languages on the signs… all of these things are clues as to where we come from, where we are, etc. And so it is with the fictional characters on the page. What they wear, what they eat, what they drink, what they value, what they want, this is all worldbuilding and it goes on until the last page of the story. It’s not all just, “Here’s the map and here’s your 50 pages of fucking background research. Memorize this so you can have fun with the story.” There are ways to make it more elegant and more intrinsic to the story, and I do this because it is more satisfying as a writer. You’ve got to be enjoying yourself while you’re doing this, otherwise you’re just doing hack work.<p><p>Have you ever read Gardens of the Moon by Steven Eriksen? Yes, I’ve read the first of the Malazan books, but I have not [yet] continued the series.<p><p>I’m in the same boat, and I’ve noticed that he almost does the exact opposite of what you’ve said: he under-explains everything. You read his book and you think, “Who are they and what are those and where are they and what’s going on?” Yet, it still works. Yeah, those books have a really high period of… the learning curve to get into them is not gentle.<p><p>Most people seem to quit at some point during that first book, but everyone I’ve heard, who has read beyond, says it’s worth it, but you just have to chew through that first confusing book. They are brilliantly intricate, but it is very daunting to get into. In some ways, the ideal is to sync the reader… the old aphorism about slowly boiling a frog about upping the temperature one degree at a time. Eventually you want to boil your reader, you just don’t want to do it at the beginning of the book.<p><p>Exactly. Now, I’ve read that you were heavily influenced by the Final Fantasy game series, or at least Final Fantasy VI... Oh my God, yes! Final Fantasy, which I played on the Nintendo Entertainment System, and Final Fantasy IV and Final Fantasy VI, and Final Fantasy VII, and Chrono Trigger… basically all the major Japanese RPGs that would’ve been available in translation in the United States from about 1988-1995 are more or less chewed, swallowed, and digested into my background, yes.<p><p>We’re running out of time, so I’ll just ask one last question now: who are some of your favorite authors, or what are some of your favorite books at this moment in time? Well, I’m always a perpetual nut about Dune by Frank Herbert. I’ve read everything that Frank ever published and I’m late to the party because he died when I was 8, unfortunately, but I was a teenage Frank Herbert obsessive and I’ve never lost a reverence for his work; even the naive and silly stuff is great.<p><p>I am a big Margaret Atwood appreciator. She was really important to me when I was a teenager. Matthew Woodring Stover is the guy that… I described him as basically the closest thing I had to a mentor. He’s a criminally underappreciated, brilliant science fiction and fantasy writer. Barbara Hambly - another severely underappreciated fantasy and science fiction writer - did a lot of stuff back in the 80s and has sadly sort of faded from the public eye, and that’s not fair at all.<p><p>Jack Vance, C.J. Cherryh, and Poul Anderson… I came to Anderson’s work relatively later in my life, about 10 years ago or so, but everything I’ve read by him has been wonderful and directly formative on a lot of my own work.<p><p>C.L. Moore, a female science fiction writer in the 40s and 50s; Leigh Brackett, another groundbreaking planetary romance/sword and sorcery writer from the 40s; Fritz Leiber, who is one of my literary heroes… an absolutely brilliant, funny, whimsical, long-lived man with a very long career [laughs]. I wish I could emulate that part too!<p><p>Robert E. Howard - the author of the Conan stories - had a really unmatched passion for the stuff that he really cared about, and that really burns through in the Conan stories.<p><p>My wife’s work, Elizabeth Bear. I’ll be nepotistic. We liked each other’s work before we started dating, so thank God for that. We both agree that we would not be in a relationship if we couldn’t stand each other’s work [laughter]. It would be miserable and awkward.<p><p>I think that’s a good start.<p><p>That’s a very long list! Thank you very much for taking the time to talk with us! My pleasure!<p>", "time": "2017-08-22T07:01:00+03:00", "type": "culture"}
{"title": "WorldCon75: Interview with author Robin Hobb", "url": "http://www.helsinkitimes.fi/culture/14974-worldcon75-interview-with-author-robin-hobb.html", "review": "", "content": "<p>As one of the most well-known female authors working within the fantasy genre, Robin Hobb stood out on the WorldCon 75 guest list as one of the authors to whom we were most interested to speak. With the final installment of the Fitz and the Fool trilogy recently released back in May, we took a few minutes to talk to her about writing worlds, diverse characters, and more.<p><p> <p><p>To get started, welcome to Finland for the second time. How has your trip been so far? We had some interesting travel bumps with missed planes and so on, but once we got to Helsinki, everything was fine.<p><p>Great to hear! Let’s get on with the main questions. There will be some minor spoilers for those who haven’t read the books, but we won’t be revealing any major plot points. I’ll warn people before I answer.<p><p>First of all, you’ve written so many stories and individual trilogies in the Realm of the Elderlings - do you ever get sick of writing in that same world? You wrote the Soldier Son trilogy outside of the RotE - was that an experiment or were you bored? I don’t think I get bored of the Farseer world, but sometimes you get an idea for a story and it doesn’t fit in the particular world that you’ve been working in and you still want to write that story. Sometimes it’s a short story. I still do writing as Megan Lindholm, I still publish stories as Megan Lindholm that are urban fantasy or vampires or whatever pops into my head, so I’m happy to do those, I’m happy to have the creative freedom to step away from the Realm of the Elderlings.<p><p>But from the beginning with the Fitz stories - and I think anybody who’s read the whole cycle of them knows and can tell - from the very beginning, this final book was in sight. I never thought I would be allowed to write this many. I never thought I would be able to tell the full arc of his life, but that’s what that’s about.<p><p>In The Rain Wild Chronicles [mild spoilers], I noticed that all of the antagonists end up dead by the end of the series, while none of the protagonists end up dying. Usually the antagonists were dying in a karmic manner by their own doing, at least to some degree. [end spoilers] What are your thoughts on antagonists and comeuppance? Do you believe the antagonists should always meet an end? Absolutely not. There are still characters in there that I would say are not exceptionally morally well-oriented. I’m trying to dance around the spoilers. There are a number of people who cross purposes with other characters who are still alive and going and figure into the Fitz and the Fool trilogy. I don’t think that... life does not have a nice little point where everything is tidied up. “We all know that they lived happily ever after,” means turn the page for what happened next. So no, I don’t think that a writer should tie up all the loose ends. Readers may find it very satisfying if an antagonist does meet an end in the story, but I think readers also know that the reality is that sometimes the protagonist in this chapter becomes the antagonist in the next one or in the next book. That’s the whole idea that characters grow and change. If you put the \"good-guy badge\" on them and keep it there forever, it’s not a very interesting story.<p><p>I completely agree, though in some ways, the “happy ending” stories have a place, because there are other sad or grim stories out there to read, and particularly with the popularity of these heavy stories, full of death, sometimes it’s nice to read a story where the good guys come out on top. Yes, and I think if you look at my books, or if you look at life in general, you’ll see there are peaks and valleys. There are moments where we feel that good has triumphed, and then 10-15 years later, we say, “Oh dear, are we back onto this again?”<p><p>One of the things that I try to do with fantasy is, if I want you to believe in dragons and magic, then everything else that is mundane and ordinary has to match our reality, and that means there are times when the hero spills his cup of hot coffee, or they miss an airplane, or any of those little mishaps that we all endure in life. I don’t smooth it out and say that everything is always going to be pony rides in the sunshine. It is the normal ups and downs of life. If they don’t appear in a book, it becomes very hard for ordinary people like us to identify with those characters.<p><p>When I read a book where someone finds out that they are the unacknowledged son of the powerful king and that they have incredible magic and within the space of 24 hours they learn to become the best swordsman in the kingdom, I’m going, “That’s not how my life is.” If I excel in one area, it’s because I’ve sacrificed in other areas. You can’t become the best at math and still be a cheerleader and soloing in an airplane on your 16th birthday. You have to sacrifice in some places to excel in others. I try to adhere to that in my stories.<p><p>Definitely, even if your antagonists survive a long time, you put them through a lot on the journey. Do you think there is a fine line between how far you can go with torturing your protagonists? When people read the Farseer trilogy and the whole Realm of the Elderlings cycle - I’m going to reveal a plot point; I think if you’ve read as far as The Tawny Man it’s no surprise to you - but the whole idea is that in order to shift the world into the path he wants, the Fool must ensure that Fitz survives, and in almost every future that he can foresee, Fitz doesn’t. So what is going on [there] is these very-near-death experiences; the Fool must then manipulate other events to bring him out of them alive. So it’s not that I’m a sadistic writer, it’s that this is part of the plot for this particular story, this plunging into danger and having that little tick of events that says that you will live. Within the story, it happens over and over and over.<p><p>Returning again to The Rain Wild Chronicles, I really liked your portrayal of the gay characters in that series, in particular. I think it was done very tastefully, and the characters never felt defined by their homosexuality. I also appreciated that one of them was, in fact, a villain, because of course gay people are just people, neither good nor bad inherently. Did you find it challenging at all to write them in any way? Here’s the thing - when I meet a person, their gender identity is most often not the most important thing about them. If we become friends, it’s not because my first impulse is, “I will be friends with you because you’re female.” I mean, there’s a lot of women I can’t stand. There’s a lot of men that I absolutely can spend hours talking to. There are a lot of people on the whole gender spectrum and whether I become friends with them or not has nothing to do with that, so when I am writing these characters, although in some ways gender can influence a plot - for instance, if you want the prince and the princess to get married and live happily ever after in a medieval setting, gender is going to influence that - but for the most part, gender is not much more important than who has blue eyes. What’s more important is who is a skilled navigator, who is tough enough to survive a bad situation, who can think on their feet and find the creative solution to a problem they haven’t encountered before, and that’s got nothing to do with gender.<p><p>So it was not that I said, “Gee, I will write a book with gay characters.” It was, I’m writing a book, this character has stepped out onto the stage, he’s told me about him- or herself, and this is who they are.<p><p>I also really like the way you’ve written romance in a lot of your stories. Romance can be very, very tricky, because it’s so easy to fall into the realms of cheesy or simply bad writing. Do you think there are any tricks in how to avoid cliches or cheesiness? I love romance as a genre and there are times when I step away from fantasy and say, “I’m going to read or write a romance.” Or a mystery, or a western. I really love my genres. I try to avoid the language that wants… his or her “throbbing” whatever. That’s not how I describe a lovely meal, so we’re not writing something that’s salacious. We’re saying, this is something that happened and there’s an attraction. In some stories I’ve read, on page 72 we stop and for five pages we have a description, usually of a sexual encounter. And a sexual encounter is not necessarily romance.<p><p>The other thing that I often [think] is, \"That was a good story until you made the entire solution, 'And then they had sex!'\" In my life, that’s never solved anything [laughs]. And in the lives of my friends. It’s like, “Oh, you did that! Okay…” But it doesn’t fix any of the problems in your life.<p><p>It often causes more problems than it solves as well. Exactly. So I think that in some cases, romance and the story of a deep love are confused with the story of people who are strongly sexually attracted to each other and then finally consummate that. That, to me, sometimes has nothing to do with romance or love.<p><p>I think it’s something where sex and sex scenes and love and romance… it’s like making a casserole or a soup, where you measure the ingredients. You say, \"Do I want it to taste entirely like pepper, or do I want you to be able to tell that there’s a little bit of cabbage in there?\" and you can tell that… \"Someone put some nutmeg in this!\" That’s what I want, is the balance of ingredients in the story.<p><p>Perfect! Now, there’s a very fine line in fantasy between something that’s believable within the world and “kind of a stretch even then,” and I know, for example, Patrick Rothfuss - have you read The Kingkiller Chronicle? Of course.<p><p>With the Adem people, they didn’t believe that men contributed to conception or birth, and the readers were saying, “Oh, that’s not possible. No one believes that!” Well, if you look at early cultures, for example, there were people who believed that having intercourse opened the woman to allow something from the spirit world to contribute to her pregnancy. It wasn’t necessarily a matter of the semen finding the egg. You’ll also find the idea that people didn’t necessarily look at somebody and say, “Your baby does not look like your husband,” because there was not that idea in those times, that this genetic and that genetic… maybe your baby looks a lot like your husband. But maybe he doesn’t. So to me, that’s perfectly believable that you can have a people that believe that the males have nothing to do with conception and birth. So in that specific example, but I think I interrupted you.<p><p>I was actually wondering if a potential parallel might be that [spoiler] Molly was pregnant with Bee for 2 years. Did anyone have any questions about how that was possible? I like a very biological magic. So I have established from the beginning, that - and I’m going to take two steps back - part of the inspiration for this was an old belief that if you planted a white rose next to a red rose, as they grew older, the white rose might somehow receive material from the red rose, and it would get red veins in it. This does happen, but it’s due to the age of the bush - we now know that. But at one time, people believed that these two adjacent roses could have an exchange of genetic material. So if you take that idea and say, “What if something happens when people live alongside dragons for a long time?” What if there is an exchange of genetic material? What [happens if] an ordinary human [is] in long-term contact with a white [prophet], with the Fool? What if there is an exchange of genetic material that can happen? [end spoiler]<p><p>So the idea that some species have a much longer gestation period than others would follow from this. I mean, pigeons can reproduce in 16 days. Cats of course take longer. Humans take much longer. Elephants take even longer. So it’s playing with some biological trappings to the magic.<p><p>That’s a very interesting take on things. Now, you have so many trilogies in the same world and I like the way they interconnect really nicely with one another. For example, I’ve read The Rain Wild Chronicles, but I’ve yet to read the Liveship Traders trilogy. But, I can read characters like Reyn and Malta as if I’m experiencing them for the first time, whereas, I noticed when I was doing a bit of research that of course these are well-established characters at this point. Do you find it hard to find the balance, where you’re still throwing back to the readers who have read your earlier books, but you’re still creating them anew for the new readers? My feeling is that every book ends where the next story logically begins. Every trilogy ends where the next part of the chronology begins, and sometimes something finishes in Buck and chronologically the story picks up in Jamaillia and Bingtown. But when you meet the characters in each trilogy, you’re meeting them at a certain stage in their lives, so the Malta that you would meet in the Liveship Traders is fundamentally and diametrically different from the Malta you come to know in The Rain Wild Chronicles, or indeed, the Fitz and the Fool trilogy. So when you meet them, yes, readers will recognize certain traits and they may speak of a past that they’ve shared with other characters, but really, it’s the beginning of that story, so as a writer I want to make it very easy for readers to step into that world and not feel like, oh, I missed this, I can’t read this trilogy.<p><p>As a writer, of course, I would love it if everybody read all of the books in the chronological order in which I wrote them, because there are little surprises and bits built into the story, where the astute reader will note, “Oh my goodness, that’s what that was all about!” And for the reader who has read all the books and paid attention to the between-the-lines, they get the little prizes, and I love when I get an email saying, “Wait a minute, I think… when this happens in this, is that because that happened four books ago?” and I go, “Yes! You are the person I’m writing for.”<p><p>You’ve talked about little things that have inspired you, like the different gestation periods. Do you have any other examples of little ideas that blossomed into bigger and bigger things in the stories? I can throw out there that I have a pond on my farm and dragonflies go through a nymph stage, where they are water creatures and they transform into dragonflies. So again, some readers will immediately know what I’m talking about and what that inspired. I don’t want to do too many spoilers. But there’s just a lot of things like that.<p><p>In the course of doing research for fantasy, you turn up all kinds of wonderful bits and pieces, such as, bees will fly toward light. That became an important thing for me to know and for my characters to know. So there are all these little bits that, when you’re researching something and at the time you don’t even know if that’s going to be important, but you reach a point in the story where you need that, and you say, “Ah-ha! I have this little piece of information. I know this is true and I can use it.”<p><p>When you do research, are you always researching for something you have specifically in mind, or do you also research for research’s sake? Oh no, it gets very specific. For instance, I don’t know anything about blacksmithing. I’ve never swung a hammer, I’ve never put metal into a forge and heated it, I’ve never looked at the colors to know when it’s right to do this or that. But if my character is a blacksmith, I have to do at least enough research that my character can convince the reader, “I’ve been a blacksmith for 20 years. I know everything about it.”<p><p>So if you can find that one little arcane piece of information that a man or woman who’d been a blacksmith for 20 years would know, and you slide that in - just that one fact; you don’t want to overwhelm the reader with “here’s how to be a blacksmith” - it says, “Oh, that person really knows that.” So I don’t have to know everything about blacksmithing, but my characters do, and they have to convey to the reader that, “I’m a very competent blacksmith.”<p><p>My most enjoyable way to do research is to go to the library and I would look up “blacksmith,” but I would look in our filing system in the US... there would be a J for the juveniles. So I go to the juvenile section and I get the picture books on blacksmithing, because, (1) be it a ship or a blacksmith’s forge, they will have everything labeled with the correct names of things, because naming is so important, and you can read it through and they put in the most interesting facts to keep children engaged, so you get all kinds of wonderful little bits and pieces, and (2) in the back of the book, there’s a wonderful bibliography, so this simplifies it, these are the books you used and I now have a bibliography if I need to know more about blacksmithing. So that’s my shortcut and it’s worked very well for me. Beekeeping, blacksmithing, herbs… it’s a great start.<p><p>That’s a fantastic tip! Now, winding down towards the end of my questions, who thus-far has been your favorite character to write with possibly the exception of Fitz and the Fool, since they are the obvious choices? It’s kind of like asking a parent who is [their] favorite child. Especially the viewpoint characters. In the Liveship Traders there are a lot of viewpoint characters, and in The Rain Wild Chronicles there are a lot of viewpoint characters. As a writer, when I am writing from a tight third-person point of view, I really have to put that character on like a coat and say, “I am now Kennit. I feel absolutely justified in what I’m doing, because I’m smarter than everyone else and I know this is what has to be done,” and I have to share his convictions and his righteousness and his fears and his paranoia, and I have to be that character for the time it takes me to write them. So for that time, that’s my favorite character.<p><p>Then you go on and suddenly you’re writing from Brashen’s point of view, and he’s very different and he has different attitudes and doubts about himself and a drug addiction, but I have to take all of that and say, “I am Brashen and this is my life,” and for that point in time, he’s my favorite.<p><p>Who then has been the hardest to write? Who has the most difficult cloak to put on? Hmm… I don’t think that I could successfully write a character that I found difficult. There are some that are more challenging than others. Of course, I’ve never written from the Fool’s point of view and that’s because he needs to retain a certain amount of… he’s a very private character. He doesn’t really want people inside his head, so sometimes his motivations are hard to figure out, why he’s doing things or how he feels about things. I think… I end up loving all of my characters. I love my villains as much as I love my heroes, so there are none that are particularly difficult. I enjoy writing them all.<p><p>That’s fair. Now because the Realm of the Elderlings is such a great world, what are your favorite and maybe least favorite parts of worldbuilding? My least favorite part would be drawing maps, because I would be… some people are dyslexic, and I can’t tell you how many feet or yards or meters it is from here to there. Every time I would have to take out a tape measure and measure it. I can’t tell you how long [this counter] is. Most people have an ability to look at that and make a fairly good estimate. So when you have this spatial disconnect, drawing a map is really, really challenging. I send my editors these horrible scribbly things, and they find some poor artist who then tries to make sense of it and make a map. So that’s my least favorite part.<p><p>I think my favorite part is when I am doing a rewrite and I get to go back and put the pieces in that make you look very clever. The dialogue that’s witty or the little twist of language that tells the reader more than the viewpoint character knows, and those are the fun parts. It’s like putting little surprises in, hiding the charms in the cake.<p><p>My last question then, at this point in time, what are some of your favorite books or authors that you might recommend to others? Oh, let’s see! On the flight here, I finished a book that is still in manuscript and won’t be coming out for a while. Do you want that one?<p><p>Certainly! It’s called City of Lies and it’s by a new Australian writer, Sam Hawke.<p><p>What did I read before that? I read Red Sister by Mark Lawrence, which is riveting. I read Nevernight by Jay Kristoff. Nevernight and Godsgrave. He’s an excellent writer and those are very good books. I had a very interesting time contrasting Nevernight and Red Sister, because they were stories that share some similarities about the training of assassins, essentially, and I very much enjoyed those two. I think I’ll leave you with those ones.<p><p>My standards recommendations are… I love everything Joe Abercrombie has written. I can give a strong recommendation to Brent Weeks. Laura Lam is doing some very interesting stories. That should be it.<p><p>Great! That’s all of my questions. Thank you so much for taking the time to speak with us!<p>", "time": "2017-08-22T07:00:00+03:00", "type": "culture"}
{"title": "Metal all night and party every day", "url": "http://www.helsinkitimes.fi/culture/14084-metal-all-night-and-party-every-day.html", "review": "", "content": "<p>THE 19TH TUSKA Festival took place at Suvilahti in Helsinki from July 1 – 3. The metal weekend was kicked off with the Tuska Heatseeker evening on Thursday, June 30, at legendary rock club Tavastia where Shiraz Lane, Lost Society and Santa Cruz played in front of a packed house and made sure everyone got into festival mood in time for Friday. <p><p>A hot summer day greeted the metal heads the next day, and Cattle Decapitation got the festival started full force with their powerful deathgrind. The Friday continued with performances full of energy by Mantar and Kvelertak. Lordi delivered their ‘The Arockalypse 2006 Redux Show’ - and I can only imagine how sweaty it must have been under their masks and costumes with the hot summer sun shining down on the Radio Rock Main Stage. Testament sounded excellent on the main stage as well, and Behemoth performed their intense metal ritual on the tent stage. Avantasia closed the first festival day and were the first ever Tuska headliner to play until midnight as the City of Helsinki had granted permission to play longer hours on Friday and Saturday for the first time this year.<p><p>Saturday was the day of superlatives. The Finnish summer continued to show itself from its best side. That weather and the quality line-up led to the festival selling out for the day with a total of 11 000 metal heads gathering at Suvilahti. One could tell as there were people as far as the eye could see. There was something in the air from the get go - I don’t mean just the promise of a thunderstorm later on. And just like the weather switched from hot to cold(er) in the evening, the music changed from fast to slow, from heavy to black. <p><p>Brymir started the day on the main stage, and the maybe slightly tired crowd woke up fast. Fuck-Ushima kept the energy and a circle pit going on the Inferno Stage. With The Dead and their doom metal provided a moment to calm before Circle took their audience on a crazy ride, and Primordial mesmerized with their beautiful melodies and heaviness on the main stage. Tsjuder kicked things up a notch, playing a raw, in-your-face Norwegian black metal gig before Turmion Kätilöt started the metal disco party, playing the Tuska main stage for the first time. The day powered on with Anthrax and Stam1na before anticipation reached unknown levels as it was finally time for Grammy-winning band Ghost to perform.<p><p>Even the weather gods complied in making this a truly spectacular show. The sky was ablaze – burning in 666 shades of red and purple. Ghost stepped on stage and the crowd exploded. The heavens parted and rain poured down. What an atmosphere. What a show to close the second day of Tuska.<p><p>Sunday started a bit calmer and under grey skies. This suited the artistic and powerful performance by Myrkur perfectly, alternating between almost angelic melodic parts and demonic metal growls. Mörbid Vomit didn’t take any prisoners and delivered a tight death metal set. Diablo and Gojira played in front of big excited crowds before things took a melancholic turn with Katatonia. Children Of Bodom closed this year’s Tuska and the crowd gave it their all for one last time. <p><p>Swallow the Sun deserve a special mention as they played one of the Songs From The North albums on each festival day. From the summer festival show on Friday, to the very intimate and unbelievably beautiful acoustic concert on Saturday to the dark doom gig on Sunday each and every one of them was incredible in its own right, but as an entity they were one of the most special festival experiences ever.<p><p>All in all, 28 000 visitors gathered at Tuska over three days and it was once again a magnificent festival experience.<p><p>Text<p><p>NINA RATAVAARA HT<p><p>Photos <p><p>EIJA MÄKIVUOTI<p>", "time": "2016-07-07T18:44:21+03:00", "type": "culture"}
{"title": "Finnish author seeks success in India", "url": "http://www.helsinkitimes.fi/culture/14072-finnish-author-seeks-success-in-india.html", "review": "", "content": "<p>A Finnish author is looking to find success for his new book on India and English by collaborating with authors in that country. Despite rejections from both agents and publishers, the 43-year-old UK resident is going it alone in promoting his self-published ebook overseas. Jesse Karjalainen, originally from Finland and grown up in Australia, is this week appearing on the leading publishing podcast in India.<p><p> His appearance on the MyKitaab podcast is the result of a newly formed cultural friendship that connects the UK and Finland with Bengaluru, west of Chennai. <p><p> The word kitaab means ‘book’ in Hindi, Farsi and other languages and derives ultimately from Arabic.<p><p>The unsigned author’s latest book, English Masala, combines the history of India and the British Empire with the etymology of Anglo-Indian words. He said: \"The book takes a fresh look at the story of that amazing nation’s past and explores how it has contributed so many words to the English language.\" He added: \"I love to write about the English language and this latest book explores the fascinating origins of everyday English words that have a cultural or historical connection with India and the British Empire.\" He cites well-known Anglo-Indian words such as shampoo, veranda, India pale ale and bungalow, along with surprising examples such as thug, Blighty, gingham, surf and factory. He continued: \"I thought I knew about India when I started but the more I researched the more secrets history of India's history I uncovered. There is so much more to the country than the Taj Mahal, curries and choking traffic. \"For example, I never knew that chess was invented in India, nor did I ever fully understand that the Portuguese were trading there for more than a century before the English even first set foot there.\" Mr Karjalainen was interviewed about his writing career and his book on the pioneering podcast MyKitaab, produced by Indian author Amar Vyas. The nation, with a population of more than 1 billion, is only now waking up to online publishing technologies such as ebooks and podcasting.<p><p>\"The potential for podcasts in India is huge right now,\" said host Amar Vyas, \" and the same is true of self-publishing.” Amar himself has lived in the US and has since returned to his native India, where he is building a digital media company and author network. In addition to promoting his book, Mr Karjalainen is also exploring options for producing an audiobook version of English Masala. He said: \"It is amazing that a complete professional audio recording can be produced in India for a few hundred pounds. \"I also love the idea of having an audiobook version made using a genuine Indian accent – how cool is that?\"<p><p>Mr Karjalainen is also a traditionally published author and his first hardback book, The Joy of English, was a simple guide to better grammar.<p><p>Working with the Indian podcaster and entrepreneur, he found that they both share a wide international experience.<p><p>By the time he was a teenager, Jesse had been to 36 different countries and so far he has lived in eight, while Mr Vyas has lived in 15 world cities, including several years in the US.<p><p>His latest book is available exclusively on the Amazon Kindle platform and the podcast interview can be heard at www.mykitaab.in.<p>", "time": "2016-07-01T14:21:28+03:00", "type": "culture"}
{"title": "FULL METAL FESTIVAL", "url": "http://www.helsinkitimes.fi/culture/14065-full-metal-festival.html", "review": "", "content": "<p>HEL(L)SINKI SUMMER also means another Tuska Open Air Metal Festival is around the corner. And all around Finland and the world metal heads are packing their band shirts, leather vests, black boots and - hoping the metal gods will grant good festival weather – sunscreen to head to Helsinki for the weekend of July 1 to July 3. This will be the 19th edition of the festival, and it is again taking place at the former energy production area Suvilahti that is located very close to the city center. <p><p> <p><p>But there are also some news to announce this year: For the first time, Tuska got permits to keep rocking until midnight on Friday and Saturday. On Sunday, the festival ends at 9 p.m. as in the years before. In addition to the already familiar Radio Rock Main Stage and Inferno Third Stage, there will also be a tent stage called Helsinki Stage this year. The program got some interesting additions as well: On the Solmusali Stage Tuska offers panels and interviews with metal legends such as Alex Skolnick from Testament and Scott Ian from Anthrax.<p><p>Those two bands will of course also play at the festival, along with other international heavy weights such as Behemoth, Kvelertak, Mantar, Tsjuder, Katatonia, Hatebreed, Delain, Primordial and Gojira. Avantasia areheadlining on Friday with their first ever show in Finland, while Grammy Award winners Ghost will be the main act on Saturday. Finnish metal legends Children of Bodom will be closing the festival on Sunday.<p><p>The program of course holds a lot more Finnish bands: Lordi will play a special ‘The Arockalypse 2006 Redux Show’, and Swallow The Sun will perform on all three days, playing one of the Songs From The North albums each day. Other Finnish acts are Frosttide, Omnium Gatherum, Thunderstone, Lord Vicar, Turmion Kätilöt, Crimson Sun, Stam1na, Jess And The Ancient Ones and Diablo.<p><p>At the pre- and afterparties the festival goers can enjoy even more Finnish bands: On Thursday June 30 Tuska 2016 Heatseeker brings Santa Cruz, Lost Society and Shiraz Lane to the legendary Tavastia rock club. During the festival, the official after parties will be held at Virgin Oil Co and Bar Bäkkäri. Bands like Medeia, Fear of Domination and Bloodred Hourglass will make sure that the festival mood continues almost around the clock.<p><p>Tickets range from 70€ for a regular one-day ticket to 125€ for all three days. There are also Turbo VIP Tickets available at 155€ for one day or 255€ for the whole festival. All information and updates can be found on http://www.tuska-festival.fi/ as well as on the Tuska app (available for iOS, Android and Windows Phone).<p><p> <p>", "time": "2016-06-28T16:37:58+03:00", "type": "culture"}
{"title": "CROSSING BORDERS WITH POETRY", "url": "http://www.helsinkitimes.fi/culture/13949-crossing-borders-with-poetry.html", "review": "", "content": "<p>Last autumn, the Finnish Embassy in Warsaw asked me, if I could contribute some nature-themed poems for the ‘Wiersze w Metrze’ project organized by the city of Warsaw. The aim of the project was to celebrate the diversity of languages by displaying poetry from different parts of Europe in the Warsaw subway in Polish translation.<p><p>Of course, I accepted the offer. It sounded exactly like an opportunity that only comes once in a lifetime. I was given about a week to send the finished texts for the project. I’ve always felt it fairly easy to write poems about nature, as nature has never been far from where I’ve lived. A week was a short time to write new material, but certainly enough.<p><p>When writing the poems, I had to consider the fact that they were to be translated. Non-Finnish readers might not understand allusions specific to Finnish culture, and various words for snow might be impossible to translate. Thus, I chose to use nature as a setting for different emotions, rather than a subject or a theme. One doesn’t have to be Finnish to regard nature as a place of relaxation and introspection, though some cultures do see nature as a place of danger instead.<p><p>On the international World Poetry day on March 21st, a poetry reading event was held at the Zamek Ujazdowski, a center of modern art. I performed the three poems I had written for the project in original Finnish, and my performance was followed by two actors reading the Polish translations by Łukasz Sommer. A total of seven European poets performed that evening, arguably the most prominent of them being Ana Blandiana from Romania and Kyriakos Charalambides from Cyprus.<p><p>For a poet like me, who has yet to have their first book published, performing abroad and having poems translated into another language has special significance. First of all, it validates the time and effort put into learning the craft of communicating in a way that resonates in the reader or the listener. Second, it inspired me to challenge myself more both as a writer and a performer. If the possibility arises, I’ll perform internationally again someday − perhaps in Poland, perhaps somewhere else.<p><p>In the 2010s, contemporary poetry isn’t confined to the printed page. Live performances of poetry and campaigns such as ‘Wiersze w Metrze’ in Warsaw are organized to bring poetry before new audiences. Even though poetry isn’t a profitable genre from a publishing standpoint, its potential to move and excite audiences is tremendous. If emotions have value of some kind, then so does poetry.<p><p>JUHANA HENRIKKI HARJU<p>", "time": "2016-04-25T11:40:32+03:00", "type": "culture"}
