{"title": "Where to taste the Kobe beef in Helsinki", "url": "http://www.helsinkitimes.fi/eat-and-drink/15985-where-to-taste-the-kobe-beef-in-helsinki.html", "review": "", "content": "<p><p><p>If you are a culinarist and always looking out for new and extraordinary tastes you are certainly familiar with Kobe beef. Named after the province in Japan where it originates from, the Kobe beef is from the Tajima strain of Japanese Black cattle raised in that area according to strict rules set out by Kobe Beef Association. In addition to geographical and strain restrictions, the meat must have a marbeling ratio of 6 and above and a quality score of 4 to 5 in order to be granted the trademarked brand of Kobe Beef.<p><p>There are several restaurants specialised at specialty beef and steak in Japan where you can taste the Kobe beef, and other quality steaks collectively titled Wagyu” beef. Kobe beef is probably the most expensive piece of meat you can find, and obviously the supply is very limited.<p><p>To get to those Kobe restaurants you need to reserve in advance as there is always a queue and in the best places there are only a few seats. I didn’t succeed in my last trip to Tokyo. They were all fully booked for the next few nights. Should have reserved before travelling!<p><p>But when back to Finland and researching the topic, I was surprised to find out that you can have a Kobe dinner here in Helsinki as well! Kobe is offered by only one restaurant in the country; Goodwin Steak House has Kobe in it’s menu. The restaurant is a specialised beef restaurant originating from Estonia, which has expanded to Helsinki a few years ago. <p><p>Goodwin is established by a team of steak enthusiasts who studied the concept of good steak in USA and Australia, brought it to Tallin in 2009 and later to Helsinki. The name comes form the old English “Go-Dwine” meaning “good friend”. The restaurant in Helsinki is across the street form market hall (Kauppahalli) in Eteläranta.<p><p>After calling and confirming with the restaurant there was only one thing to do, go and check if the Kobe in Helsinki is as good as the one in Tokyo. One thing you should now about Kobe beef is that you get to cook it yourself. A portion of 200 grams costs 95€ in Goodwin. The beef is brought to you as thin slices on a plate. A granite stone heated to 600 degrees is put on the table and sea salt is sparkled on it from a mill. Then you get to grill your Kobe slices to your taste. Usually few seconds are enough as you don’t want to overcook the tender meat. Medium raw is the best. As the amount of beef is probably not enough to satisfy your hunger, side dishes are recommended to accompany the meal<p><p>Other steaks and grilled meat on the Goodwin menu are also high quality and some of them are exceptionally good. The restaurant prides itself in having a history of offering beef and training the best cooks to prepare and grill steaks and you can taste that.<p><p> <p><p>Alexis Kouros - HT<p>", "time": "2018-11-27T17:10:04+02:00", "type": "eat-and-drink"}
{"title": "SMALL BUT MIGHTY TASTY", "url": "http://www.helsinkitimes.fi/eat-and-drink/15502-small-but-mighty-tasty.html", "review": "", "content": "<p>SINCE KORTTELI on the 5th floor of the Kamppi Shopping Center with its variety of restaurants opened over a year ago it has been hustling and bustling. One restaurant where you can be sure to often see a queue at the door is Hoku. The restaurant has 66 seats and the most coveted tables are the ones by the windows, overlooking Narinkkatori square and Helsinki’s center, the cathedral shining in brightest white in the background.<p><p>Hoku serves Hawaiian-Japanese fusion flavors both during lunch hours and for dinner. The menu is small but mighty, from Salmon Teriyaki to Bi Bim Bap or Oxtail Adobo which is the owner and chef Ryan Shibuya’s favorites. His journey led him from Hawaii to Helsinki via Minnesota, from working in banking and consulting to Le Cordon Bleu and Hoku. Hoku itself started off in a small bar-turned-restaurant in Punavuori several years ago. “We came up with the name Hoku. My mother and my sister helped me choose - it means ‘star’. We had the design, the little man you see in the logo, which comes from the petroglyphs in Hawaii,” Ryan tells.<p><p>When it comes to the flavors, Hawaii as a culture of culinary fusion is reflected at Hoku. The mix of Japanese, Philippine, and Chinese flavors that is so common in Hawaii can be found on the menu. “We wanted to have some traditional and simple things that we could do well, so we tried to stick with products we have here. In terms of the types of food, the influences right now are more Japanese because I am Japanese. But we also have influences from Korea and China and Filipino dishes on our menu,” Ryan explains. <p><p><p><p>The philosophy of Hoku was already the same in Punavuori: Focusing on a few things they did well, a menu that fits on one page and putting quality and consistency above everything. “Part of the philosophy is that the quality and consistency of the food we produce is top notch. I have made no exceptions. Even when times were hard, we never compromised the quality of our food.” <p><p>This concept is also upheld when it comes to how the dishes are composed. If the available ingredients or ways of executing are not up to Hoku’s standards, the dish won’t make it onto the menu. Sometimes, this requires quite a bit of testing as with the dish ‘Seafood &amp; Lup Cheong Stuffed Kuha’ that was inspired by the spearfishing days of Ryan’s father. The caught fish was stuffed with a variety of ingredients, steamed and served with soy sauce. Now, after many tries to get it just right, customers can enjoy Hoku’s take on this dish, served with beurre blanc instead of soy sauce.<p><p><p><p>The customers certainly seem to appreciate the focus on quality and consistency as they followed Hoku from Punavuori to Kamppi after the small restaurant burned down two years ago and the bigger one at Kortteli opened. But not only the customers followed, also most of the staff stayed on, and Ryan emphasizes that they are one of the most important assets of the restaurant. Quality and consistency go beyond just the food at Hoku. And the plans to open a second Hoku are still alive and kicking, so keep your eyes open for that. You can be sure you’ll be served just as delicious and fresh food there as well.<p><p>Restaurant Hoku<p><p>Kamppi Shopping Center, Kortteli, 5th floor<p><p>Urho Kekkosen katu 1, 00100 Helsinki<p><p>Mon-Thur 11.00-15.00 / 17.00-22.00<p><p>Fri 11.00-15.00 / 17.00-23.00<p><p>Sat 12.00-16.00 / 17.00-23.00<p><p>Sun 12.00-16.00<p><p>tel. 040 1646160<p><p>http://hoku.fi <p><p> <p><p>TEXT: NINA RATAVAARA<p><p>PHOTOS: JATZI – JACEK WALCZAK<p><p> <p>", "time": "2018-05-01T13:20:45+03:00", "type": "eat-and-drink"}
{"title": "SUSHI FOR THE WHOLE FAMILY", "url": "http://www.helsinkitimes.fi/eat-and-drink/15334-sushi-for-the-whole-family.html", "review": "", "content": "<p>THERE IS no question, that sushi has taken hold in Finland, and especially in Helsinki. But things were a bit different back in 2015 when the first Luckiefun’s restaurant opened in Sörnäinen. Fast forward to February 2018, Luckiefun’s sushi buffet can now be found at three locations in Helsinki and at one in Vantaa.<p><p>The restaurant at Fredrikinkatu 49 in Helsinki’s centre is just about a year old by now. It looks modern and seems to follow the clean lines of Scandinavian design, incorporating a lot of wooden elements that add warmth to the room, while the aquarium adds to a pleasant atmosphere.<p><p>The very popular window booths with their comfy benches are perfect for a more private moment, slightly elevated above the main dining area where solo diners, as well as larger groups, find enough space.<p><p>The restaurant seems to be popular even on a cold and dark February evening which certainly isn’t the high season for sushi as Luckiefun’s founder Luckie Bao tells me over the background sounds of kids enjoying their maybe first sushi experience.<p><p>Bao then is also quick to point out that Luckiefun’s restaurants are very family friendly, the Fredrikinkatu one, for example, offers enough space between the tables to get a pram through (and for the kids to even run around a bit) as well as a changing table in the bathroom. The family is a key aspect of the Luckiefun’s restaurants anyway: Bao’s mother started the family’s first restaurant in 1996 when she opened one of the first Chinese buffets in Helsinki at the time: Hong Fu in Sörnäinen. A decade later, Bao took over and opened Luckiefun’s at the same location, including family also in the new name which is a combination of his and his wife’s English first names.<p><p>Asked why he decided to open a sushi buffet restaurant, Bao says that “I love sushi myself and in 2015 there were not that many sushi buffets around, so I developed this concept.” Luckiefun’s offers all that your sushi buffet heart might desire: A fresh and varied selection of sushi including various salmon options that are a customer favorite, as Bao points out, as well as soup and a selection of warm dishes from chicken satay to noodles with tofu and veggies. And if you still have room for more after all this, there is fruit, cake, tea and coffee to round off the dining experience.<p><p>Not all Luckiefun’s are the same: At Kaivokatu, you will find a larger sushi selection than in any of the other locations, and the one in Sörnäinen offers more vegan options. Prices and opening hours vary depending on the restaurant. Weekday lunch buffet (10.30-17.00) prices range from 10 to 12,90€ depending if you choose the option with or without sushi, and the evening buffet (from 17.00 on) starts at 14€. You will also see new Luckiefun’s locations pop up in Espoo, Kerava, Tampere and Turku in the coming months – check the website for all information concerning opening hours, pricing and the new restaurants: www.luckiefun.com<p><p>Luckiefun’s Restaurant<p><p>Helsinki Center<p><p>Fredrikinkatu 49<p><p>00100 Helsinki<p><p>Mon-Thu 10.30-21.00<p><p>Fri 10.30-22.00<p><p>Sat 12.00-22.00<p><p>Sun 12.00-21.00<p><p>(kitchen closes 1 hour before)<p><p>tel. 045 2184 480<p><p>www.luckiefun.com<p><p>TEXT: NINA RATAVAARA<p><p>PHOTOS: JARMO SIIRA<p>", "time": "2018-02-16T10:49:29+02:00", "type": "eat-and-drink"}
{"title": "A BOWL OF GOODNESS", "url": "http://www.helsinkitimes.fi/eat-and-drink/15333-a-bowl-of-goodness.html", "review": "", "content": "<p><p><p>WHAT IS this colorful bowl, filled to the brim with fresh, tasty ingredients you ask? Well, it is a Poké bowl! And if that doesn’t clarify things for you, EAT POKÉ HKI manager Jaden is happy to explain the correct pronunciation, the origins and how to build the perfect Poké bowl. <p><p>“It is actually pronounced ‘poʊˈkeɪ’, and it originates from Hawaii. The dish is however heavily influenced by Asian flavours like soy sauce, sesame oil, roasted sesame seeds, fresh chili, cilantro, and garlic,” explains Jaden while we are sitting at a cozy window table in the new EAT POKÉ HKI location on the second floor of Aikatalo.<p><p>Poké is a raw fish salad, and in Hawaii the traditional main toppings include fatty tuna and octopus, sliced and cut into cubes.<p><p>In Finland, at EAT POKÉ HKI, different variations of salmon are king. A choice of main toppings like one of the salmon options (raw with different seasonings, smoked or baked), tiger prawns, tofu, avocado, octopus or squid are combined with salad or rice and veggies, and then different sauces, sesame seeds, fresh chili and the likes can be added as well.<p><p>Jaden speaks passionately about Poké bowls and how to build a great one: “First, take the bowl and add a bed of rice, salad or both. Add soy sauce, teriyaki sauce, sesame seeds or dried seaweed to flavor the rice with. Then you add your veggies, and on top of that the main toppings of your choice. To finish of the bowl, you add the sauces and then extra toppings like fresh chili, cilantro, spring onion.” <p><p>By now it should be clear that Poké bowls are a very tasty, nutritious and at the same time healthy meal that is low in oils and carbs. This is also why Jaden wanted to bring these bowls of goodness to Finland and opened the first Poké bowl focused restaurant in Helsinki on the first floor of Aikatalo at Mikonkatu 8 at the end of 2016. Since then, people have come from near and far in Helsinki for a delicious meal, quickly filling up the small place. But since a few weeks, EAT POKÉ HKI can seat more hungry lunchers and diners as they opened a second, more spacious location that seats up to 40 just upstairs of the first one on the second floor of Aikatalo. So, from now on, there is more room and more time to enjoy your Poké bowl as the second floor restaurant also has longer opening hours.<p><p><p><p>The concept remains the same: During lunch (11.00-15.00) you can build your own Poké bowl from the buffet and choose two of the over 10 different main topping options. Miso soup, coffee and tea are also included in the price, starting at 10€. Outside of lunch hours, diners can order off the menu - the prices start at 13€ - and get served a not only delicious but also gorgeous looking Poké bowl. <p><p>“A favorite of many customers and myself is the bowl where you can combine two different main toppings, for example raw salmon in Shoyu sauce as well as the one in spicy creamy sauce,” says Jaden. There is also a bowl where you can literally have all the toppings - perfect to share with a friend. And do not worry if EAT POKÉ HKI is not just around the corner for you yet, keep an eye on their Facebook page for information on new locations opening during this year.<p><p> <p><p>EAT POKÉ HKI<p><p>Mikonkatu 8, Aikatalo (1st and 2nd floor, different opening hours)<p><p>00100 Helsinki<p><p>Mon-Thur 11.00-21.30<p><p>Fri 11.00-23.00<p><p>Sat 12.00-23.00<p><p>Sun 12.00-20.00<p><p>tel. 044 9883299<p><p>https://www.facebook.com/eatpokehkiofficial/<p><p> <p><p>TEXT: NINA RATAVAARA<p><p>PHOTOS: JARMO SIIRA<p><p> <p><p> <p>", "time": "2018-02-15T10:16:58+02:00", "type": "eat-and-drink"}
{"title": "ROSTER", "url": "http://www.helsinkitimes.fi/eat-and-drink/15273-roster.html", "review": "", "content": "<p>Restaurant Roster in Helsinki Offers Quality Food Outside the Mainstream <p><p>The idea behind Roster, a bar and restaurant in the heart of Helsinki (right next to Helsinki’s oldest wooden house), was built on Paul Hickman and Kari Aihinen’s vision of adding something new to Helsinki’s restaurant scene. The central concept is simple: preparing and serving quality food using the best ingredients, superb service and great ambience. The name Roster refers to the vision of building a team of pros as well as to the selection of food, wine and drinks that the Roster team would like you to eat and drink with them.<p><p>What places restaurant Roster outside the mainstream of Helsinki’s restaurant scene is the relaxed touch, the aim to do things differently but with a professional attitude in all aspects of food and service. To strip away the formalities of fine dining and to experience and taste the food for what it is. <p><p>I asked Annis Lassila, the restaurant manager at Roster, about the vibe and atmosphere that visitors can expect when coming to dine at Roster. “The ambience is really cosy and relaxed. Roster’s interior, which is designed by Bond Creative Agency, really captures the core idea of Roster: stylish and elegant, relaxed and easy going. When you enter Roster you really don’t have to worry, we will take care of you and the ambience will hug you”. <p><p>The venue Roster spreads over two floors with a secret back room, Omertà, and three Chef’s Tables downstairs, where you can watch the action in the kitchen and have a chat with the team. The three Chef’s Tables can host groups of four to six people or can be booked for larger groups up to 18 people. Thus, Roster can cover different kinds of occasions at the same time, ranging from small reservations to big private events. The doors are open every day of the week for everybody and their big lounge bar is a great place to taste artisan cocktails and small bites. During the weekends we have a DJ playing tunes. <p><p>Roster serves a variety of locally grown and high quality imported products including vegetarian and vegan-friendly options. Visitors get the chance to try out an international cuisine, so there is always something for everybody on the menu. Kari Aihinen and his team have built a menu that caters to all as it consists 1/3 of meat-based dishes, 1/3 of fish based dishes and 1/3 of vegetarian based dishes. They also have a set menu that changes every other week so there is always something new to offer. And of course, the majority of dishes and menus can be ordered as vegan, gluten- and lactose-free. <p><p>And why not try out an excellent wine or cocktail with your dish? At the Roster bar, for example, visitors can taste “Helsinki” in the shape of a cocktail. The mix promises Nordic flavours and the sense of the capital in form of berries, mushrooms, herbs and liquorice. <p><p>Bon appétit!<p><p>Roster Helsinki, Pohjois-Esplanadi 17. Open Mo-Tue 11-24, Wed-Thu 11-02, Fri 11-03, Sat 14-03, Sun 13-22 (Sunday Roast).<p><p> <p><p>Franka Kermer <p><p> <p>", "time": "2018-01-19T11:38:59+02:00", "type": "eat-and-drink"}
{"title": "Nepalese with a kick", "url": "http://www.helsinkitimes.fi/eat-and-drink/15260-nepalese-with-a-kick.html", "review": "", "content": "<p>Restaurant Api is a new Nepalese restaurant located in Punavuori. Relocating to Helsinki in the summer of 2017, the restaurant was previously based in Kokkola. “We were known as the best Nepalese restaurant in town,” says owner Nirmal Gautam. “Because of our success in Kokkola we were able to come to Helsinki.”<p><p>Nirmal moved to Finland from Nepal in 2013 and quickly decided to open the original Ravintola Api. “The new restaurant is quite different from other Nepalese restaurants in Helsinki,” explains Nirmal. “Our vibe is quite Scandinavian, although the food is completely South Asian.” <p><p>So, what’s on the menu?<p><p>“Choyala, which is marinated and grilled chicken with garlic, ginger and spices, is a typical Newari dish from Kathmandu. It’s very popular. Timur chicken or lamb is made with sichuan pepper and is very authentic. Then there’s fish, vegetarian and vegan options like tofu chilli. My personal favourite is paneer tikka masala,” says Nirmal. <p><p>Diners can also stop by for lunch. There are up to eight options and the menu changes daily. <p><p>“In the future we plan to introduce new dishes that originate from all over Nepal,” adds Nirmal. “Three- and four-course meals and taster menus with wine, too. We have lots of ideas, but maintaining the quality is our first priority.” <p><p>Text: Dan Anderson<p><p>Photos: Jarmo siira<p><p>Ravintola Api<p><p>Annankatu 6, 00120 Helsinki<p><p>044-2440688<p><p>This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak1b0d47d03204962eabf4cd16847216ab').innerHTML = ''; var prefix = '&#109;a' + 'i&#108;' + '&#116;o'; var path = 'hr' + 'ef' + '='; var addy1b0d47d03204962eabf4cd16847216ab = 's&#101;rv&#105;c&#101;' + '&#64;'; addy1b0d47d03204962eabf4cd16847216ab = addy1b0d47d03204962eabf4cd16847216ab + 'r&#97;v&#105;nt&#111;l&#97;&#97;p&#105;' + '&#46;' + 'f&#105;'; var addy_text1b0d47d03204962eabf4cd16847216ab = 's&#101;rv&#105;c&#101;' + '&#64;' + 'r&#97;v&#105;nt&#111;l&#97;&#97;p&#105;' + '&#46;' + 'f&#105;';document.getElementById('cloak1b0d47d03204962eabf4cd16847216ab').innerHTML += ''+addy_text1b0d47d03204962eabf4cd16847216ab+'<\\/a>'; <p><p>Monday to Thursday: 11:00 – 22:00<p><p>Friday: 11:00 – 23:00<p><p>Saturday: 12:00 – 23:00<p><p>Sunday: 12:00 – 21:00<p>", "time": "2018-01-15T17:57:13+02:00", "type": "eat-and-drink"}
{"title": "Ränginäk – a taste of Iran", "url": "http://www.helsinkitimes.fi/eat-and-drink/13765-raenginaek-a-taste-of-iran.html", "review": "", "content": "<p>Only a few of us residing in Finland have heard of Zanjan, a city of nearly 400 000 inhabitants in the northwest of Iran. The image we attach to it has little to do with reality -a rich heritage of astonishing handcrafts and an incredibly tasty cuisine. Too often the scandal-oriented media shapes our worlds and defines people’s destinies. Vahid Mortezaei, a Zanjan-origin food designer residing in Helsinki, knows that it takes colossal amounts of courage and determination to break these stereotypes.<p><p>“When I came to live to Finland five years ago, I preferred to not to mention my nationality”, tells Vahid Mortezaei, a 36-year old food designer. “I remember several conversations which ended immediately once I reveled that I am from Iran. The images people relate to our country are terrorism and nuclear weapons. And nobody wants to order catering from a terrorist”, he summarizes.<p><p>When the former U.S. President George W. Bush used the term \"axis of evil\" in his State of the Union Address on January 29, 2002, he put a label on the forehead of nearly 80 million people. The “Iranophobia” that echoed in the global media, constructed a discursive link between Iran, terrorism and nuclear weapons that still lives today.<p><p>Judging Iran through the terrorist lens leaves most things unseen. Iran is home to one of the world's oldest civilizations. Iranian literature is one of the world's oldest literature and Iran is the birthplace of many musical instruments. Iranian art has one of the richest art heritages in world history. Persian carpets can be found from households around the globe.<p><p>The recent nuclear agreement and the consequent lifting of the sanctions that have colored the lives of millions of Iranians through decades bring relief to the daily lives of Iranians in Iran, but millions of Iranians still live abroad. Many of them try to escape the negative image related to their national identity by introducing themselves as Persians -a term reflecting the greatness of the Persian empire.<p><p>According to the estimates, about 4-5 million Iranians live outside of their own country. The Statistics Finland’s report shows that in 2014 there were close to 7000 Iranians residing in Finland.<p><p>For Vahid Finland is the land of opportunities.<p><p>“I have done many things. In Iran, I worked as a mining engineer only to realize that it was not the way I wanted to spend my life. I decided to study graphic design, which took me first to Turkey and then brought me to Helsinki, Aalto University. In Finland I realized that as a visual communication designer I can change the image many people have of Iran.”<p><p>“In Iran we have a very rich cuisine, which is full of potential. I decided to combine my knowledge on design and my passion for food and turn this into a business. This is how Vahid Mortezaei Studio ky was born”, tells Vahid.<p><p>Vahid Mortezaei Studio ky is a food design company that brings traditional Persian tastes in contemporary forms to the Finnish market. The company provides catering services, facilitates culinary workshops, provides food design consultancies and produces delicacies. Sustainability and environmental consciousness are the core values of the company.<p><p>”I believe in the power of food as a tool for change. It can be used to promote environmental consciousness as well as social well-being and tolerance in the increasingly multicultural Finnish society”, explains Vahid.<p><p>The services provided by Vahid Mortezaei Studio ky are unique in the Finnish market. “The combination of traditional elements from the Iranian cuisine with a modern design has not been seen anywhere before. Developing the business needs creativity and good contacts. If there were more resources, we could carry out research on the customers' behavior in relation to the products. This could provide a platform for more product development and an opportunity for the business to grow more competitive in the market. If we had a professionally equipped kitchen, we would not have to say “no” to any of our catering clients. We recently launched a crowdfunding campaign for making this possible. The campaign carries the name of a traditional Iranian delicacy, ränginäk”.<p><p>The arctic circle has provided an opportunity to create a more positive image of Iran.<p><p>“Three years ago when I baked ränginäk for the first time for my Finnish colleagues, I could not imagine that it would become a turning point in my life. It has been by far the most popular product of our company and we have sold thousands of ränginäks in different occasions in Finland. Ränginäk has shown that building cultural bridges through food design is possible.”<p><p>“I have a dream. I want to make Iranian cuisine globally well-known”, Vahid states. Nearly 4000 kilometers away from Zanjan he is already on his way. <p><p>Milla Mäkinen Images: Alexander Popkov, Vahid Mortezaei<p><p>http://www.vahidmortezaei.com/<p>", "time": "2016-02-02T16:10:48+02:00", "type": "eat-and-drink"}
{"title": "Pastor – Peruvian cuisine meets ecological glamour", "url": "http://www.helsinkitimes.fi/eat-and-drink/13168-pastor-peruvian-cuisine-meets-ecological-glamour.html", "review": "", "content": "<p>Peruvian food with Asian influences, cocktails from teacups and a nightclub atmosphere – this restaurant not only provides excellent cuisine but also promotes both historical and ecological values.<p><p>Even the most callous restaurant reviewer and experienced culinarist in Helsinki would get excited about this: there is a Peruvian restaurant in town. Pastor on Erottajankatu has been renovated from the space previously known as Cuba! nightclub into a sophisticated and stylish diner, which seats 150 people. The atmosphere is almost posh, yet relaxed. In other words, one gets the fine dining experience and easy-going, professional but uncomplicated service all at once.<p><p>The multifaceted feel stretches also into the interior design: the overall image is light and clean, Northern-style and modern. Yet, as it turns out, second-hand has been a major driving force behind the designing of the place.<p><p>\"The chairs are old school chairs,\" restaurant manager Pekka Koiranen reveals. Taking a second look, I realise that, indeed, they do seem strangely familiar. The chair design, having formed an integral part of the schooling experience for numerous Finnish children, works perfectly with this concept, too. The second-hand theme is repeated also with the drink lists, which are tied inside old book covers.<p><p>Pastor Erottajankatu 4 00120 Helsinki tel 040 034 4700 www.pastorrestaurant.fi Mon: 17.00-23.00 Tue: 17.00-23.00 Wed: 17.00-23.00 Thu: 17.00-23.00 Fri: 17.00-03.00 Sat: 14.00-03.00 Sun: Closed<p><p>The bartender recommends me to try a cocktail. Having just told him that I like my cocktails quite fresh and zesty, the beautifully prepared drink, Zawinul chai, arrives, responding perfectly to the request. Containing lemongrass-infused vodka, jasmine, lime and ginger ale, the cocktail makes an interesting mixture of great tastes exactly to my liking. An additional fun factor is that it arrives in a traditional English-style teapot. As I sip my delicious cocktail from a rose-patterned tea cup, the restaurant manager tells me that besides wanting to do something distinctive with serving the cocktails, the second-hand thinking shines through here, too:<p><p>\"The tea pots and cups are all recycled and have been given a new life in Pastor.\"<p><p>I applaud the place silently for its green values. If someone still thinks that second-hand equals worn and scruffy, Pastor will prove you wrong. The general feel is very fresh and funky.<p><p>DJ beats in Finland's first unisex school<p><p>Leafing through the menu, one easily faces a difficulty in making the choice. Each dish sounds more exotic than the next: Nigiri, Atún, Anticuchos. Ingredients include chilli, lime, avocado, ginger and Peruvian asparagus, among others. The website summarises the idea behind the dishes on offer as follows:<p><p>\"Our inspiration comes from the Peruvian kitchen, where the food is really fresh and the flavours are strong and rich. The 'nikkei' tradition mixes the cuisine of Peru with East Asian ingredients; add to this a few Spanish influences and we came up with a unique mixture we really like.\"<p><p>Head chef Andrew Ayre has prepared the most popular dishes of Pastor for me to try. The starter is called Nikkei ceviche, a cold dish that combines whitefish, red onion, jalapeño chilli, yuzu and coconut tiger's milk. The plate is simply a piece of art. To the extent that you wouldn't want to lay your fork on it as you feel you'll ruin something precious. Following a moment's admiration, however, I tuck in. The flavours of Nikkei ceviche are very fine and delicate. The beautiful starter does exactly what it's supposed to: cuts the edge of my hunger but also sets the bar very high for the main course to follow.<p><p>The name Pastor raises some curiosity, as it does not clearly hint that the cuisine would originate from Peruvian and Asian cultures. The restaurant manager tells that behind the name lays a historical factor:<p><p>\"The first school for both boys and girls in Finland was founded by Pastor Broberg at the end of the 19th century, and it used to be in this very building. We liked the idea of having a name that signifies something.\"<p><p>The main course, Costillas de cerdo, arrives, containing long-braised pork ribs with tamarind glaze, Szechuan pepper and peanuts. And they are wonderful – my expectations are met with such ease. Tender and tasty, with the twist in flavour brought on by Asian herbs, these are some proper quality ribs. And they are plentiful – so plentiful that I seriously struggle in emptying my plate. However, for those with a big appetite, it is the perfect dish.<p><p>As I digest my meal, Koiranen tells more about the concept of Pastor.<p><p>\"The idea has been to create a combined restaurant-nightclub for the weekends. On Fridays and Saturdays, we are open until 3am. There's also a DJ playing. The bar is very well equipped: there are 200 different wines on offer and an extensive list of cocktails.\"<p><p>Positively buzzing<p><p>Although the restaurant business is currently being badly plagued by the poor economic situation, it seems that the troubles have not reached Pastor. Straight after opening, at 5 pm, the doors go constantly as customers keep flowing in.<p><p>\"Since opening in August, we have been fully booked pretty much constantly,\" Koiranen says.<p><p>\"Monday and Tuesday are a bit quieter but the rest of the week we are buzzing. Luckily, we have not been affected by the economic downturn here at all.\"<p><p>Another stylish plate arrives on our table in the form of a dessert called Blanco. This time, I have roasted white chocolate mousse, caramelized banana and toffee ice cream on my plate – another visually beautiful piece of art. I find it as the perfect ending to my meal: very sweet with different textural elements of crisp banana slices, soft mousse, biscuit crumble and edible flowers. At this point, I could have not asked for more. However, some people with a serious sweet tooth might find the dish a bit inadequate as it is rather small in size.<p><p>The day of the week I visited the place was Thursday. The restaurant was busy, service excellent, and atmosphere uplifting and glamorous. I get the feeling that Pastor would be at its absolute best during weekends – seems like the perfect place to start your night before going out clubbing. I'm already planning my next visit in the very near future.<p><p>Text &amp; images: Mari Storpellinen Helsinki Times<p>", "time": "2015-01-15T16:50:23+02:00", "type": "eat-and-drink"}
{"title": "An urban granny's ridiculous desserts", "url": "http://www.helsinkitimes.fi/eat-and-drink/13126-an-urban-granny-s-ridiculous-desserts.html", "review": "", "content": "<p>Recipes from a little, black, metaphorical book.<p><p>FAMU is an urban granny who has travelled around the world and throughout her travels has collected recipes in to her little black leather bound recipe book. When she gets home to cook the food from that notebook, however, she doesn't remember exactly what the food looked like and how it was when she ate it. So the end result of her cooking is a dish that has elements and ingredients and main flavours of a classical dish, but may look different.<p><p>This is the concept behind the à la carte restaurant Famu &amp; Bar, according to head chef Antti Isoniemelä, whom I sit down with just after lunch time. With the capacity to seat 380 people, the seating area is certainly spacious.<p><p>Famu &amp; Bar opened on 5 August, making it the third restaurant to open in the Scandic Park hotel in 2014. The hotel has undergone renovations for the last two years, and Famu is the first restaurant to open in the fully renovated kitchen and restaurant area of the hotel.<p><p>Who is the urban granny?<p><p>Isoniemelä tells me that he and his team had an empty canvas to begin the business idea. They wanted to do something unique.<p><p>\"We had a vision from our grandparents, but the grandparents who live in downtown Töölö,\" says Isoniemelä.<p><p>'Famu' is short for farmor, and means father's mother in Swedish. Isoniemelä tells me they used the Swedish name because the Töölö area is known for being bilingual, the older generation in particular.<p><p>The granny-inspired theme is not only evident from the recipes from Famu's little black book, but details in the décor. Above a long table hang shiny brass pots and pans, and scattered around the hall are stuffed animals reminiscent of a hunter's den. The plates that the food is served on are something your granny might have at home. Yet this is the dining room of an urban granny, and a modern theme is also heavily present – the hall as a whole is presented in a clean, simple Nordic style.<p><p>I wonder if they have had many urban grannies involved in the project, and Isoniemelä responds with a laugh.<p><p>\"We love our own grannies, but no grannies were involved except in the past. We've only had the cooking of our own grannies to inspire us.\"<p><p>A meal dressed in smart casual<p><p>\"It's classic food in different clothing,\" Isoniemelä sums up the restaurant's culinary theme. The classic dishes they use as a base for their menu items originate from Europe – mostly Scandinavia – and include traditional Finnish dishes and inspiration from Russia and the US. They also have had dishes from the Mediterranean and the Middle East.<p><p>\"It's not classic Finnish boring grey and yellow food,\" Isoniemelä says. \"It might be bouillabaisse which granny has eaten on her trip to Nice. It can be a burger. Nowadays people like to overcook everything and name it as pulled, so we have a burger which is made from pulled reindeer.\" The chefs, he says, are playful, and don't necessarily follow gastronomic laws strictly.<p><p>\"And our desserts are ridiculous,\" adds Isoniemelä.<p><p>They also use modern technology to construct their dishes and add modernity to them. Isoniemelä describes their overall style as smart casual, with a rustic element distinguishing them from fine dining. Everything is also made on site. Isoniemelä compares it to a small independent restaurant, saying that they use natural products and shop organic and local when they can.<p><p>Famu &amp; Bar Mannerheimintie 46 00260 Helsinki Lunch Mon-Fri 11.00-17.00 Dinner Mon-Sat 17.00-24.00 (kitchen closes at 23.30) Sun 18.00-22.00 tel. 050 402 7337<p><p>Save space for a ridiculous dessert<p><p>For the starter I try a modern version of granny's steak tartare (€11.50). A knuckle-sized mound of raw organic Finnish beef rests on top of pickled beetroot; the meal also has fried capers and salt pickles. On top of the meat sits an egg yolk which has been cooked to 64.7 degrees Celcius in a water bath. The smooth egg yolk and the seasoned steak tartare are an excellent combination. For the main I taste their grilled pikeperch with scallops, shrimps and mussels in bouillabaisse sauce (€25.50).<p><p>The dessert was a baked Alaska (€8.50) – and was, as promised, ridiculous. The sheer amount of dessert in front of me would have sufficed for the entire meal. The Alaska is a hearty portion filling an entire soup bowl to the brim with cookies, forest berry jam, ice cream and creamy meringue, the top of which was lightly roasted. Keep in mind that you'll have to save space in your stomach if you want to finish it!<p><p>Despite its theme, the main audience of Famu &amp; Bar is not grannies. They have attracted locals, their target being 30-40 year old 'restaurant heavy users', who have happily praised the curiosities found in granny's little black book. It's certainly the first of its kind, and promises a great treat for dessert.<p><p>Alicia Jensen Helsinki Times<p>", "time": "2015-01-09T14:33:16+02:00", "type": "eat-and-drink"}
{"title": "Developing a taste for tapas", "url": "http://www.helsinkitimes.fi/eat-and-drink/13085-developing-a-taste-for-tapas.html", "review": "", "content": "<p>Modern tapas restaurant launches quietly in Helsinki.<p><p>\"HOLA!\"<p><p>The waitress greets each customer who steps through the door of Mercat. It is a windy, finger-numbing cold outside but inside it is an easy Mediterranean evening: the combination of warmth, foodies of all ages chatting energetically, and a dash of turquoise on the walls is reminiscent of Southern Europe, a vibrant restaurant by the ocean. The warmth and Southern European vibe beckons the desire for a smooth glass of wine, the cold outside just about forgotten.<p><p>I arrive for the interview earlier that day. I follow owner Manu Torchio down the hall, past the turquoise walls, the bar to my right and tables for two to the left, past a somewhat overly jovial Spanish man with a pan painted on the wall and into a smaller room with just one table.<p><p>Torchio introduces this as the 'chef table'. The room has an aquarium. Yet rather than opting for a live show of fish, this restaurant decided to give its customers a circus of chefs: one-third of one wall is a window into the kitchen. An excellent upgrade from the open kitchens we are familiar with, you can almost touch the 'modern'.<p><p>Into the Spanish kitchen<p><p>Mercat is not Torchio's first project. He also owns Patrona, the popular semi-fine dining Mexican restaurant, and the Mexican street food takeaway joint Cholo. He co-owns the restaurants with his girlfriend and her parents. They also have a taco truck Tacobot that operates in the summertime.<p><p>Torchio is a chef, businessman, designer, builder, and father. He has designed and built the restaurant himself, with the help of his girlfriend's father. But from his tattooed arms to the way he speaks about the 'décor' and how a plate should look, it becomes clear that he is first and foremost an artist. At Mercat he uses this skill to draw together traditional Spanish food and modernity.<p><p>The restaurant's namesake means 'market' in Catalan, paying tribute to the Catalonian and Basque flavours they use, and Torchio's years spent working in Barcelona and Giorna.<p><p>A 101 of tapas<p><p>The universal notion of tapas is that it is a portion of food; a plate with olives, a plate with Manchego. Simple.<p><p>\"That's really boring. No decoration, plain as that,\" comments Torchio, \"Spanish tapas are the same flavours all the time.\"<p><p>The idea of Mercat is to bring something else. Something a little finer, with a modern touch. To Torchio, that modern touch means taking flavours from around the world, and making it Spanish by using the Spanish tapas as a base. Basic plates; different flavours.<p><p>\"We play with Asian, Mediterranean and Mexican flavours, and do the preparation in a better way. We add some deco so it looks a little bit finer. We play a lot with colours. You see it and you think wow, I want to eat that.\" All the recipes come from Torchio's imagination, inspired by the time he spent in Spain and, of course, with some Latin influence.<p><p>He also wants the food to be of high quality. Everything at Mercat is made on site, and a lot of products are free range and from organic farming.<p><p>Torchio was inspired to bring new concepts to Helsinki since he moved to Finland six and a half years ago. In his opinion, there was a lot missing in the culinary scene.<p><p>\"This was the most boring place on the planet.\"<p><p>But project Mercat wasn't just about the food. \"It's the whole concept,\" he says. He points to the bar, which he says adds authenticity to their tapas style. He points to the Chef Table.<p><p>\"We have an awesome charcoal oven, it gives a really good flavour,\" he adds.<p><p>A slow start<p><p>Despite Torchio's relaxed demeanour, the restaurant didn't have the smoothest of beginnings. The restaurant opened in November with barely a whisper.<p><p>\"We started a little bit with the wrong leg,\" says Torchio. They took too long to open; people were waiting for the place to open for months, and once it finally did, it did so quietly. People are only slowly discovering it.<p><p>Another challenge was finding the right staff. Torchio says he first hired a fine dining team, but the portions had been too small to justify the prices, a critique mentioned in earlier reviews.<p><p>\"Of course if you pay 8 euros and you have one pea, it's like 'what the hell?!' you know. Even if the flavour is amazing people don't want to pay that.\"<p><p>So Torchio took back the kitchen, and a new team who he's sure will follow his line. Since then, he says, they've gotten much more positive comments on TripAdvisor and TableOnline.<p><p>The flavours<p><p>Testament to this, when I return for dinner later that day the place is bubbling like a freshly opened bottle of Cava. I was expecting a quiet evening; a few passers-by feeling adventurous. Instead, by 9 pm every table is full.<p><p>I tried four tapas that arrived from the kitchen one by one until I had a meal in front of me. First were crunchy pork cracklings with strong pineapple flavoured syrup on the side. Next a plate of ham, but beyond the beautiful way the thin flakes rested coiled on the wooden slate there was nothing particularly new about the dish. It did, however, come with three slices of bread with a delicious, garlic and tomato paste. Third came peppers, and the last addition to my now very colourful setting was paella.<p><p>The paella was so smooth. The mussels were soft and tasted like the ocean they came from, bringing the dish back to the Spanish palate. If you want something different come here for the paella, a glass of the fresh Spanish white Frank Massard Herbis Verdejo 2013 for example, and the ambiance.<p><p>I finished my tapas at a leisurely pace, and upon leaving, the restaurant has significantly quietened down. A few tables still hold customers enjoying their last glass of wine, not yet willing to face the cold reality outside and happy to stay in this Mediterranean corner for a while longer.<p><p>Text &amp; images: Alicia Jensen Helsinki Times<p>", "time": "2014-12-20T11:03:10+02:00", "type": "eat-and-drink"}
{"title": "Trio makes global waves", "url": "http://www.helsinkitimes.fi/eat-and-drink/13014-trio-makes-global-waves.html", "review": "", "content": "<p>An ambitious start for this new international restaurant in Kallio.<p><p>In Latin America, onda is a wave, or a vibe. It is turquoise water awoken by a lazy warm afternoon wind, its surface the pinks and purples of the sunset, its composed movement reaching for white sand. Like a wave, a good vibe has the ability to defy the confines of time and allow a moment to last. In Helsinki, onda is a spacious room. Its walls and windows stretch high, a buffet table sits at its centre and its tables are dressed in tablecloths woven in shades of pomegranate, mandarin and avocado. Candles burn slowly in dark bottles and music is trumped by talk.<p><p>The restaurant is owned by three friends, Peter Schneider, Jussi Koski, and Maija Talas. A relatively young trio for having opened their own restaurant, they are all born between 1983 and 1985. Their youth may be a factor in the restaurant's easy-going atmosphere. It may also explain the eager culinary experimentation Onda has seen so far. When we sit down with Schneider, the restaurant had just celebrated its eighth week.<p><p>Onda's beginning came with Line Café's end. Talas had been working at the declining café, when the owners, knowing her boyfriend Koski was a chef, suggested that they start their own restaurant. Why not, they thought. They called Schneider knowing he had also dreamt of opening his own restaurant, and thus began project Onda.<p><p>The restaurant's swift start has in part been a community effort. From building the couch to painting the walls, Schneider says they have a lot to thank their friends for.<p><p>Koski and Schneider had attended chef school in Peru in 2008, and have worked in the same kitchen for a number of years. They agreed on flavours and how things should look. Koski and Talas have travelled a lot as well. So, what do they want to bring to the culinary scene in Helsinki? In short: good food.<p><p>From Turkey to Peru<p><p>Their website states that the theme of the restaurant is 'international', so I ask Schneider to explain this ambiguous description a little bit more. He tells me that they have flavours they like from around the world, and combine them on one plate. Rather than going with original recipes, they create their own. Everything is also handmade, he tells me.<p><p>\"The menus have a little bit of Turkish style, a little bit from South America, and a little bit from Asia,\" Schneider says. \"We take a lot from the places we've been.\"<p><p>He tells me the major influences are mostly from Peru, because the Peruvian cuisine is vast, a blend of cultures. So, why not stick to Peruvian style, I wonder.<p><p>\"Because then people would come and say, 'no, this is not Peruvian style',\" laughs Schneider. He adds, \"We don't want to be exactly one thing.\"<p><p>They do have a Peruvian Saturday brunch, however, showing their respect to the varied cuisine. Other culinary inspirations come from Syria and Turkey, Schneider himself having lived in Istanbul for a few months. A Syrian friend helps them with the Syrian cuisine. Adding to the global mix, Schneider and Koski also took a Thai food course together when they were in Peru, which is also a clear staple in their 'international' palate, with lemongrass, coriander and fish sauce.<p><p>\"International. That's the deal. We want freedom,\" concludes Schnedier.<p><p>In the future they want to introduce the internationality to their brunches. They'll invite their Syrian friend to hold a Syrian brunch, and other chefs to introduce food from around the world.<p><p>Restaurant, art gallery, music hall<p><p>Not only is their food tricky to pin down, the trio wants to have that freedom over their space as well. They want to make their space a cultural locale. They have already begun with an art gallery, because the space was already perfect for it. It had the lighting and wall space. In addition, the trio knew a lot of artists who were looking for a place to exhibit their work.<p><p>They would also like to host a musical guest every Friday evening. People enjoy the food more when they listen to music, Schneider says. He is passionate about the connection between music and food.<p><p>\"The music is actually part of the food. When you make the food and you listen to a certain kind of music it makes you in the mood,\" says Schneider. \"We always listen to Turkish music and it evolves the food. When we listen to music we get the right spices.\"<p><p>They have seen a lot of happy customers over the few weeks they've been open. Schneider would like to attribute this both to the good food, music and the relaxed atmosphere. Their target audience, he tells me, is anyone who appreciates the food, music and mood.<p><p>At the moment, their concept is still evolving. Their current challenges are about developing their flavours, their art gallery and bringing music in to the restaurant. Schneider predicts that in the future, the challenges will be different, when their customer base grows. But given the state of the restaurant, the trio have a lot to be proud of already.<p><p>\"It's funny to do something on your own and people really like it,\" admits Schneider.<p><p>Onda Toinen linja 3 Open: 00530 Helsinki tel. 040 838 6638 Mon-Tue 11:00-18:00 Wed-Thu 11:00-20:00 Fri 11:00-22:00 Sat 11:30-16:00<p><p>A good onda<p><p>The atmosphere is relaxed yet energetic, and my plate is full of colours. One thing to note, however, is that it's not a place to find a calm quiet corner. The high ceiling, which has a high probability of being acoustically cooperative, amplifies chat from all corners.<p><p>The buffet (9.70 euros) had a variety of food: lamb taghine, Caribbean black eye stew (vegetarian, no milk, no gluten), rice, garlic spinach quinoa (vegan), marinated red cabbage (vegan), southern fruits, apple lentils (vegan), smoked rice (vegan) and kim chi (vegan).<p><p>Bueno onda means good luck or karma, and it appears that is something this restaurant has certainly enjoyed. The name was chosen so as not to be attributable to any language, holding true to their international 'rule'.<p><p>\"And we have four windows here at Onda,\" Schneider laughs.<p><p>Text &amp; images: Alicia Jensen Helsinki Times<p>", "time": "2014-12-14T09:02:43+02:00", "type": "eat-and-drink"}
{"title": "Hot dogs and champagne", "url": "http://www.helsinkitimes.fi/eat-and-drink/12954-hot-dogs-and-champagne.html", "review": "", "content": "<p>Street food meets fine dining in Helsinki.<p><p>IT'S DINNERTIME. Customers step through a heavy door, and descend a small set of stairs to enter the basement like interior of Kaartin Hodari &amp; Hummeri (or \"Hotdogs &amp; Lobster\"). Before them is a scene seldom found in Helsinki: wearing hoodies, the youth stand in line to the right, waiting for hot dogs to take away. At a table to the left, in trousers and blazers, twenty-somethings munch on parmesan and truffle fries. At another table, a couple enjoy a glass of champagne while they wait for lobster. Yet at Hodari &amp; Hummeri, this happy melange is a regular evening.<p><p>The restaurant, situated on Pieni Roobertinkatu 2, opened its doors in mid February this year. It is owned by Timo \"Lintsi\" Linnamäki, Sami Angelov, and Henri Alén, celebrity chef who secured his seat in the Finnish culinary hall of fame following a canned tomato incident in January. Alén had tweeted his \"Mutti sauce\" recipe, based on Mutti branded canned tomatoes – emptying shelves of that brand across the city. The trio are no strangers to the restaurant scene – they also own restaurants Muru and Pastis.<p><p>Linnamäki describes the concept of Kaartin Hodari &amp; Hummeri as \"fast food in a new way\", using the best quality ingredients, and making everything from scratch – from the mayonnaise to the buns. After the preparation, assembling the dog is quick.<p><p>\"Everybody eats fast food sometimes\", Linnamäki says with a smile, \"but the thing is to make it proper.\"<p><p>How it all began<p><p>The idea of starting a hot dog restaurant came from Alén, after a holiday he spent in the USA. For their Finnish project, they decided to add a twist.<p><p>\"Street food is a growing trend in Finland. Everyone's doing hamburgers so why not a hot dog?\" says Linnamäki.<p><p>The unusual choice of adding lobster to the menu was simply because it sounded \"somehow funny\".<p><p>\"We wanted to testify that you can fill the bun almost with everything, it doesn't have to be only a sausage,\" says Linnamäki, pointing out that there is a nice contrast between the hot dog and the lobster, the latter being traditionally associated with fine dining. \"It doesn't have to be a Michelin star restaurant [to serve lobster]!\"<p><p>It started off as a crazy idea.<p><p>\"And it worked. I was quite sceptical before, because there is also sausage in the dog. And it works actually amazingly good. That made me believe in this idea that you can really be a little bit crazy with the dogs,\" says Linnamäki.<p><p>But not all their crazy ideas have worked.<p><p>\"We tried to make a mac and cheese dog. It sounds cool but it didn't work. It was messy and it didn't look good at all. It was a very good idea; there were many good things in that idea. [But the macaroni] was too heavy and fatty. No – forget it!\" he laughs.<p><p>Street food: what's the big idea?<p><p>The concept of street food is: easy to eat, quick and something that can be taken away. Linnamäki says it's a trend that's only recently come to Finland, with the whole food culture still young.<p><p>\"I think [street food] was the natural second step in gastronomy in Helsinki.\" The first step was the casual bistro scene, offering good food but also a relaxed atmosphere, such as their restaurant Muru.<p><p>\"Then came street food and street gastro which is one step lower again, and easier if you're in a hurry.\"<p><p>Linnamäki predicts the next step may be good ethnic cuisine, a sector which he says is still developing in Finland.<p><p>\"Fine dining is not necessarily dead but it's going to come again,\" he adds.<p><p>Their street food concept has been developed and inspired by travels, keeping up with trends and of course the imagination.<p><p>A fine dining chef's challenges<p><p>Starting a new restaurant – and a fast food one at that – has not come without its challenges for the fine dining trio.<p><p>\"We thought it would be easy and simple. We thought it's just a hot dog and it's simple to make – what do you need, one oven and something like that. But it wasn't.\"<p><p>The schedule was tight. They didn't know how to make the perfect sausage. They didn't know how to make a perfect bun – moist on the inside and not crispy. They didn't know how to go about packing a take away meal. Another challenge was finding a balance between the product and the price.<p><p>\"You have to keep the costs low and still use high quality products. People are not ready to pay too much.\"<p><p>Linnamäki compares their prices to Starbucks, where \"you pay 7 euros for a café latte. It's a cup of coffee; it's a cup of water with milk. When you compare it to a handmade hot dog, there's meat in it and everything.\"<p><p>The dog experience<p><p>In vogue at the moment is the hotdog with malted pork. If you want to give it a shot you'll have to hurry – their menu changes all the time. Another popular dish is the lobster dog, it's something different, and of course their namesake.<p><p>I tasted the baby lamb hotdog, which was delicious. In addition to the lamb sausage, it was filled with tsastiki, olives, feta cheese and red onion. All the flavours were present and although surprising in a hot dog setting, worked perfectly. I also had the parmesan fries – a perfect step up from classic fries. The food came quickly. This is indeed the modern version of the diner. I would happily be back, and even spend a longer time with a couple of champagne glasses between me and a friend in this charming joint.<p><p>Needless to say, I left happy as a clam – or should I say baby lamb.<p><p>Text and image: Alicia Jensen Helsinki Times<p>", "time": "2014-12-04T14:11:16+02:00", "type": "eat-and-drink"}
{"title": "Dinner in 40 minutes: golden chickpea and curried lamb pilaf", "url": "http://www.helsinkitimes.fi/eat-and-drink/12795-dinner-in-40-minutes-golden-chickpea-and-curried-lamb-pilaf.html", "review": "", "content": "<p>With this dish, we're in back-to-basics mode. What is a rice pilaf if not a pre-modern-era rice bowl? This preparation is hearty enough for main-course fare, with possible leftovers that taste swell at room temperature.<p><p>The caramelized tomatoes are a nice component and call for low-maintenance multitasking while the pilaf is cooking.<p><p>We cooked this in a wok, which made for easy additions and stirrings of ingredients.<p><p>Serve with a green salad.<p><p>Adapted from The Amazing World of Rice, With 150 Recipes for Pilafs, Paellas, Puddings and More, by Marie Simmons (William Morrow, 2003).<p><p>6 servings<p><p>Ingredients<p><p>• ¼ cup plus 2 tablespoons extra-virgin olive oil<p><p>• 6 small plum tomatoes (may substitute Kumato tomatoes)<p><p>• ½ teaspoon kosher salt, plus more as needed, freshly ground black pepper<p><p>• ½ medium onion<p><p>• 1 medium carrot, scrubbed well<p><p>• 1 medium clove garlic<p><p>• 425 grams canned, no-salt-added chickpeas, with their liquid<p><p>• water, ½ kg lean ground lamb<p><p>• 1½ cups medium-grain white rice<p><p>• ¼ cup dried currants<p><p>• 2 teaspoons Madras-style curry powder<p><p>• 1 teaspoon ground cumin, cilantro leaves, for garnish (optional).<p><p>Steps<p><p>• Heat ¼ cup of the oil in a large cast-iron skillet over medium heat.<p><p>• Cut the tomatoes in half lengthwise, arranging them cut side up in the skillet. Sprinkle them lightly with salt and a few grinds of pepper. Cook undisturbed for 10 to 15 minutes, until the tomato skins are blackened and blistered.<p><p>• Meanwhile, cut the onion and carrot into ½ cm dice. Mince the garlic. Drain and rinse the chickpeas, reserving their liquid in a large measuring cup; add enough water to yield a total of 3 cups.<p><p>• Heat the remaining 2 tablespoons of oil in a large saute pan or wok over medium-high heat. Once the oil shimmers, add the ground lamb in pinches, then add the chickpeas. Cook for about 10 minutes, stirring occasionally to break up any large clumps of meat, until the chickpeas are lightly browned and beginning to pop. (It's okay if the lamb is not quite cooked through at this point.)<p><p>• Carefully turn the tomatoes over in the skillet; season lightly with salt and pepper on the second side. Cook undisturbed for 5 to 8 minutes, until browned.<p><p>• Add the onion, carrot and garlic to the lamb-chickpea mixture; cook for about 3 minutes, stirring occasionally, then add the rice, currants, curry powder and cumin, stirring to incorporate.<p><p>• Pour the water-chickpea liquid into the lamb-rice mixture and add ½ teaspoon of salt. Bring to a boil, stir once, then reduce the heat to medium. Cover and cook for about 15 minutes or until the liquid is absorbed and the rice is tender. If the rice is still chewy by the time the liquid has been absorbed, add up to ½ cup more water. Taste, and add salt and pepper as needed.<p><p>• Transfer the pilaf to a deep serving platter or divide it among individual wide, shallow bowls. Spoon some tomatoes at the edges. Garnish with cilantro leaves (whole or torn), if using, and serve.<p><p>• Nutrition Per serving (without the tomatoes): 530 calories, 20 g protein, 58 g carbohydrates, 23 g fat, 8 g saturated fat, 55 mg cholesterol, 230 mg sodium, 4 g dietary fibre, 5 g sugar<p><p>Bonnie S. Benwick – The Washington Post Photo for The Washington Post by Deb Lindsey<p>", "time": "2014-11-22T14:36:13+02:00", "type": "eat-and-drink"}
{"title": "Expert: sugar added to baby food is no cause for concern", "url": "http://www.helsinkitimes.fi/eat-and-drink/12809-expert-sugar-added-to-baby-food-is-no-cause-for-concern.html", "review": "", "content": "<p>After widespread media reports in recent months on the harmful effects of sugar and fructose, many parents with small children have expressed concern over the high sugar content of some baby foods. Fructose added to the Finnish Piltti pureed fruit for small children sparked surprised and worried comments.<p><p>Should parents avoid giving their children baby foods that contain added fructose or fruit juices?<p><p>\"I don't consider this to be a real problem,\" says Arja Lyytikäinen, the secretary general of the National Nutrition Council.<p><p>\"Fructose is naturally found in fruit and berries. It doesn't matter whether the child gets it added to the food or directly from fruit.\"<p><p>Nestlé, the manufacturer of the Piltti range, says that fructose is added to baby food to sweeten the flavour, which becomes bitter during the heat treatment. Without the added fructose, children may easily find the taste unpalatable, particularly as fruit and berries are also naturally acidic in flavour.<p><p>\"It's part of our food culture to add very little sugar to dishes made of fruit and berries. I don't consider this a problem in regard to children,\" says Lyytikäinen, adding that children's food manufacturers have recently reduced the sugar content of their products and included sugar-free options in their selection.<p><p>The expert understands parents' concern over the extra sugar in baby food possibly influencing the development of the child's dietary preferences, as studies have shown that children who get used to sweet foods when small, continue to love sugary treats as teenagers.<p><p>Lyytikäinen says that the risk can be minimised by offering children a balanced diet, with sweet purees forming only part of it. She recommends also giving foods that are not sweet to get the child used to bitter flavours.<p><p>Basic introduction<p><p>From six months onwards, the child can be offered seasonal basic ingredients.<p><p>\"Now would be an ideal time to offer children Finnish apples and lingonberries.\"<p><p>Lyytikäinen recommends that parents crush lingonberries and mix them with porridge or serve them as finger food.<p><p>Lyytikäinen, who has led courses on babies' nutrition, explains that while one child may take an instant liking to lingonberries, it may bring a grimace on another child's face.<p><p>\"A grimace as an initial reaction does not mean that parents should not persevere as this is just the first response to the bitter taste. If the second try causes the same reaction, I would add a little sugar to the berries to see if this helps.\"<p><p>Food given to children is not only about nutrition, Lyytikäinen emphasises.<p><p>\"It's also about getting them to know the family's food culture. It's important that children have the opportunity to try different foods.<p><p>Parents may have their own habits and likings, but with a child you can venture into new worlds of flavour.\"<p><p>According to Lyytikäinen, people often regard it as important that children's diet is rich in certain foods.<p><p>\"But that does not have to be the yardstick of a good diet. You can make a smiley face of a few lingonberries on top of the porridge. The child will find it fun, while getting to know lingonberry as a flavour.\"<p><p>Johanna Tikkanen – HS Niina Woolley – HT © HELSINGIN SANOMAT Lehtikuva / Roni Rekomaa, / Marja Aurio<p>", "time": "2014-11-22T13:32:11+02:00", "type": "eat-and-drink"}
{"title": "Second home with disco balls and whiskey", "url": "http://www.helsinkitimes.fi/eat-and-drink/12745-second-home-with-disco-balls-and-whiskey.html", "review": "", "content": "<p>The provider of a public living room in Hakaniemi, restaurant-bar Café Talo has been going strong since 2009. The laid-back atmosphere, funky interior and friendly service guarantee a relaxing visit for anyone who appreciates quality in both their beverage and music.<p><p>I discovered Café Talo a couple of years ago. To me it was like a well-hidden secret – I had been living in the area for a while and had never noticed its existence. Situated along the busy Hämeentie where you would avoid walking as it's crowded with buses and other traffic, I had managed to miss this little gem.<p><p>As I first set my foot in, I instantly fell in love with the place. It looked like someone's home where a house party is just about to take place – plus there was a bar of the caliber most houses certainly don't have. I took a seat on a wooden box under a disco ball as my favourite music was playing in the background. It was wintertime, the soft candle light seen through the windows had lured me in from the darkness of the streets for some mulled wine. It felt like coming home, which was quite fitting as I now find out that the idea behind the place is, indeed, to create a home-like environment for the public. In an urban area scattered with studio flats and largely resided by single people, it has proved to be a popular concept.<p><p>\"We wanted the atmosphere to be welcoming, relaxed and cosy. The ideology behind the interior design is mix and match – to gain the perfect balance between disarray and organised. We were, indeed, aiming at creating a public living room,\" the restaurant manager of Café Talo Anne Salolahti says.<p><p>Varying the mood<p><p>As the seating spills on two separate floors, the place offers some variation to go with your mood: downstairs is perfect for those moments when you're feeling social, upstairs there's usually some quiet corner where you can work, read, or daydream –apart from the weekends, when the place is often pretty packed.<p><p>\"I have been working here since the opening in October 2009. The founders are long-term friends and had a lot of previous experience of the catering business. Originally, the kitchen was subcontracted but nowadays it's an essential part of Talo,\" Salolahti tells.<p><p>As I visit the place, the menu is just under some alterations. However, there are certain dishes guaranteed to remain on it:<p><p>\"Our most popular dishes are the burgers – whatever changes we make, the burgers have to stay.\"<p><p>Salolahti stresses that Café Talo is not solely about doing business.<p><p>\"The food here is made with love. Generally, the dishes are quite simple, the home-made feel is important in the kitchen, too. We use fresh ingredients and favour good, authentic tastes. For example, we've got a cheese plate on the menu at the moment, for which we get the ingredients from the Hakaniemi market hall opposite us.\"<p><p>Since the burgers are so loved here, Talo's open burger is my choice of dish to try, too. The meal contains organic steak, Cheddar cheese, celery seasoned with harissa, tomatoes, harissa remoulade, chilli paste, roast Serrano ham, and pickled cucumber all on top of a piece of toast. On the side come baked potato wedges with herbs and a cup of mayonnaise. Talo's open burger is clearly distinguishable from your usual burger meal – there's no greasy, heavy feel to it. Instead, it seems healthy: fresh, tasty, authentic. Yet it's very filling.<p><p>On a previous visit, I have tried the vegetarian burger, too. It's simply delicious – not something that those on a vegetarian diet will just have to settle with but seriously good food for anyone to try.<p><p>Café Talo Mon-Tue 14:00-midnight Wed-Fri 14:00-02:00 Sat 12:00-02:00 Sun 11:00-15:00 Hämeentie 2 B 00530 Helsinki tel: 010 8212 703 e-mail: This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak9edd8dc3131121ea849516af3fa68181').innerHTML = ''; var prefix = '&#109;a' + 'i&#108;' + '&#116;o'; var path = 'hr' + 'ef' + '='; var addy9edd8dc3131121ea849516af3fa68181 = '&#105;nf&#111;' + '&#64;'; addy9edd8dc3131121ea849516af3fa68181 = addy9edd8dc3131121ea849516af3fa68181 + 'c&#97;f&#101;t&#97;l&#111;' + '&#46;' + 'f&#105;'; var addy_text9edd8dc3131121ea849516af3fa68181 = '&#105;nf&#111;' + '&#64;' + 'c&#97;f&#101;t&#97;l&#111;' + '&#46;' + 'f&#105;';document.getElementById('cloak9edd8dc3131121ea849516af3fa68181').innerHTML += ''+addy_text9edd8dc3131121ea849516af3fa68181+'<\\/a>'; www.cafetalo.fi (also on Facebook)<p><p>Theatre and tunes<p><p>An essential part in creating the relaxed atmosphere of Café Talo is music. The tunes played could be described as slightly off the mainstream, yet easy on the ear. In my opinion, they form the perfect mixture of interesting up-to-date findings and old classics.<p><p>\"We encourage the staff to let their own personalities show while at work. Most of the music played here is chosen by the staff: they suggest records and we buy them. The idea is to try and avoid using playing lists,\" Salolahti says.<p><p>Although Café Talo has an atmosphere more likely to appeal to younger customers, Salolahti assures that there are no set definitions over for whom Café Talo is for.<p><p>\"Absolutely anyone is welcome. We've got a lot of regulars, and most of our customers are in their twenties or thirties. But we don't want anyone to think that they wouldn't fit in here for any reason. As we are situated right next to the comedy theatre Arena, it brings us customers who possibly would not enter a place like Café Talo otherwise. It's a nice addition to our clientele: many theatre-goers come here to have dinner or a drink before or after the show.\"<p><p>It's time for some coffee and pudding. As I tuck into my pleasantly zesty dessert, a frozen cheesecake with raspberries, blueberries, and raspberry melba, Salolahti fills me in on upcoming events at Café Talo.<p><p>\"Approximately once a month, there's a jazz night on a Monday. Improvisation theatre evenings are also in the pipeline. Other than that, there are usually no gigs. We don't want too much hassle here. A lot of people come here for the atmosphere, others for certain foods and drinks, so we feel like this is good as it is – a place to simply chill in.\"<p><p>What might come as a surprise for some visitors, Café Talo also has quite an extensive selection of whiskeys.<p><p>\"We have managed to impress many whiskey experts. Our beer and wine selections get also regularly updated based on the feedback from customers.\"<p><p>MARI STORPELLINEN Helsinki times<p>", "time": "2014-11-16T13:39:59+02:00", "type": "eat-and-drink"}
{"title": "Dinner in 25 minutes: Beef and pineapple red curry", "url": "http://www.helsinkitimes.fi/eat-and-drink/12746-dinner-in-25-minutes-beef-and-pineapple-red-curry.html", "review": "", "content": "<p>Curries seem just right for this time of year. This one has only a few ingredients to prep and tastes light, yet its flavours bring warmth. To keep things on schedule kitchenwise, we start with a container of fresh, peeled pineapple pieces, found in the refrigerated produce section.<p><p>We tested this with sirloin steak, which was called for in the original recipe, and filet mignon (beef tenderloin). The latter, a more expensive cut, remained tender through the brief boil, so we recommend it here.<p><p>Serve on its own, with a fresh fennel-and-parsley salad, or over soba noodles or steamed rice.<p><p>Adapted from One Pot: 120 (plus) Easy Meals From Your Skillet, Slow Cooker, Stockpot, and More, by the editors of Martha Stewart Living (Clarkson Potter, 2014).<p><p>4 servings<p><p>Ingredients<p><p>225 grams sting beans, ½ kg beef tenderloin (see headnote), 340 grams cut, fresh pineapple pieces (see headnote), 1 tablespoon vegetable oil, ¼ cup red curry paste, 1 cup unsweetened low-fat coconut milk, or more as needed, 1½ cups no-salt-added chicken broth, 1 to 2 teaspoons low-sodium soy sauce (optional). A few stems of basil leaves, for garnish.<p><p>Steps<p><p>• Trim the sting beans, then cut each one into 3 or 4 pieces; you can do this faster when you line up the beans in three or four groups. Trim off and discard visible fat from the meat, then cut the steak into very thin slices. Cut the pineapple pieces into smaller, 1 cm pieces.<p><p>• Heat the oil in a wok or large skillet over medium-high heat.<p><p>• Once the oil shimmers, add the curry paste and stir-fry for 30 seconds, until fragrant. Add the steak and stir-fry for about 2 minutes, stirring, until browned. The meat might not be cooked through at this point.<p><p>• Add the string beans and pineapple; stir-fry for about 1 minute. Stir in the cup of coconut milk and all of the broth; once the mixture comes to a boil, reduce the heat to medium and cook for 3 or 4 minutes, or just until the beans are crisp-tender. Taste, and season with the soy sauce, if using. If the mixture seems too spicy, stir in up to ½ cup more coconut milk.<p><p>• Divide among wide, shallow bowls. Tear basil leaves over each one, letting them fall into each portion. Serve right away.<p><p>Nutrition Per serving: 340 calories, 28 g protein, 20 g carbohydrates, 15 g fat, 6 g saturated fat, 75 mg cholesterol, 670 mg sodium, 4 g dietary fibre, 11 g sugar<p><p>Photo for The Washington Post by Deb Lindsey Ellie Krieger – The Washington Post<p>", "time": "2014-11-14T10:42:54+02:00", "type": "eat-and-drink"}
{"title": "To celebrate fall's fruit, here's an apple brown betty on the healthy side", "url": "http://www.helsinkitimes.fi/eat-and-drink/12677-to-celebrate-fall-s-fruit-here-s-an-apple-brown-betty-on-the-healthy-side.html", "review": "", "content": "<p>The brown betty is a cousin of the crisp, crumble and cobbler, all homey fruit dishes baked with some variation of a sweetened, flour-based topping. Their names can be confusing because they are often are interchanged, but their toppings officially define them, with crisps and crumbles having a streusel-like crust (crisps typically with rolled oats and crumbles without) and cobblers studded with biscuit dough. Brown bettys are topped, and often layered, with sweetened breadcrumbs or cracker crumbs, which makes them the simplest and most accessible of the bunch.<p><p>This brown betty involves briefly cooking fresh apples – skins left on for their rustic appeal and nutrition – in apple cider and an aromatic drizzle of pure maple syrup, vanilla extract and cinnamon. A handful of cranberries is tossed into the mix, along with just enough butter to add a modest layer of richness.<p><p>The slightly softened fruit is then sprinkled with a mixture of breadcrumbs – made, conveniently, from basic whole-wheat sandwich bread – and enriched with walnuts, brown sugar and a bit of butter and cinnamon.<p><p>After 30 minutes in the oven, what hits you first is the enticing, warm fragrance that fills your kitchen. Then there is the visual appeal of the crisp, golden-brown crust with the apple-cranberry mixture bubbling beneath it.<p><p>Its taste is a celebration of the seasonal fruit, in which the delicate sweetness of the apples and tart punch of the cranberries really shine through and are elevated to an apple-pie-like experience.<p><p>I like to serve the brown betty with a small scoop of vanilla frozen yogurt for dessert or, I confess, with a dollop of Greek yogurt for breakfast.<p><p>Apple cranberry brown betty (6 servings)<p><p>The topping, a mix of crumbs made from whole-grain sandwich bread, walnuts, brown sugar and cinnamon, bakes up crisp and golden brown, turning the seasonal fruit, easily and healthily, into an apple pie-like experience.<p><p>Serve warm with a scoop of vanilla frozen yogurt.<p><p>From registered nutritionist and cookbook author Ellie Krieger.<p><p>Ingredients<p><p>2 slices wholewheat sandwich bread, 2 tablespoons unsalted butter, melted, 3 tablespoons chopped walnuts, 2 tablespoons dark brown sugar, 1 teaspoon ground cinnamon, 2 pinches salt, 4 large (unpeeled) Golden Delicious apples, cored and cut into 1/2 cm-thick slices, 1/4 cup pure maple syrup, 1/3 cup unsweetened apple cider, 1 teaspoon vanilla extract, 1 cup fresh cranberries<p><p>Steps<p><p>• Preheat the oven to 175 degrees. Have a 20-cm pie plate or ceramic baking dish at hand.<p><p>• Tear the bread into pieces (crusts included), letting them fall into a food processor. Pulse for about 15 seconds or until the pieces are reduced to crumbs. The yield should be about 2 cups. Transfer to a medium bowl along with 1 tablespoon of the melted butter, the walnuts, brown sugar, ½ teaspoon of the cinnamon and a pinch of salt; toss to incorporate.<p><p>• Combine the apple slices, maple syrup, apple cider, vanilla extract and the remaining ½ teaspoon of cinnamon and pinch of salt in a large saucepan over medium-high heat. Cook, stirring occasionally, until the apples are tender but still retain their shape, about 5 minutes. Stir in the cranberries and the remaining tablespoon of melted butter. Transfer the apple mixture to the pie plate or dish.<p><p>• Scatter the breadcrumb mixture over the apples. Bake for 30 minutes or until the topping is crisped and lightly browned. Allow to cool for 10 minutes before serving.<p><p>Nutrition per serving: 220 calories, 2 g protein, 40 g carbohydrates, 7 g fat, 3 g saturated fat, 10 mg cholesterol, 150 mg sodium, 5 g dietary fibre, 29 g sugar<p><p>Krieger's most recent cookbook is Weeknight Wonders: Delicious Healthy Dinners in 30 Minutes or Less (Houghton Mifflin Harcourt, 2013). She blogs and offers a weekly newsletter at www.elliekrieger.com.<p><p>Photo for The Washington Post by Deb Lindsey Ellie Krieger – The Washington Post<p>", "time": "2014-11-09T14:33:11+02:00", "type": "eat-and-drink"}
{"title": "Tastes on top of a hill", "url": "http://www.helsinkitimes.fi/eat-and-drink/12676-tastes-on-top-of-a-hill.html", "review": "", "content": "<p>Wholesome menu and stylish surrounds in Kallio.<p><p>It's long been known that Kallio is the coolest corner of Helsinki, not because of the height of its hills, but because it has traditionally afforded the cheapest private housing within a kilometre of the main railway station. For years it boasted the cheapest beer in Helsinki, along with the highest density of second-hand shops, hip bars and sundry alternative shops. As residents become more selective it's also increasingly a home to more upmarket businesses.<p><p>Originally a video shop, the restaurant Bergga, its name inspired by its location, on one side of the park that is 'the heart of Kallio'; Karhupuisto (Bear Park) – named Bergga in Swedish. It offers quality lunches from 11 am to 3 pm, and assorted snacks and drinks from 10 am to 10 pm, and Sundays until 8 pm. The restaurant sits atop the long cobbled slope of Porthaninkatu up from Toinen Linja just behind Hakaniementori.<p><p>Views from The Hill<p><p>Four trams (1, 2, 3 and 9) run in front of the cafe, almost touchable through the glass windows. The windows are so large that even the tables at the back have a good view of the petanque players or the Russian bear on its plinth.<p><p>The decor is functional, industrial-chic I was told, but stylish with the drinks displayed on a blackboard beside the bar. Don't be confused by its second section, hidden just round the corner, where the wines are listed!<p><p>Lunch cook Emma Wistrand serves a choice of three main courses on weekdays, ranging from Pike Fishcakes to Spinach Soup. One of them is always a veggie dish. \"Everything is produced with my cutting knife and ladles – there are no ready-prepared plastic bags in my kitchen,\" says Wistrand.<p><p>Bergga Open: Mon-Fri: 7:30-22:00 Sat: 10:00-22:00 Sun: 10:00-20:00 tel. 044 988 6119 044 060 0122 Viides linja 14 00530 Helsinki<p><p>Baker Lloyd Polack is often on hand to introduce you to his range of vegetarian snacks and tarts produced daily on the premises. He has been a familiar face on the Helsinki vegetarian food scene for longer than he cares to remember, but still he relishes teasing his customers' taste buds with his Caribbean-tinged food as much as their ears with his Birmingham humour.<p><p>The man behind the project is owner Jarkko Laitinen, who has now been in business on these premises for nearly 10 years, having started with the video shop in 2005. Turning the place into an eatery required a total rebuild, giving him the chance to redesign the café, starting from the sewage system and finishing at the spice racks. He had originally intended a lighter menu, with the selection displayed in the glass vitrine. But the ample kitchen gave rise to a broader lunchtime concept which kicked off after the opening in June this year, making the middle of the day their busiest hour.<p><p>Food for all seasons<p><p>Since then the customer base has built up from local passersby to diners from all around. The park area hosts a variety of restaurants, from a traditional Chinese to a rainbow cafe. But Bergga is alone in providing a wholesome modern menu with a decidedly stylish environment. With its young staff it is determined to offer a varied and reliable eating experience, tailored to its customers as much as to the season. Let's see what they come up with through the dark winter days ahead.<p><p>TONY SHAW HELSINKI TIMES Image: Bergga<p>", "time": "2014-11-08T14:28:22+02:00", "type": "eat-and-drink"}
{"title": "Appetite grows for sushi in Finland", "url": "http://www.helsinkitimes.fi/eat-and-drink/12423-appetite-grows-for-sushi-in-finland-2.html", "review": "", "content": "<p>Finland's culinary scene has only recently diversified and Hanko Sushi has confidently ridden that wave of expansion. Co-founder Mika Laakio fell in love with sushi many years ago, having lived six years in Japan. He had been ready to steer the sushi ship to Helsinki in 1995, but explained that \"when I moved back, Finland wasn't ready.\"<p><p>Back then, sushi was still a luxury. For it to appeal to everyone, Laakio felt sushi still needed time.<p><p>Laakio and his partner decided to test the waters in 2008 in Hanko. \"It was just kind of a good idea, it's a great summer city,\" Laakio recalls. \"We wanted to test how it goes, so we can produce something that people like. And sure enough we did!\" And so began the story of Hanko Sushi.<p><p>Collaboration with celebrity chef<p><p>Future of sushi in Finland<p><p>After the interview with Laakio took place, the fifteen Hanko Sushi restaurants were sold to Royal Restaurants in early September. Laakio comments that he and his colleague are happy with the deal. They have both been made shareholders at Royal Restaurants, and will be working to develop new concepts for the enterprise. Their next projects are focussed on expansion and will also have an international scope.<p><p>Now Hanko Sushi has grown from a small shop in Hanko to having over 15 restaurants around Finland, chiefly in Helsinki. Such is their authenticity that they recently collaborated with Japanese celebrity chef Hiromitsu Nozaki when he visited Finland in August.<p><p>Hanko Sushi used the acclaimed chef's recipe and design to create a number of lunchboxes that were produced by their head chefs. The lunchbox included not only sushi, but rice seasoned differently and mixed with different flavours that resembled risotto, but with vegetables and seasoning. This mix of Japanese kitchen and sushi created a perfect opportunity for Hanko Sushi to gauge the public's reaction to other types of Japanese cuisine.<p><p>\"This is kind of a start that we can have more events or cultural exchange with Japan,\" says Laakio. \"In March, one of our chefs went to Japan for three weeks to learn. He went to a chef school and went to meet special knife sharpeners.\" Meeting Nozaki was a great opportunity to continue a cultural exchange, and also to learn from him.<p><p>“I have to say we’re students,” Laakio says. “We’re listening and were humble for his ideas. He has such a strong experience – he’s a sensei, a teacher, so we want to maybe learn the world of thought of good, perfect food and its presentation – you eat it also with your eyes.”<p><p>...<p><p>Alicia Jensen HELSINKI TIMES Image: Tuukka Ervasti<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-10-16T10:48:14+03:00", "type": "eat-and-drink"}
{"title": "A touch of Italian simplicity in the heart of Eira", "url": "http://www.helsinkitimes.fi/eat-and-drink/12239-a-touch-of-italian-simplicity-in-the-heart-of-eira-2.html", "review": "", "content": "<p>Taste the home-style trattoria.<p><p>The 40-seat Italian Restaurant Il Bucatino has held its place in the heart of the Eira district for two-and-a-half years, offering robust servings of simple but authentic Italian food. Upon my visit, the owners – Gino and Italo – made sure that I had a tasteful and highly relaxing dining experience.<p><p>The setting is clean and open, with large windows maximising natural light, allowing the diner to clearly see what is served. The owners aimed to create a trattoria setting, replicative of the home-style Italian restaurants in which hungry workers seek hearty food in lavish portions, but with the dishes and services more cured.<p><p>Yet unlike the stereotypical Italian joint, the layout of the Helsinki restaurant is clean and tidy, with white tablecloths and white walls that keep any daytime visitor awake. In the evening, catering to the requests of Finnish customers, the candles at each table create an earnest, relaxed atmosphere.<p><p>True to their efforts, the food at Il Bucatino is simple and good. The dish with which I began – Caprese – was an excellent example of the simplicity of authentic Italian food. The dish was a simple combination of milky soft Buffalo mozarella, pressed between slices of fresh tomato, and seasoned with a light sting of black pepper.<p><p>Favourite to follow up<p><p>The second dish, Vitello Tonato, was my favourite of the evening. The dish would appeal to the palate of any Finnish diner due to the simplicity of its its taste. The dish boasted sheets of veal, glazed in a creamy sauce with just enough tang of warm tuna. A soft and natural saltiness came from the anchovies blended into the sauce.<p><p>The night at Il Bucatino was slightly marred by the saltiness of the Rigatoni Con Gorgonzola E Radicchio, a new pasta which will be available to customers after the new menu is confirmed. In all other aspects, this dish of Rigatoni pasta, gorgonzola blue cheese, parmesan and red salad was otherwise well crafted, and boasted a particularly good blend of cheese.<p><p>On a general level, I was impressed by the creativity and authenticity invested in the menu. Italo explained to me that the dishes – like the owners – came from diverse range of regions in Italy. For instance, he explained, Caprese originates in the Capri/Naples landscape, while Vitello Tonato originates in the regions further north. I concluded that the restaurant was moulded by a strong touch of home.<p><p>Furthermore, Il Bucatino was careful to add in Italian staples such as excellent fresh in-house baked bread. In true Italian fashion, this white bread served as a delicious edible sponge for any remaining sauce on my plate.<p><p>Similarly, Italians are drawn to a particular blend of music, which was also evidenced during my visit. An Italian musician occasionally performs at Il Bucatino, and when this luxury is unavailable, the staff plays an Italian radio channel spanning all genres and ages – from Pausini to Bocelli to Baglioni.<p><p>Much of the food used by Il Bucatino is directly imported from Italy through Casa Gusto, an import firm owned by Italo. These imports include pasta, flour, cheeses, wines, hams and salamis. The products are also sold directly to stores in the S and K groups.<p><p>It also felt like a good idea to ask a regular. Sandra Benko praised Il Bucatino, finding that the menu offers a \"tour of Italy\". She has found the restaurant to serve as an excellent place for entertaining business guests, as well as a place to have family meals.<p><p>Il Bucatino Open: Tue-Fri 16:00-23:00 Sat: 14:00-23:00 Sun, Mon: Closed Tehtaankatu 38 Helsinki tel. 046 600 1000<p><p>One of the notable differences between Il Bucatino and other Italian restaurants in Finland, Benko also noted, is that other restaurants prepare food 'geared to what was perceived to be the Finnish palate', while Il Bucatino strived to preserve Italian tradition.<p><p>...<p><p>Suvi Joensuu HELSINKI TIMES Photo: Alicia Jensen<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-10-02T14:32:00+03:00", "type": "eat-and-drink"}
