{"title": "Town in Southern Finland rolls out teen curfew scheme", "url": "http://www.helsinkitimes.fi/themes/themes/education/16090-town-in-southern-finland-rolls-out-teen-curfew-scheme.html", "review": "", "content": "<p>THE TOWN OF LAITILA IN SOUTHWEST FINLAND has announced that a curfew for school-age minors will be introduced in full, following months of consultation and media attention over the controversial policy.<p><p>The curfew has been described by members of the local government as “unofficial” and “informal”, meaning that although a curfew for young people will be in place, it is not legally enforceable. This is because it was determined that a curfew enforced by law and police action would lack legal grounds and possibly be in violation of human rights law. <p><p>The small town released its guidelines in full today, which stipulate that all children from grades 1-6, or aged 7 to 13, should not be outdoors after 19:30, while older teenagers should be home before 21:00.<p><p>The curfew was the result of months of consultation with parents and educational charities and organisations. The move follows similar successful attempts at enforcing youth curfews in Iceland, which has contributed to a dramatic decline in alcohol and drug abuse among young people.<p><p>Other areas in Finland have since attempted to replicate the so-called “Icelandic model” of child policing, although Laitila is the only town so far to secure approval for the scheme.<p><p>How the young people affected by the curfew will respond remains to be seen.<p><p> <p><p>Adam Oliver Smith – HT<p><p>Image: Lehtikuva<p>", "time": "2019-01-03T14:40:32+02:00", "type": "education"}
{"title": "Yidan Prize awarded to inventor of meta-analysis and edX founder", "url": "http://www.helsinkitimes.fi/themes/themes/education/16040-yidan-prize-for-education-awarded-to-inventor-of-meta-analysis-and-edx-founder.html", "review": "", "content": "<p> <p><p>THE 2018 YIDAN PRIZE was awarded to winners during a gala event followed by the Yidan Prize Summit in Hong Kong on the 10th of December. The Prize which was being awarded for the second year has been founded by Dr. Charles Chen Yidan in 2016. <p><p>This year’s winners are Professor Larry V. Hedges of Northwestern University and Professor Anant Agarwal of Harvard University and Massachusetts Institute of Technology (MIT). Larry Hedges is the Board of Trustees Professor of Statistics and Education and Social Policy, Professor of Psychology and Professor of Medical Social Sciences at the Northwestern University in Chicago.<p><p>He holds a PhD in Mathematical Methods in Educational Research from Stanford University. He was awarded the Yidan prize for his groundbreaking research on statistical methods in meta-analysis and research synthesis, which were conducted and published as early as 1985. The method has been widely used in not only education research but also all other fields of research such as medicine and economics.<p><p>“I was trained as a physicist and a mathematician, but I became interested in education as it was a life changing thing for me,” says Prof. Hedges. “I grew up near a small town in one of the poorest areas of California. Both of my parents worked in unskilled jobs; my father earned the minimum legal wage until his retirement. When I was a child, my family didn't even know anyone who went to college.”<p><p>Professor Morton Shapiro, the president of Northwestern University who nominated Hedges for the prize, introduced his colleague as a great mathematician who continued educating himself relentlessly. As for the importance of Prof. Hedges’ research he mentioned that scientists who have published research papers check their citations frequently, as the more a paper or result is cited, the more important it is: “In my filed in economic, if you get cited a 100 times you did something, if you are cited five hundred times you really did something, if you get cited a thousand times, that’s the definitive work of your carrier. His (Prof. Hedges’) work on meta-analysis has been cited 50 000 times.” Explaining what the meta-analysis means, Prof. Shapiro said: “What Larry figured out was that all of us when we do a study we have our different datasets and different statistical techniques, meta-analysis is to step back and do a study of studies.”<p><p>As an example of how the method changed the field of education research, Prof. Larry Hedges mentioned the classic case when numerous research papers had come to the same conclusion, that the amount of funding given to a school does not affect its outcome. When the studies were put under scrutiny using the meta-analysis method invented by Prof. Hedges, the result happened to be exactly the opposite, i.e. amount of funding is directly related to the outcome schools produce.<p><p>Prof. Anant Agarwal’s work, that got him the nomination and eventually the prize for education development, was the establishment of edX, a nonprofit, open source platform for online education. “Ed is for education and X is for whatever you could think of,” he explained the name. “Education is a right and everybody has to have access to it as the air we breathe, but you look around the world and you see that is not the case.” says Prof. Agarwal, “Digital technology is transforming everything, so what we decided to do is to apply digital technology and try to completely transform education around the world, and we did so by forming a non-profit called edX.”<p><p>EdX is a platform build by MIT and Harvard Universities with the aim of democratising education. Courses from the best universities in the world are provided on the platform for free for anyone to learn from any place in the world. The platform was established in 2012 and got 10,000 subscriptions in its first hour. The software of the platform, “Open edX” is also an open source, i.e. it is offered to the public for free. “So any of you who wants to launch a competitor platform, you are welcome to use our software and become a competitor,” says Prof. Agarwal. “Today there are 1800 educational platforms around the world that use our software. One example is the Chinese national platform, XuetangX, and that platform itself has 40 million learners.” EdX has grown to over 19 million learners form all around the wold and has more than 2400 courses online.<p><p>Despite its short history, the Yidan Prize deserves to be called “The Noble Prize in Education”. The prize is divided into two categories: The Yidan Prize for Education Research, which recognises outstanding research that contributes in significant ways to education, and the Yidan Prize for Education Development, which recognises innovative ideas that tackle important challenges in the field of education. Each Yidan Prize Laureate receives a gold medal and HK$30 million (around US$3.9 million) worth of awards, which include a cash prize of HK$15 million (around US$1.9 million) and a project fund of HK$15 million. The awarded sums are thus about 4 times larger than the Noble Prize and give the laureates an incentive to develop their projects further, and not to rest on their achievement, as is mostly in the case with the Nobel Prize.<p><p>Conditions for nomination and the selection process are strict. Nominees must have two letters of recommendation and published and peer-reviewed research to present. This year the prize committee received more than one thousand nominations. The final winners were selected by a judging committee chaired by Dr Koichiro Matsuura, former director-general of UNESCO, the Judging Committee comprises of two independent judging panels who screen all the valid nominations and select one candidate for each category. Mr Andreas Schleicher, OECD’s Director for the Directorate of Education and Skills, heads the judging panel for the Yidan Prize for Education Research, and Ms Dorothy K. Gordon, chair of the UNESCO Information For All programme, leads the panel for the Yidan Prize for Education Development. The panels consist of top gear experts in education from different universities and organisations around the world. The full list of judges can be found here.<p><p>Nominations for The Yidan Prize can come from government bodies, non-governmental organisations, professional associations and thought leaders, and only in exceptional cases from the nominees themselves. Basically, anyone can nominate a candidate through the nomination platform of the prize. Judging Committee members and Global Advisory Board members of the Yidan Prize are not eligible to make nominations or be nominated. In addition, nominators and supporters should not be family members of the nominee(s) or anyone who would possibly lead to a perceived, potential or actual conflict of interest. <p><p>“The education system for tomorrow needs to be more fair, more efficient and more inclusive. That is why we ask the question: How? How can we achieve better education outcomes? How do we ensure that education can be made to work for all? How should we leverage education research and put theory into practice? To answer these questions, we must learn from each other and act together.” said the founder of the prize, Dr. Charles Yidan in his opening remarks of the summit. Other keynote speakers included HRH Princess Laurentien of the Netherlands; and the former Prime Minister of UK, Gordon Brown, who now functions as UN Special Envoy for Global Education.<p><p>Dr. Charles Chen Yidan is the core founder of Tencent Group (腾讯), the largest and most popular internet portal group in Mainland China and a company well known for the widely used Wechat messaging platform and investing in some of the most profitable gaming and internet companies, among others the Finnish Supercell. After stepping down from the role of CAO of Tencent, he founded the Yidan Prize Foundation and by 2016 had donated US $45 million to charitable causes earning him the title of “China’s top philanthropist” on the Forbes list of Asia’s 2017 Heroes of Philanthropy.<p><p>Alexis Kouros - HT<p><p>Image: The Yidan Prize<p><p> <p>", "time": "2018-12-17T12:22:43+02:00", "type": "education"}
{"title": "Metropolia UAS top choice for international students", "url": "http://www.helsinkitimes.fi/themes/themes/education/16010-metropolia-uas-top-choice-for-international-students.html", "review": "", "content": "<p> <p><p>“This place can take you anywhere”: Four Students on Why They Chose Metropolia University of Applied Sciences.<p><p>WITH JOINT APPLICATIONS just around the corner, tens of thousands of people are now feverishly trawling through websites and brochures in an attempt to make the most important decision of their career. <p><p>This year, a record number of students will be entering bachelor’s, master’s, and doctoral education, including thousands of international students representing hundreds of countries. A majority of those students will be conducting their studies here in Helsinki, which is home to most of the top-ranked institutions in the country. <p><p>One of those institutions is the Metropolia University of Applied Sciences, established in 2008, the largest UAS in Finland, now boasting over 16,000 students, 1500 of them with international background, representing 90 nationalities. <p><p>We caught up with four students at the recent Studia fair at Messukeskus, to find out why they chose Metropolia, and what their experience has been so far. <p><p>Ben, Nursing, Second Year <p><p>Ben had been studying Public Health and Education in Sydney but decided to come back to his home country in order to “take advantage of the free, world-class education system”. He knew he wanted to continue training as a nurse to further his knowledge in Human Health.<p><p>On why he chose to study at Metropolia, Ben said “I’d heard such good things about it… it’s very multicultural and I like the fact that it provides a very hands-on learning experience”. As a Nursing student, Ben undertakes a 3-6 week work placement in a local hospital every semester, where he’s expected to put his theoretical knowledge to the test. <p><p>He describes his most recent placement, working in the operation room of Helsinki Surgical Hospital on breast cancer surgeries as “the best six weeks of my entire schooling career… it really felt like I was making a difference every day”. <p><p>He describes the teachers as the best aspect of Metropolia, stating that “no matter what you need, they’ll go above and beyond to help you”.<p><p>Elizabeth, Electrical and Automation Engineering, First Year <p><p>Elizabeth had previously enjoyed a career working in the metal industry in Peru, before making Finland her home four years ago. Her time in Finland taught her more about sustainability within the energy sector, which inspired her to take a change in direction with her career. <p><p>“I have a daughter, I want to leave a better world for her” is how Elizabeth responded when asked why she chose this degree. The programme allows students to make links with titans of Finnish industry, to find out how they’re working to make the world a more sustainable place. <p><p> <p><p>She says her experience so far has “totally opened my mind… it has helped me realise what I really want to do”. She hopes to launch her own career in helping companies find sustainable solutions, and believes this degree programme gives her the insight she needs to make that happen. <p><p>She says that juggling family life alongside a demanding course can be “challenging”, but that she’s had all the support she could ask for from the flexible and understanding staff. <p><p>“I’m really happy actually. I couldn’t be happier. This is the perfect programme for me”.<p><p>Scott, International Business and Logistics, Third Year <p><p>Scott never planned to start a career in international business but believes Metropolia has helped him find the right path. After several years spent travelling the world and working part-time, he was persuaded by some friends at the university to consider applying. <p><p>“My friends marketed this course to me really well. They said if you don’t know exactly what you want to do with your life, this place can point you in the right direction”. Now three years into the course, Scott says he’s never looked back. <p><p>“It kind of feels like going to the gym. When you’re doing all the work it can feel brutal, but when you’re done you feel amazing once you see what you’ve achieved”.<p><p>Scott has recently got back from his exchange placement at Sun Yat-Sen University in Guangzhou, China, one of the top universities in the country. <p><p>“I would never have gone to China, but now that I have, I know that’s where I see my future”. Scott describes the strong international element as one of the best aspects of the course; “you learn from a New Yorker about marketing, a Californian about finance, communications from a British lady – it’s a global learning experience”. <p><p>Scott will be embarking on a work placement in Kenya next spring, after which he wants to work abroad in marketing as part of a large corporation. <p><p>“This course builds your teamwork and group thinking skills – it makes you a collaborator”.<p><p>Sofia, European Business Administration, Second Year<p><p>Sofia wasn’t entirely sure where she wanted to study, only that she wanted to study business and one day “become a leader of something”. <p><p>When she’s not learning the ins and outs of the European business landscape, Sofia is working on real-world projects with classmates in order to build her skills and experience. “Just this week we launched a pitching competition event for students. It has been totally crazy… being able to build an event from scratch”. <p><p>Sofia will be going on her exchange as part of the programme next year, where she’ll either study in the UK or Germany. After that, she can choose to do a work placement anywhere in the world.<p><p>“This degree programme can take you anywhere in the world – that’s what I love about it”. <p><p>The joint application for Metropolia University of Applied Sciences opens 9 January and closes 23 January. International degree programmes are taught in English. Tuition is free for EU/EEA nationals, while non-EU/EEA nationals are subject to annual tuition fees. A scholarship for non-EU/EEA student can be granted based on a Finnish language level test completed during the academic year.<p><p>See the full range of degree programmes here. <p><p> <p><p>Adam Oliver Smith - HT<p><p>Photos: Metropolia<p>", "time": "2018-12-06T19:23:10+02:00", "type": "education"}
{"title": "“This is a Very Special Place”: Why International Students are Choosing to Study in Lapland ", "url": "http://www.helsinkitimes.fi/themes/themes/education/15945-this-is-a-very-special-place-why-international-students-are-choosing-to-study-in-lapland.html", "review": "", "content": "<p>As Finland redoubles its efforts to attract more international students, little attention has been paid to the far north of the country, where a small but rapidly-growing cohort of students from across the world are choosing to call this winter wonderland their home.<p><p>Lapland is home to the northernmost university of applied sciences in Europe, Lapin AMK, which teaches close to 6000 students at campuses in Rovaniemi, Tornio, and Kemi. Over 500 of those students now hail from outside of Finland, choosing Lapin AMK to study one of their English language degrees or as part of a study exchange program. <p><p>We spoke to students currently completing their degrees there to find out why they chose Lapland, and how the experience has shaped them. <p><p> <p><p>Orsi, a 21-year-old international business student from Hungary, says that choosing Lapin AMK was the best decision she’s ever made. After finding out about the course from a friend who she visited in Rovaniemi, she decided she wanted to experience Finland’s world-class education system first hand. <p><p><p><p>“Once I’d decided on Lapland, my family just couldn’t talk me out of it. The atmosphere here is great, it’s like high school at a university level. Classes are so small that all the teachers have time for you, and you tend to bond with your classmates quickly”. <p><p>Orsi says the best advantage of her course, which is taught entirely in English, is that it is so hands-on. Students work in real business environments and collaborate on real-world projects rather than spending time on essays and exams. As part of Lapin’s Arctic Youth Forum, she and her classmates have organized an event called the Arctic Business Network, which will draw businesspeople from across the region to Rovaniemi for a summit. <p><p>Her class consists of students from across Europe and beyond, all of whom enjoy an active social life thanks to the students’ union. Of the locals, she says that “Lappish people tend to be really open to internationals”, and that the relaxing pace of life is what she enjoys most. <p><p>“There is a surprisingly huge amount of opportunities here… I know I’ve made the right choice”. <p><p>Steven meanwhile, is a third-year nursing student from Vietnam, who came to Finland after a long career in finance, which he found unfulfilling. <p><p>He now studies practical nursing with classmates from the US, China, Kenya, the UK, Cameroon, and Hungary, and says the cultural exchange element has been one of the most rewarding aspects of the course, saying “you learn to bring out the best in each other”<p><p>Despite the severe weather, which frequently drops below -30⁰C in the winter, the environment is a major draw for Steven, who enjoys walking across the frozen sea near his home in Kemi to explore the islands.<p><p>The degree track is equally as hands-on, involving placements with hospitals across the region. While Steven has already secured post-study work as a practical nurse in Helsinki, he says the Finnish language requirements for the course have proven to be the biggest challenge, and that his Finnish is “still basic”. <p><p>The university offers language training for non-Finnish speakers, while the community college in Rovaniemi also offers courses throughout the year. <p><p>In terms of part-time work, the vast majority of international students work in Lapland’s booming tourism industry, as guides, shop assistants, waiters, translators, and hotel staff. The students we spoke to also expressed a strong desire to remain in Finland after graduation, either to continue their studies or to start their career here. <p><p>Katja Mattila, the officer for alumni relations at Lapin AMK, said that “this is a very unique place, as well as a beautiful area to study. Many of our students quickly fall in love with the area and want to stay here. It’s a true community where everybody knows everybody, and the teachers are highly approachable”. <p><p>There is a total of five English-language courses offered in Lapland AMK; International Business, Business Information Technology, Nursing, Tourism, and a Master’s Education in Business Administration (MBA). <p><p> <p><p>Tuition is free for EU/EEA nationals. Other nationals must pay tuition, but Lapland AMK has a very supportive scholarship system.<p><p>The next application period is the 9th-23rd January 2019. <p><p>https://www.lapinamk.fi/en<p>", "time": "2018-11-21T11:23:32+02:00", "type": "education"}
{"title": "Everything you should know about Montessori schools in Helsinki", "url": "http://www.helsinkitimes.fi/themes/themes/education/15920-helsinki-times-education-everything-you-should-know-about-montessori-schools-in-helsinki.html", "review": "", "content": "<p>Montessori schools are institutions that subscribe to the “Montessori method” of education, a progressive approach to children’s learning that has been in use for over a century. The method sees children as independent and intrinsically thirsty for knowledge, with its unconventional learning model being characterized by student autonomy, freedom of movement in the classroom, independent learning, and mixed-age classrooms. <p><p>There are now several Montessori schools across Helsinki that accommodate students from as young as a few months to up to 16 years old. These growing schools are becoming an increasingly popular option for the children of ex-pats in Helsinki as well as locals, due both to the innovative teaching methods and the fact that the language of instruction is typically in English. Fees for Montessori schools in Finland range from a €300-1200 a month, depending on subsidies.<p><p>We spoke to Eugenia Soland, founder and director of the Montessori Infant Community, one of the largest schools of its type in the city, to find out more. <p><p>The school was founded back in 2012 as a Montessori playgroup for toddlers and has since ballooned to accommodate 8 members of staff and 42 full-time students, aged between one and six years old. Soland is, naturally, a lifelong proponent of the Montessori method, and is actively engaged in training other teachers to implement this style of learning.<p><p>She claims that her school, which specializes in tailored learning environments designed to “satisfy [the child’s] natural curiosity and build a sense of confidence” is completely “unique in Finland”, being the only one to offer Montessori education for toddlers in English. The classrooms focus on “complex sensory and intellectual experiences” with a jam-packed program featuring gymnastics, music lessons, vocal play, dance and the teaching of “emotional skills”. Students are encouraged to explore and are generally free to move around the classroom as they wish. <p><p>The Montessori Infant Community currently is enjoying a wave of popularity, so much so that they are now considering opening a second “children’s house” to accommodate the growing numbers of students. Soland also says that the school has recently stopped all of their promotional and marketing activities and that most new enrolments come to them “through word of mouth”.<p><p>The growing popularity of such schools will seem unsurprising to those who are already aware of the studies undertaken on Montessori pupils, which show that they consistently outrank their peers across all subjects, from math to music. Much of the popularity of the Infant Community has been fueled by ex-pat families, with Soland describing a strong international element in the classroom. <p><p>However, they currently do not have any plans to expand further, as the value they place on “personal connections with the families” and an emphasis on making the school feel “cozy and home-like” requires small classrooms, run by a small number of teachers. <p><p>On being asked about the philosophy and motivations of the Montessori Infant Community, Eugenia replied “we firmly believe education should serve children socially, emotionally and intellectually. Education has a deep capacity to influence social change and the power to bring peace and prosperity to future generations”. <p><p>URL: http://www.infant-community.com<p><p>Address: Selkämerenkatu 10,<p><p>00180 Helsinki<p><p> <p><p>Established: 2012<p><p>Applications accepted throughout the entire year.<p><p>Adam Smith <p><p>Helsinki Times<p><p>Images: Eugenia Soland<p><p> <p>", "time": "2018-10-31T21:14:36+02:00", "type": "education"}
{"title": "Government earmarks €4m for pilots to reduce cost of upper-secondary education", "url": "http://www.helsinkitimes.fi/themes/themes/education/15746-government-earmarks-4m-for-pilots-to-reduce-cost-of-upper-secondary-education.html", "review": "", "content": "<p> <p><p>The Finnish government will launch new pilot projects to reduce the cost of textbooks and other educational materials in vocational and general upper-secondary education.<p><p>Sanni Grahn-Laasonen (NCP), the Minister of Education, revealed last week that a total of four million euros has been allocated for the projects, half of which will be disbursed to vocational and the other half to general upper-secondary education institutions.<p><p>“The start of upper-secondary and vocational education creates educational material costs that put some families in a difficult position. Educational material costs must not become an obstacle to education for even a single young person. That is why new solutions are needed,” she stated in a press release on Friday.<p><p>Related posts:<p><p>The Finnish National Agency for Education (OPH) will open the application period and decide on the pilot projects to be funded during the course of this autumn.<p><p>The Ministry of Education said the objective of the projects is to develop both new ways of borrowing and recycling educational materials, and new open digital educational resources. The objective is also to improve the joint procurement procedures of upper-secondary institutions to reduce the cost of materials and equipment needed by students.<p><p>The Union of Upper Secondary School Students in Finland and the National Union of Vocational Students in Finland (SAKKI) have drafted a citizens’ initiative for guaranteeing free access to upper-secondary education. The initiative has received the requisite 50,000 statements of support and will be submitted for parliamentary consideration.<p><p>The organisations have reported that the material and equipment costs of a general upper-secondary student can rise to 2,500 euros.<p><p>The Finnish government decided in its latest framework session to launch a new subsidy aimed at helping students in the most difficult position to cope with the costs of educational materials in upper-secondary education. The subsidy is worth 46.80 euros a month, amounting to roughly 1,400 euros over a three-year upper-secondary education.<p><p>Aleksi Teivainen – HT Photo: Martti Kainulainen – Lehtikuva Source: Uusi Suomi<p>", "time": "2018-08-13T13:53:22+03:00", "type": "education"}
{"title": "OAJ wants all five-year-olds to participate in pre-primary education", "url": "http://www.helsinkitimes.fi/themes/themes/education/15731-oaj-wants-all-five-year-olds-to-participate-in-pre-primary-education.html", "review": "", "content": "<p> <p><p>The Finnish Trade Union of Education (OAJ) demands that the scope of pre-primary education be expanded by a year to also include five-year-old children.<p><p>“The society is increasingly aware of the significance of high-quality early-childhood and pre-primary education for the educational path of children. OAJ’s next objective is to have all five-year-olds participate in pre-primary education and have the change laid out in the next government programme,” declares Olli Luukkainen, the chairperson of OAJ.<p><p>Sanni Grahn-Laasonen (NCP), the Minister of Education, expressed her tentative support for the proposal in an interview with Helsingin Sanomat on Thursday.<p><p>“The National Coalition believes based on research findings that the most effective approach is to invest in the early years. If compulsory education is expanded, it should be done from the beginning,” she stated.<p><p>Grahn-Laasonen also revealed that one of the more pressing objectives of education policy is to bring children of immigrant backgrounds to the scope of early-childhood education as early as possible. This, she added, could be accomplished by overhauling the family leave system that encourages parents to take care of their children at home.<p><p>“Studies show that early-childhood education is an effective way to support the later learning and development of children. It makes it possible to detect and assist with learning difficulties at an earlier stage,” she said to Helsingin Sanomat.<p><p>Roughly a fifth of five-year-old children are currently not participating in the early-childhood education.<p><p>Sami Savio (PS), a member of the Parliament’s Education Committee, contrastively voiced his opposition to the proposal to expand the scope of pre-primary education.<p><p>“Learning is extremely important, but there is plenty of time to start the long educational path slightly later. The proposal clearly reflects the advocacy efforts of one trade union while children’s perspective is ignored. This is very regrettable because what’s beneficial for children is also beneficial for the society,” he said.<p><p>Finland’s basic education act stipulates that compulsory basic education starts in the year when a child turns seven and that the child must have participated in pre-primary education during the year preceding the start of basic education.<p><p>Aleksi Teivainen – HT Photo: Markku Ulander – Lehtikuva Source: Uusi Suomi<p>", "time": "2018-08-06T13:37:11+03:00", "type": "education"}
{"title": "Police wrap up investigation into corruption at Helsinki Education Department", "url": "http://www.helsinkitimes.fi/themes/themes/education/15702-police-wrap-up-investigation-into-corruption-at-helsinki-education-department.html", "review": "", "content": "<p> <p><p>Police have wrapped up a pre-trial investigation into a massive corruption case where a former employee is suspected of ordering nine million euros worth of equipment for the City of Helsinki’s Education Department in 2006–2016.<p><p>The computers, mobile phones and other electronics were never delivered to the department but sold to individuals all over Finland.<p><p>The former employee is suspected of aggravated fraud and aggravated abuse of public office.<p><p>“The suspected offences were deliberate because the suspect had broad powers to make procurements due to his senior position and, especially, because he was able to utilise his senior position to conceal the offences,” tells Urpo Mäkelä, the senior detective superintendent in charge of the pre-trial investigation at Helsinki Police Department.<p><p>Mäkelä and his colleagues interrogated a total of 66 people during the course of the investigation and suspect some of them of offences ranging from offences in office to aggravated money laundering. For example, four superiors of the main suspect are suspected of offences in office and two of them also of embezzlement.<p><p>The pre-trial investigation also found that employees had acquired and claimed equipment for the department in a manner that violates the regulations of the City of Helsinki.<p><p>“Employees were found in possession of IT equipment and entertainment electronics acquired for the Education Department. [The equipment] had been in private use. A total of 16 current and former employees are consequently suspected of fraud and embezzlement,” says Mäkelä.<p><p>The investigators managed to recover 900,000 euros worth of criminal profits during the investigation. In addition, devices worth roughly 340,000 euros have been confiscated and returned to the City of Helsinki's Education Department.<p><p>The case has been presented to a prosecutor for consideration of charges.<p><p>Aleksi Teivainen – HT Photo: Emmi Korhonen – Lehtikuva Source: Uusi Suomi<p>", "time": "2018-07-25T09:25:36+03:00", "type": "education"}
{"title": "Libera tables five proposals to fix higher education in Finland", "url": "http://www.helsinkitimes.fi/themes/themes/education/15520-libera-tables-five-proposals-to-fix-higher-education-in-finland.html", "review": "", "content": "<p> <p><p>Libera Foundation has tabled five proposals to fix the higher education system in Finland.<p><p>Mikko Kiesiläinen, the managing director of the right-leaning think tank, claims that many of the reforms the country has implemented since the turn of the millennium have not been in compliance with the Bologna Process, a series of agreements to ensure the comparability of higher-education qualifications across Europe.<p><p>“Finland has typically set the example in implementing reforms. It is odd that we have opted out of the European development in a sector we are proud of,” he states.<p><p>Kiesiläinen views that the most significant of the five proposals is that to separate undergraduate and postgraduate degree programmes. The current system, he argues, makes academic performance in the first three years of higher education virtually irrelevant as students are guaranteed a place in master’s degree programmes.<p><p>“If you are admitted at the age of 18 to the University of Helsinki, which in a number of fields is the best university in Finland, your average grade in the first three years is irrelevant. The door will be open for you to the best master’s programme in Finland,” he explains.<p><p>“Even if students complete a bachelor’s degree with the highest grades at the University of Lapland, they have no chance of getting into the best master’s degree programme in their field of study because all the places have been reserved for students of the University of Helsinki. Grades are irrelevant in both universities.”<p><p>This, he adds, also disincentivises universities from developing more attractive postgraduate programmes as the programmes will be entered almost exclusively by the same students who begun their undergraduate studies three years earlier.<p><p>With universities not having to compete against each other and students not having to make a genuine effort, the situation does not promote the development of top talent, according to Kiesiläinen.<p><p>He also encourages students to enter the working life after completing their undergraduate degrees and to decide which postgraduate degree to pursue only after a few years in the working life.<p><p>Such changes are opposed particularly by different interest groups, he says.<p><p>“There are interest groups, such as student associations, that are incentivised to keep the current systems intact. Policy makers, on the other hand, do not have the courage to shake up the system,” says Kiesiläinen.<p><p>Libera Foundation also proposed in its pamphlet that the division into universities and universities of applied sciences be eradicated, that the university network be rationalised, that universities be allowed to charge student contribution fees for master’s programmes, and that entrance examinations be abolished.<p><p>Aleksi Teivainen – HT Photo: Vesa Moilanen – Lehtikuva Source: Uusi Suomi<p>", "time": "2018-05-09T07:23:14+03:00", "type": "education"}
{"title": "50,000 Finns support initiative for free upper-secondary education", "url": "http://www.helsinkitimes.fi/themes/themes/education/15390-50-000-finns-support-initiative-for-free-upper-secondary-education.html", "review": "", "content": "<p> <p><p>Student unions have voiced their delight with the fact that a citizens’ initiative for guaranteeing free access to upper-secondary education has received the 50,000 statements of support required to present it to the Finnish Parliament.<p><p>While vocational and general upper-secondary education is free in Finland, students and their families typically have to pay for textbooks and other class materials out of their own pockets.<p><p>The Union of Upper Secondary School Students in Finland has estimated that the cost of a general upper-secondary diploma can consequently creep up to 2,500 euros. The National Union of Vocational Students in Finland (Sakki) has revealed that the costs of vocational degrees vary from hundreds to thousands of euros depending on the field of study.<p><p>Well over a quarter (29%) of general upper-secondary students and their families struggle to cover the costs of education, found a survey by the Finnish National Agency for Education (OPH).<p><p>“Costs are the reason for many to drop out of upper-secondary education, and this is what many upper-secondary students now want to change,” says Alvar Euro, the chairperson of the Union of Upper Secondary School Students in Finland.<p><p>“Concerns have arisen especially for those students who are worse off,” he adds. “A lack of money should not seal off the education path for anyone. This is an important issue to us, and we hope it is such also to Members of Parliament.”<p><p>Jasmina Khabbal, the chairperson of Sakki, stresses that it is of utmost importance to ensure all young people have an equal opportunity to pursue upper-secondary qualifications and study for the vocation they want.<p><p>“We expect the Parliament to discuss the citizens’ initiative carefully and take action to guarantee a genuinely free and equal upper-secondary education,” states Khabbal.<p><p>The costs of upper-secondary education are perceived as a reason for why as many as 15 per cent of young people do not pursue post-basic education.<p><p>The relatively high share is a concern especially due to its potential impact on the employment situation, as the employment rate for people with only a basic education degree is 43 per cent, according to the Central Organisation of Finnish Trade Unions (SAK).<p><p>Policy makers have proposed that the problem be addressed by either making upper-secondary education free or raising the school-leaving age to 18.<p><p>The Labour Institute for Economic Research proposed last year that the feasibility and impact of free upper-secondary education be determined in a trial not dissimilar to the ongoing basic universal income trial.<p><p>Aleksi Teivainen – HT Photo: Screen capture / www.kansalaisaloite.fi Source: Uusi Suomi<p>", "time": "2018-03-13T13:18:37+02:00", "type": "education"}
{"title": "Niinistö: High textbook prices a threat to equal opportunity in secondary education", "url": "http://www.helsinkitimes.fi/themes/themes/education/15155-niinistoe-high-textbook-prices-a-threat-to-equal-opportunity-in-secondary-education.html", "review": "", "content": "<p> <p><p>President Sauli Niinistö revealed that he is concerned about the soaring prices of textbooks in secondary education while giving a guest lecture at the University of Turku on Tuesday.<p><p>Niinistö pointed out that the recent adoption of new textbooks has increased the costs of secondary education in Finland, possibly to the extent that it is restricting the ability of individuals to pursue an education.<p><p>“Is Finland a country of opportunity for everyone?” he asked in what was the first of a series of guest lectures given by candidates in the presidential elections of 2018.<p><p>Niinistö has some first-hand experience of the issue as he has served as the chairman of the board of Tukikummit, an organisation established to provide financial support to low-income families and, thus, prevent the social exclusion of children and young people. Over a fifth of the support provided by the organisation is for textbooks, he told.<p><p>“And that number is constantly growing,” added Niinistö.<p><p>The issue has also prompted student unions and non-governmental organisations to launch a citizens’ initiative in an attempt to urge the government to take action to reduce costs associated with vocational and general upper secondary education.<p><p>“The cost of vocational and general upper secondary education is high: For example, the total cost of general upper secondary education can rise to 2,600 euros and that of certain vocational degrees – depending on the field and education institution – to several thousands of euros,” the sponsors of the initiative argue.<p><p>“This leaves young people in an unequal position and places pressures on the livelihood of low-income families.”<p><p>The sponsors also point out that up to 15 per cent of Finns fail to complete secondary education by the age of 25. Preliminary research data, they add, indicate that financial struggles were a contributing factor to up to a quarter of school drop-outs.<p><p>“Almost a half of young people without a degree and education place have had to cut back or give up on their studies due to a lack of money.<p><p>Almost 10,000 Finns have already expressed their support for the citizens’ initiative, which was launched at the beginning of September. A total of 50,000 statements of support are required to present the initiative to the Finnish Parliament.<p><p>Aleksi Teivainen – HT Photo: Heikki Saukkomaa – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-11-23T09:57:58+02:00", "type": "education"}
{"title": "Researcher: Finland’s basic education in state of confusion after reforms", "url": "http://www.helsinkitimes.fi/themes/themes/education/15136-researcher-finland-s-basic-education-in-state-of-confusion-after-reforms.html", "review": "", "content": "<p> <p><p>The Finnish basic education system has been thrown into such a state of confusion that it is threatening to compromise the legal protection of pupils and equality in further education, Jari Salminen, a researcher of educational history at the University of Helsinki, argues in a guest contribution to Helsingin Sanomat.<p><p>“Hardly anything is left of the carefully designed, thoroughly supervised and systematically developed basic education system,” he writes.<p><p>Salminen believes the quality of basic education has been compromised by talk about innovation, the ambiguous core curriculum reform, and several coinciding changes and projects. Such development efforts, he adds, have been based on images and social trends rather than thorough empirical evidence, and implemented in a reactive and volatile fashion.<p><p>“Meanwhile, the basic responsibilities of the school have been rejected.”<p><p>The Finnish basic education system became a global success story because it was created by combining the advantages of the two parallel systems it replaced – the folk school and the grammar school. A balance was found between practice and theory was found in teaching, while the systematic nature of the folk school ensured the objectives were reached, tells Salminen.<p><p>“Less and less is left of these principles. Nobody understands the overall state of teaching in primary schools today,” he writes.<p><p>Salminen views that one of the underlying problems is that virtually all instruments to steer and supervise the basic education system have been torn down. Another problem, he adds, is that teachers have only been offered limited continuing training opportunities to help them respond to the emphasis placed on digital and phenomenon-based learning in the new core curriculum.<p><p>Aleksi Teivainen – HT Photo: Roni Rekomaa – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-11-13T14:22:12+02:00", "type": "education"}
{"title": "Aalto likens vocational education reform to “going up a tree arse first”", "url": "http://www.helsinkitimes.fi/themes/themes/education/15113-aalto-likens-vocational-education-reform-to-going-up-a-tree-arse-first.html", "review": "", "content": "<p> <p><p>The Finnish government is going about reforming the vocational education system the wrong way, views Touko Aalto, the chairperson of the Green League.<p><p>“The buzz among the rank and file of the ruling parties is that they’re going about it the wrong way, as you should first carry out reforms and then look at the benefits created by the reforms,” the opposition leader stated to Uusi Suomi on Tuesday.<p><p>“It's like you're going up a tree arse first,” retorted Aalto.<p><p>He was referring to the fact that the government is set to reform the vocational education system as of the beginning of next year, one year after cutting its annual appropriations for vocational education by 190 million euros. One of the key objectives of the reform is to increase interplay between vocational education and the working life.<p><p>The reform and spending cuts have stirred up concerns that the government is transferring responsibility for vocational education from the public to the private sector.<p><p>Aalto, however, estimated that closer co-operation between vocational education and the working life would be a welcome development – although not necessarily for all students.<p><p>“The reform is good news for motivated and independent students who are doing well. But I’m concerned that not everyone will be able to keep up,” he commented.<p><p>Aleksi Teivainen – HT Photo: Heikki Saukkomaa – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-11-01T10:07:34+02:00", "type": "education"}
{"title": "MP Talk: An equal and successful education system needs maintenance", "url": "http://www.helsinkitimes.fi/themes/themes/education/14990-mp-talk-an-equal-and-successful-education-system-needs-maintenance.html", "review": "", "content": "<p> <p><p>MP Talk gives members of parliament the opportunity to share their views on Finnish society with an international audience. The opinions expressed in this column are the author’s own and do not necessarily reflect the view of the Helsinki Times.<p><p>Finland is globally well known for its equal, high-quality, cost-effective and productive education system. The reputation is well deserved and we, as a country, are proud of it.<p><p>Even though we have good reason to be proud, we must not be complacent. Finland’s education system will not retain its quality without maintenance, and we have many reasons to be concerned for the system’s future.<p><p>The first concern is the data showing that 10% of 15-year-olds graduating from basic education lack “functional literacy:” they can read, but they don´t understand what they read. The number of illiterate youngsters is rising. There is a big gender gap: boys’ literacy has declined more than girls’. There is also a growing socio-economic gap: the literacy of less well-off youth has declined more significantly than that of their better-off peers. There is also a geographical gap in learning results: differences between urban neighbourhoods are huge, and results in northern and eastern Finland lag behind southern and western parts of the country.<p><p>Falling literacy is a reason to be alarmed. If you don’t understand what you read, it is very difficult to succeed in higher education or in the labour market. Functional illiteracy can be a major reason why so many young people drop out of school in secondary education. Poor literacy marginalises people and can drive them into social exclusion and poverty. Lost labour and expenses on welfare mean functional illiteracy is expensive to society as a whole.<p><p>What, then, should we do to repair and renew the Finnish education model? There are no simple solutions, but there is a lot of work to be done.<p><p>Firstly, we should look at inequality. To close the gender gap, we have to close the holes in our attitudes and methods. Boys must be encouraged to read more and the system needs to address boys’ problems and needs. Socio-economic gaps can be addressed through general social policies, integration policies and the eradication of poverty. To address the geographical gap, we also need to make sure that schools in less well-off areas have enough resources and extra funding. Urban planning also needs to be carried out to prevent social segregation of neighbourhoods. In rural areas, we have to make sure that education is accessible. It is essential that school classes are small enough that the teacher has enough time for each student, and we must make sure there is special support for those kids that have learning or social difficulties.<p><p>A recent study shows that some teenagers drop out of secondary education because of the costs related to education. The education itself is free-of-charge but the books and other materials create costs rising to thousands of euros. This is a national tragedy, because dropping out of secondary education usually means social exclusion, poverty and unemployment. The Left Alliance has proposed that all secondary education should be totally free of costs and the compulsory education age should be raised to 18 years and expanded to secondary education. This would prevent dropouts and marginalisation, especially in immigrant families and poor families.<p><p>In Finland, we have seen how it really pays off to invest in an equal and high-quality education system and the return on investment is high. Even though Finland has many challenges, we are still a rich country and we have the money to invest into our kids. But are we smart enough to do it?<p><p>Hanna Sarkkinen is the Vice Chair of the Left Alliance party and has been a member of parliament since 2015. Originally from Oulunsalo, Ms. Sarkkinen studied History at the University of Oulu and completed her master’s degree in 2014. She is a member of the city council of Oulu.<p>", "time": "2017-08-28T14:23:27+03:00", "type": "education"}
{"title": "Finland sets example with vocational education reform", "url": "http://www.helsinkitimes.fi/themes/themes/education/14731-finland-s-vocational-education-reform-an-example-to-follow.html", "review": "", "content": "<p>Finland is setting an example for other countries to follow with its upcoming reform of vocational education and training, views Henna Virkkunen (NCP), a Member of the European Parliament.<p><p>“Recognising previously acquired skills, updating the qualification structure to correspond with the needs of the working life and transitioning to practical demonstration of skills are all excellent changes,” she touted in a speech in Jyväskylä on Monday.<p><p>Virkkunen called particular attention to the significance of introducing a year-round admissions system. Life, she reminded, does not always allow people to transition directly from one level of education to another.<p><p>“You can’t always take the most direct route in life, but making turns along the way is part of the deal – sometimes even necessary,” she said. “Allowing people to acquire the skills they’re missing is a smart reform from the standpoint of both students and labour markets. It’ll also expedite the transition from the school bench to the working life.”<p><p>Virkkunen pointed out that taking action to reduce youth unemployment is one of the most important challenges currently facing Europe.<p><p>Eurostat’s latest statistics indicate that a total of four million of the continent's under 25-year-old people are neither in education nor in employment.<p><p>“Unemployment is a human and economic crisis, but at worst it can become a breeding ground for criminal and extremist movements. It’s the duty of decision makers to encourage confidence in the future, but concrete measures are also needed to weed out youth unemployment.”<p><p>The Finnish government presented its proposal for a new vocational education act to the parliament on 24 April, 2017. The comprehensive reform would, for example, encourage learning in real-life work settings and introduce a new funding model in order to reduce the number of drop-outs and enhance the effectiveness of teaching.<p><p>“The reform of vocational education and training is the biggest reform in the field of education in two decades,” commented Sanni Grahn-Laasonen (NCP), the Minister of Education and Culture.<p><p>The reform would also consolidate the provisions governing vocational education and training in order to form a more consistent whole.<p><p>It is projected to reduce study times – especially for adult students – by introducing a personal competence development plan for every student. The plan would identify the student's previously acquired skills and determine how those skills can be supplemented in different learning environments in order to facilitate a successful transition to the working life.<p><p>The plan would be drawn up by a teacher or guidance counsellor together with the student.<p><p>The reform would retain the current three-tier qualification structure but reduce the number of qualifications from 360 to 150. The remaining qualifications, however, would be more broad-based than the current ones, thus ensuring there is no need to create new qualifications in the event that new competence requirements arose.<p><p>Students would additionally be allowed to demonstrate their occupational skills in a real-life work setting. Their performance would be evaluated by a teacher and a representative of the working life.<p><p>The reform also strives to reduce overlap in the planning and administration of vocational education by granting education institutions greater freedom to decide how to organise the education. Principals and teachers would, as a result, be able to spend less time on administrative duties and more on teaching.<p><p>Aleksi Teivainen – HT Photo: Vesa Moilanen – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-05-03T07:13:21+03:00", "type": "education"}
{"title": "Early-childhood education to become free for 6,700 families ", "url": "http://www.helsinkitimes.fi/themes/themes/education/14718-6-700-finnish-families-to-gain-free-access-to-early-childhood-education.html", "review": "", "content": "<p>The Finnish Government has unveiled a list of new measures to tear down inactivity traps in order to meet its target of raising the national employment rate to 72 per cent.<p><p>The Government revealed that the measures agreed upon in its two-day mid-term session are expected to raise the number of the employed by 5,000, according to calculations made by the Ministry of Finance.<p><p>The employment rate for the 15–64-year-old population improved by 0.6 percentage points from the previous year to 68.7 per cent in 2016, according to data released by Statistics Finland. The improvement was attributable largely to the almost 1.5-percentage point increase – from 68.5 to 69.8 per cent – in the male employment rate. The employment rate for women, on the other hand, remained largely unchanged, at 67.6 per cent.<p><p>The Government announced yesterday that it will slash early-childhood education fees for low and middle-income families and remove the fees altogether for roughly 6,700 families. The impact of the reduction on municipal finances – an estimated 69 million euros – will be offset by adjusting the state subsidies for basic services, the share of municipalities of tax revenues and the lower limit for property tax rates.<p><p>The costs arising from the housing allowance system, in turn, will be pared down by introducing a square metre-based cut-off point for the allowances and by tying the allowances to the cost of living index instead of the rental housing index.<p><p>The Government will also seek to promote geographical labour mobility by relaxing the eligibility conditions for commuting and relocation allowances.<p><p>The Government revealed it is planning on streamlining the system for promoting the well-being, educational attainment and employment of children and young people, acknowledging that the current system has failed to sufficiently encourage children and young people to discover their own strengths and pathways to employment.<p><p>The 19 measures identified to accomplish this will require approximately 45 million euros in additional funding.<p><p>The Government is prepared to overhaul the personnel structure of early-childhood education in an attempt to improve the quality of early-childhood education and increase the availability of multi-professional support for children and families.<p><p>Related posts:<p><p>Fifteen-million euros will be invest in developing special education and reducing class sizes at primary schools located in challenging regions.<p><p>An additional 30 million euros, meanwhile, will be set aside for implementing the reform of vocational education in 2018–2019. The objective is thus to promote the digitisation of vocational education, reduce the number of drop-outs and create new pathways to further education and employment in collaboration with employers.<p><p>The Government also announced a number of changes to the unemployment security system designed to encourage job seekers to actively look for employment opportunities and participate in employment services.<p><p>It proposes that the initial waiting period for unemployment benefits be reduced from seven to five days. The benefits, however, would be cut by 4.65 per cent – by introducing a monthly one-day waiting period – for job seekers who have either failed to find employment or neglected to participate in employment services for three months.<p><p>The Government also revealed that it will establish general principles for zero-hour employment contracts and take action to increase the efficiency of wage subsidies.<p><p>The wage subsidy system, it stated, will be rationalised by consolidating the employment vouchers granted to young and over 30-year-old job seekers in order to ensure employers are aware of the applicant’s eligibility for wage subsidies already in the job interview.<p><p>The measures to promote entrepreneurship, in turn, will include improving the unemployment security of the self-employed and reducing the waiting period of the self-employed for sickness allowances from four days to one day. The possibility of allowing the unemployed to self-employ themselves while receiving unemployment benefits for up to four months will also be explored.<p><p>Employment services will be funded with an additional 25 million euros.<p><p>UPDATE: The Government has revised its estimate of the impact of cutting early-childhood education fees on municipal finances, lowering it from 90 to 69 million euros.<p><p>Aleksi Teivainen – HT Photo: Roni Lehti – Lehtikuva<p>", "time": "2017-04-26T08:01:27+03:00", "type": "education"}
{"title": "Minister of Education rejects proposal on tuition fees", "url": "http://www.helsinkitimes.fi/themes/themes/education/14660-minister-of-education-rejects-proposal-on-tuition-fees.html", "review": "", "content": "<p>The Research Institute of the Finnish Economy’s (Etla) proposal to allow higher education institutions to introduce tuition fees for students from Finland and the rest of the European Economic Area (EEA) has been met with resistance from the ranks of the Finnish Government.<p><p>“Etla’s proposal on tuition fees [goes] against the government programme. The National Coalition won’t support it,” states Sanni Grahn-Laasonen (NCP), the Minister of Education and Culture.<p><p>Related posts:<p><p>- Etla: Universities should be allowed to charge tuition fees also for Finnish, EEA students (03 April, 2017)<p><p>The Centre Party has similarly categorically rejected the proposal.<p><p>“The Centre doesn’t advocate introducing tuition fees for Finnish students, regardless of who is proposing it. The equality of education has been pivotal in lifting the country,” says Katri Kulmuni, a deputy chairperson of the Centre Party.<p><p>Etla on Friday estimated that the introduction of tuition fees would offset the negative effects of the recent cuts in research and education spending. Investments in research and education, it reminded, are crucial for the long-term growth prospects of Finland.<p><p>Aleksi Teivainen – HT Photo: Markku Ulander – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-04-03T12:35:57+03:00", "type": "education"}
{"title": "Task force proposes measures to promote educational attainment among immigrants", "url": "http://www.helsinkitimes.fi/themes/themes/education/14539-task-force-proposes-measures-to-promote-educational-attainment-among-immigrants.html", "review": "", "content": "<p>Sanni Grahn-Laasonen (NCP), the Minister of Education and Culture, has been presented with a report detailing over 40 measures to respond to the education needs arising from the growing number of immigrants and asylum seekers in Finland.<p><p>The Ministry of Education and Culture assigned a steering group to design short and long-term measures to promote the educational attainment of young people of immigrant background in late 2015. The steering group draws in its final report particular attention to the need to improve the Finnish and Swedish skills of immigrant pupils and students.<p><p>“Studies indicate that language learning has a clear association with other learning,” said Grahn-Laasonen. “Going forward we have to integrate language learning into all aspects of education, especially into vocational and on-the-job training: it has to be possible to learn the language while learning other skills, or else the journey to education and the working life becomes too long.”<p><p>A change, she said, is consequently required in both the attitudes and ways of operating in Finland.<p><p>The Finnish Government should according to the steering group begin supporting the efforts of foreign-language speakers to learn Finnish or Swedish already in early-childhood education. The objective, it adds, should be to ensure all foreign-language children participate in early-childhood education at least on a part-time basis.<p><p>The proposal would cost an estimated four million euros a year.<p><p>The steering group proposes that the maximum eligibility period for state subsidies for organising language courses to learners of immigrant backgrounds be raised from six to eight years to ensure the subsidies also cover possible general upper-secondary education.<p><p>The proposal is estimated to cost 3.5–4 million euros a year.<p><p>The steering group also proposes that the general language skill requirements for vocational education be abolished, while increasing Finnish and Swedish teaching in vocational education.<p><p>It points out that 13 per cent of people of immigrant origin completing basic education and 75 per cent of participants in integration training currently fail to satisfy the language requirements for vocational education.<p><p>“The risk of exclusion from education and working life is high in such circumstances,” the steering group writes.<p><p>The most expensive measure, with an estimated annual cost of 5.1 million euros, set forth in the report is the removal of participation fees to liberal adult education as of 2018. The Government would thus have to cover 100 per cent, instead of the current 57 or 65 per cent, of the costs of liberal adult education.<p><p>Supporting Immigrants in Higher Education in Finland (SIMHE), a programme launched to improve the access of immigrants and asylum seekers who have already participated or are eligible to participate in higher education, should be developed further, according to the steering group.<p><p>The report was presented to Grahn-Laasonen at the Metropolia University of Applied Sciences, one of the six institutional participants in SIMHE, on 15 February, 2017.<p><p>The steering group also lays out concrete measures to prevent cultural conflicts in education. It proposes, for example, that joint after-school activities be organised for immigrant and native-born children and that the dialogue between different religious groups be promoted.<p><p>“The incidence of hate speech, racism and aggressive online behaviour has increased in our daily lives. Attitudes have hardened. That is not part of a civilised society,” commented Grahn-Laasonen.<p><p>The steering group reminds in its report that a total of 32,400 asylum seekers, including more than 3,000 unaccompanied and a total of 8,500 underage asylum seekers, arrived in Finland in 2015. The unprecedented influx of asylum seekers immediately posed challenges within the administrative purview of the Ministry of Education and Culture.<p><p>The number of arrivals dropped to roughly 5,700 in 2016 but remains considerably above the levels recorded in previous years.<p><p>Aleksi Teivainen – HT Photo: Roni Rekomaa – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-02-16T09:37:13+02:00", "type": "education"}
{"title": "Harakka: Next government should invest €1bn in education", "url": "http://www.helsinkitimes.fi/themes/themes/education/14510-harakka-next-government-should-invest-1bn-in-education.html", "review": "", "content": "<p>Timo Harakka (SDP), one of three candidates vying for the leadership of the Social Democratic Party, has refuted suggestions that socialism is dead but conceded that it may have to reinvent itself to remain relevant in the 21st century.<p><p>“Economic inequalities persist and continue to grow globally. If socialism is understood as addressing social inequalities, which constitutes the basis of the Nordic welfare state, a new version of it is needed,” he says to Uusi Suomi. “I believe the country must provide businesses with all of the preconditions needed to succeed.”<p><p>The Social Democratic Party, he underscores, must re-establish itself as a party for the future by offering citizens answers to the pressing questions of the next decades in the parliamentary elections of 2019.<p><p>“How will the working life change? How will industries change [to adapt to] the digital world economy? How should the social security system be changed?” he lists.<p><p>The Social Democratic Party must shed light on its views on such questions if it is to convince voters that it is the right party to lead the country safely to the next decade.<p><p>Harakka estimates that trade unions have retained their relevance amidst momentous changes in the nature of employment and working life.<p><p>“The trade unions' role in the society is greater than simply hammering out collective agreements for specific sectors. They've also had their share of accomplishments, such as the pension agreement reached by labour market organisations,” he argues.<p><p>The Government of Prime Minister Alexander Stubb (NCP) and labour market organisations agreed on a comprehensive overhaul of the national pension system in the second half of 2014, raising the retirement age gradually to 65 and tying it to life expectancy. The reform was implemented at the beginning of 2017.<p><p>“It was the greatest and only accomplishment of Stubb's Government,” says Harakka. “It'll contribute substantially to narrowing the sustainability deficit in the long term, more so than any of the measures of the Government of [Prime Minister] Juha Sipilä (Centre).”<p><p>Harakka indicates that the pension deal is evidence of the merits of the bargaining system of Finland.<p><p>“It's all but impossible to imagine that earners in any other European country would voluntarily cut their pension benefits. France would probably still be dealing with a general strike. Cars would be on fire in the suburbs of Rome,” he says.<p><p>Harakka also expresses his disapproval with the education spending cuts introduced by the Government of Sipilä. Its successor, he believes, should commit to investing one billion euros in all levels of the education system – “in early-childhood education, basic education, general upper-secondary education, vocational education, higher education, and in research, product development and innovation.”<p><p>The Social Democratic Party will convene to select its next chairperson in Lahti on 3–5 February. The other two candidates in the leadership race are incumbent chairperson Antti Rinne and Tytti Tuppurainen.<p><p>Aleksi Teivainen – HT Photo: Kalle Parkkinen – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-02-01T06:08:46+02:00", "type": "education"}
{"title": "Orpo concerned about young people outside education and employment", "url": "http://www.helsinkitimes.fi/themes/themes/education/14494-orpo-concerned-about-young-people-outside-education-and-employment.html", "review": "", "content": "<p>Petteri Orpo, the chairperson of the National Coalition, has expressed his concerns about young people not in education or employment.<p><p>“The marginalisation of young people means losing trust in your immediate community, young people and the society. Almost one-fifth of 20–24-year-old young adults were not in education or employment in 2015,” he stated in an address to the party council in Helsinki on Saturday.<p><p>“Not having a job is especially detrimental to young people who are only starting their lives,” he added, gauging that improving the employment situation is one of the most effective means to help young people at risk of marginalisation.<p><p>Orpo drew attention to statistics indicating that the standard of living for young people decreased considerably relative to other age groups between 1990 and 2013. Statistics Finland reported in April, 2016, that the economic downturn has had an impact especially on the earnings of young people.<p><p>“Being in a poor financial situation is dispiriting. It robs people of their confidence in the future, crushes their will to study,” said Orpo.<p><p>The three ruling parties have agreed to establish a task force to mull over measures to reduce inequality at the earliest possible stage. One of the priorities of the task force should be early-childhood education, according to Orpo.<p><p>“We already know that developing and raising enrolment in early-childhood education is one of the best measures to prevent marginalisation,” he stated.<p><p>A recent study, he pointed out, found that children participating in early-childhood education under the age of three, irrespective of the educational background of their parents, are more likely to continue to upper-secondary education and enrol in higher education than children not participating in early-childhood education.<p><p>He reminded that young people without at least an upper-secondary education degree may find it difficult to integrate into the labour market and society.<p><p>Orpo also highlightedthat enrolment in early-childhood education is relatively low in Finland. Fewer than three-quarters, or 74 per cent, of four-year-old children are currently enrolled in early-childhood education, compared to more than 90 per cent elsewhere in the Nordics.<p><p>“What's especially problematic is that those children who'd benefit the most from it have the lowest enrolment rate,” he added.<p><p>The Government has according to him decided to reduce the costs of early-childhood education for low-income households by more than 700 euros per year and remove the costs entirely for the lowest-income households.<p><p>“This is our way to address growing inequalities. Our goal is that more and more children will have the opportunity to participate in early-childhood education and that more and more parents, especially single parents, will have the opportunity to accept job offers,” explained Orpo.<p><p>Orpo also estimated that a social security system encouraging dependence on benefits is especially harmful to young people.<p><p>“We're spending more and more money with a view to helping people, but we aren't really helping them. A social security system discouraging from activity is harmful especially to young people. Some end up in an unbreakable social security benefit cycle at a young age. A system that doesn't help you get back on your feet isn't right for young people or others,” he said.<p><p>He consequently called for revisions to the social security system designed to encourage benefit recipients to be active and participate by, for example, accepting short-term job offers and volunteering.<p><p>“If there's no work available at a certain time, any kind of activity should be preferable to absolute inactivity.”<p><p>Aleksi Teivainen – HT Photo: Jussi Nukari – Lehtikuva Source: Uusi Suomi<p>", "time": "2017-01-23T06:59:14+02:00", "type": "education"}
{"title": "SAK: Longer compulsory education would help prevent marginalisation", "url": "http://www.helsinkitimes.fi/themes/themes/education/14406-sak-longer-compulsory-education-would-help-prevent-marginalisation.html", "review": "", "content": "<p>The Central Organisation of Finnish Trade Unions (SAK) is prepared to increase the duration of compulsory education in an attempt to prevent the marginalisation of young adults.<p><p>Mikko Koskinen, the head of education affairs at SAK, points out that annually roughly 10,000 young people fail to make the transition to upper-secondary education and that fewer than one-half of the 620,000 people without post-primary qualifications were employed in 2014.<p><p>“Most lowly-educated people also have insufficient literacy, numeracy and digital skills. The EU has already recognised that insufficient basic skills lead to marginalisation, but Finland is lagging behind dangerously in this respect,” he says in a press release.<p><p>“The lowly-educated struggle to find employment. About half-a-million jobs that do not require a degree have disappeared over the past thirty years,” adds Koskinen.<p><p>Related posts:<p><p>- Finland must do more to combat social exclusion, says Risikko (08 December, 2016)<p><p>Paula Risikko (NCP), the Minister of the Interior, has rightly identified marginalisation as a key internal security threat, he acknowledges. “However, these 600,000 adults need education immediately,” says Koskinen.<p><p>SAK proposes that the problem be addressed by removing obstacles to education for both the employed and the unemployed and by establishing open vocational institutions that operate similarly to open universities. It is also prepared to adopt a so-called basic skills guarantee to reach out to the hundreds of thousands of adults who struggle to read, calculate and use digital devices.<p><p>The Government could at best exceed its employment target by investing in increasing the vocational education opportunities of adults, according to calculations made by SAK.<p><p>“If the employment rate was at the same level for those with only a primary school degree than it is for those with an upper-secondary degree, the employment rate would be above 72 per cent. 146,000 people more than today would be in employment,” highlights Koskinen.<p><p>Aleksi Teivainen – HT Photo: Milla Takala – Lehtikuva Source: Uusi Suomi<p>", "time": "2016-12-12T08:16:07+02:00", "type": "education"}
