{"title": "Happiness, depression and electric vehicles, Finland in the World Press ", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/15565-finland-in-the-world-press-happiness-depression-and-electric-vehicles.html", "review": "", "content": "<p> You may have heard that Finland has been rated as the happiest country in the world for 2018, so it might seem surprising that the World Health Organisation has also ranked Finland as the country with the second most depressive disorders per capita. Psychology Today takes a closer look at the relationship between happiness and depression.<p><p>In other news, the New York Times shines a spotlight on Finland’s Champions League-winning doctor, while the BBC reports that Finnish car dealers are less dismissive of electric vehicles than their Nordic counterparts.<p><p>Finland ranks highly in both happiness and depression Psychology Today<p><p>The recently released World Happiness Report 2018 met with the usual flurry of questions and doubts about what exactly it measured, and how accurately. Amid all the discussion of life satisfaction and the various metrics used to assess it, though, much of the focus this year put wellbeing in the context of national rates of depression.<p><p>That emphasis should not surprise us. Researchers have long insisted on their correlation—that stress tied to financial insecurity and discrimination correlates closely with depression.<p><p>This year, Finland compelled greater reflection on the relationship between depression and happiness, because the country placed first among indices measuring wellbeing (including social stability and services; gross domestic product per capita; trust in government and institutions; levels of crime and corruption, and so on) while also ranking second, according to the World Health Organization, in per capita prevalence rates for depressive disorders.<p><p>To its citizens, happiness may mean more than the absence of depression. The forms of comparison that social media intensify may be a further complicating factor, especially if online platforms are used to exaggerate happiness through ostentatious displays of it (though Finns are not exactly known for this).<p><p>“While there are significant shortcomings in international comparisons of depression and while other research has estimated that the depression rates of Finland would be closer to the global average,” Frank Martela commented in Scientific American, “what is clear is that Finland is far from the top of the world in preventing depression.”<p><p>Original article was published by Psychology Today on 19/05/2018 and can be found here.<p><p>Finland in favour of electric vehicles BBC<p><p>\"Dismissive\" car dealers are a major barrier to boosting sales of electric vehicles (EVs), according to a new study.<p><p>Researchers, who posed as car shoppers in Scandinavia and Iceland, found that sales personnel strongly pushed petrol and diesel powered cars.<p><p>Around 77% of dealerships that sold EV brands didn't discuss their existence with the potential customers.<p><p>However in Finland, a country with colder winters and spread out population centres that should be more difficult for electric cars, dealers were more supportive of EVs.<p><p>\"Finland is a country that should be less attractive to EVs, but we found that dealers were still more willing to support sales of electric cars compared to Danish dealers,\" said Gerardo Zarazua de Rubens.<p><p>\"The government said they want EVs in the country and set a target of 250,000 by 2030 which resonated downstream to the marketplace, whereas in Denmark you find the opposite – the government is sending other types of signals.\"<p><p>With carbon from the transport sector responsible for one quarter of energy-related global greenhouse gas emissions, governments are keen to see a rapid uptake of EVs.<p><p>\"EVs will come faster than most people think,” said de Rubens. “Replacing the entire fleet will take a long time as we can't just get rid of all the cars but I think EVs will dominate new sales in the next decade, and not in 20 years.\"<p><p>Original article was published by the BBC on 24/05/2018 and can be found here.<p><p>Sakari Orava, the doctor that heals World Cup stars The New York Times<p><p>Sakari Orava is among the very few Finnish citizens to own a Champions League's gold medal.<p><p>He didn't win it on the field, but on the operating table of his medical practice in Turku, a small city on the southwest coast of Finland.<p><p>Over the years, legions of top soccer players, including David Beckham, have made the trip to Finland to go under the skilled knife of the world renowned surgeon.<p><p>His long list of patients also includes former Serbia president Boris Tadic, who charted a private jet for Orava so he could come to Belgrade and repair his Achilles tendon a few years ago.<p><p>\"Last year, I actually received a few shirts from Real Madrid. They also gave me a Champions League gold medal because I had operated on two guys from Real Madrid,\" the 72-year-old Orava told The Associated Press in an interview last week. \"Two Finnish soccer players have received it. One from Liverpool, Sami Hyypiä, and the other from Ajax, Jari Litmanen, who both won the Champions League. So there are three people from Finland to have this medal.\"<p><p>Original article was published by The New York Times on 24/05/2018 and can be found here.<p><p>Liikanen says he won't campaign for European Central Bank presidency Bloomberg<p><p>Bank of Finland Governor Erkki Liikanen said there may be circumstances under which he would consider succeeding Mario Draghi as European Central Bank president, but that he won’t be campaigning for the job.<p><p>Asked in an interview on Finland’s YLE TV1 on Saturday whether he is available for the position when it opens in the second half of 2019, Liikanen, 67, said such discussions always begin too early.<p><p>“I’m not going to be campaigning for any task,” Liikanen said. “There may be situations where you get asked: ‘will you do your duty?’ And then one must consider.”<p><p>Liikanen is stepping down as Bank of Finland governor in July after serving two seven-year terms at the helm of the Helsinki-based central bank. Olli Rehn, deputy governor and former European commissioner for economic and monetary affairs, was appointed his successor on Friday.<p><p>Original article was published by Bloomberg on 19/05/2018 and can be found here.<p><p>Bold new gold coins look forward to next hundred years of nationhood Coin Update<p><p>The Mint of Finland has launched (23rd May) new gold coins which focus on the future of their country, which in 2017 held year-long celebrations of Finnish independence. As Finland looks back on last year’s celebrations on its century of independence, the coin’s concept and design ask the question, “What will the country’s next century be like?”<p><p>The new coin is the work of artist Hannu Veijalainen and is entitled “Blue Bio-Economy,” whose design highlights Finland’s current and future role as a country of clean and pristine waters and water sources. The coin’s design highlighting the water theme is significant to the country and region for several reasons.<p><p>First is the access to clean water, which is an increasingly important consideration worldwide. Second is the water’s sleek and smooth surface, which also functions as a mirror and is a symbolic reflection of the future. The theme represents growth, tinged with the playfulness and humour required for building the future.<p><p>A limited number of 100 coins are available, which are also individually numbered. The coin is officially released on the 12th June.<p><p>Original article was published by Coin Update on 24/05/2018 and can be found here.<p><p>Dan Anderson – HT<p><p>Photo: Lehtikuva<p>", "time": "2018-05-25T19:19:20+03:00", "type": "finland"}
{"title": "Gay swimmer Ari-Pekka Liukkonen named Finland's sports role model of the year", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/13192-gay-swimmer-ari-pekka-liukkonen-named-finland-s-sports-role-model-of-the-year.html", "review": "", "content": "<p>\"Olympic swimmer Ari-Pekka Liukkonen has been named as Finland's sports role model of the year. 2014 was a monumental year for Liukkonen as he came out in the build up to the Winter Olympic Games in Sochi, Russia to protest the country's position on LGBT rights.<p><p>Finnish journalist Ossi Halme told Outsports: 'I think this came as a nice surprise. I was a bit unsure whether or not Liukkonen would win. He has strong merits from the pool. Then again, I wasn't sure if the jury would really understand how much of a role model it makes him that he came out during the busiest time of his career. I'm glad and somewhat relieved to see that he won.'<p><p>When Liukkonen came out, he became Finland's first openly gay elite male athlete. The 25-year-old is also the Finnish record holder in the 50m freestyle event which he competed in at the London 2012 Olympic Games and won a bronze medal in both the European and World Championships in 2014.\"<p><p>SO SO GAY 15 January. ANDY WALKER LEHTIKUVA / Roni Rekomaa <p>", "time": "2015-01-22T15:26:29+02:00", "type": "finland"}
{"title": "Finland is warming faster than the rest of the world", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/13155-finland-is-warming-faster-than-the-rest-of-the-world.html", "review": "", "content": "<p>''Finland is warming fast – faster than scientists ever predicted and at nearly twice the rate of any other country on Earth – according to new research from the University of Eastern Finland and the Finnish Meteorological Society. The researchers found that over the past 166 years Finland's average monthly temperatures increased by two degrees Celsius, whereas temperatures over the rest of the planet have increased by only .8 degrees Celsius on average.<p><p>In general, sub-Arctic countries are all warming faster than the rest of the world. This isn't surprising to some, who expect the rate of warming at the poles to increase faster than in other areas of the world. The fact that the coldest places are warming faster isn't that much of a mystery. According to ZME Science, ice acts like an insulating cover that reflects the sun and keeps the water below cold. The result is that the more ice that is lost to melting, the more the surface absorbs the heat instead of reflecting it back to space. Ice-free parts of the ocean now absorb much more heat than they used to, so when air temperatures drop in the fall and winter, the heat is released into the air, moderating the temperature and frustrating skiers everywhere...'<p><p>'You would expect that the temperatures in the north would be rising faster than the global average,' Ari Laaksonen, professor in the Department of Applied Physics at the University of Eastern Finland and a co-author of the study told Scientific American. 'But [researchers] expected a rate that was 50 per cent faster; Finland's temperature is rising by almost 100 per cent.'...\"<p><p>INHABIT 9 January. Michelle Kenne LEHTIKUVA / Kimmo Mäntylä<p>", "time": "2015-01-15T12:54:38+02:00", "type": "finland"}
{"title": "Miss Finland bluffs poker pro Ronnie Bardah in amazing hand", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/13074-miss-finland-bluffs-poker-pro-ronnie-bardah-in-amazing-hand.html", "review": "", "content": "<p>\"SHARK CAGE is a made-for-TV poker event produced by online poker giant PokerStars. The TV-show pits poker pros with celebrities and members of the general public in a series of single-table poker tournaments with the eventual winner taking home 1,000,000 dollars (more than 800,000 euros). The show also offers up a few twists and turns along the way like a 'shot clock' and a 'shark cage' concept, where a player spends time 'behind bars' if they fold the best hand on the river.<p><p>One highlight that has many in the poker world talking pits Miss Universe Finland, Sara Chafak, with 2012 World Series of Poker bracelet winner [meaning that he's also the winner of the annual World Series of Poker event – HT] Ronnie Bardah as Chafak's play confuses Bardah so much, that the man who has won more than one million dollars on the live tournament circuit is forced to fold the winning hand!<p><p>Although Bardah is feeling it from a few fellow poker pros, he's taking it all with a smile. He even tweeted out that the episode was now available for public consumption...\"<p><p>SPORTING NEWS 11 December Image: Petteri Peltonen <p>", "time": "2014-12-18T09:21:48+02:00", "type": "finland"}
{"title": "Great Finnish writers? Where do I start?", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/13022-great-finnish-writers-where-do-i-start.html", "review": "", "content": "<p>\"Celebrations are taking place today across Finland, the beautiful Nordic country of lakes and islands as the 97th anniversary of the day Finns declared independence from Russia is marked. It took a further month for the Russians to acknowledge this formally in January 1918, but for the Finns, with a long history of being part of either Sweden or Russia, enough was enough and December 6th, 1917, is the day Finland left the Russian Empire and became independent.<p><p>That independence of spirit is an essential element of the Finnish psyche. Think of Finland and think of the glories of the music of Jean Sibelius, an ardent nationalist whose most famous work, Finlandia, Op 26, his dramatic symphonic poem, written in 1899 and revised the following year, was partly an expression of protest against increasing Russian censorship.<p><p>It is a piece of music that forms a fitting soundtrack for the many heroic achievements of Finland's majestic middle and long distance runners who continue to take their inspiration from the legendary Paavo Nurmi, one of track and field's most enduring champions and winner of nine gold and three silver medals in an Olympic career spanning three Games: Antwerp in 1920, Paris in 1924 and Amsterdam in 1928. Think of Finland and think of the many great athletes, runners and javelin throwers, not forgetting rally drivers, who have emerged from a population of little over 5 million.<p><p>Finland is an enigma; an archipelago of water and trees. Santa Claus is believed to reside there. Bordered by Sweden to the west, Norway to the north, Russia to the east and Estonia to the south, it retains an individuality most brilliantly personified by an artist and writer of singular originality, Tove Jansson, who was born to Finnish sculptor Viktor Jansson and the illustrator Signe Hammarsten, in Helsinki 100 years ago this year.<p><p>Jansson is remembered as the creator of the Moomin stories which began in late 1945 with The Moomins and the Great Flood. In it Moominmamma and Moomintroll are searching for a safe place to build a house, in the hope that Moominpapa, who had already set off the same quest, will return. By the publication of the third story, she was famous. All in all there would be ten books and an industry with various spin-offs – a kind of Nordic Disney...\"<p><p>THE IRISH TIMES 6 December. EILEEN BATTERSBY LEHTIKUVA / JUSSI NUKARI <p>", "time": "2014-12-11T09:31:08+02:00", "type": "finland"}
{"title": "Finland becomes an unlikely battleground for same-sex marriage debate", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12938-finland-becomes-an-unlikely-battleground-for-same-sex-marriage-debate.html", "review": "", "content": "<p>\"Finland's parliament narrowly approved a bill legalising gay marriage on Friday, 28 November after months of heated debate and controversy. Yes, you read that correctly. Finland, often regarded as one of the most inclusive and progressive countries in the world, has only now approved same-sex marriage for its citizens. In the US, by contrast, 35 states have already legalised gay marriage, with same-sex marriage bans recently falling in Arkansas and Mississippi.<p><p>The vote passed with 105 votes in favor and 92 opposed, making Finland the 12th European country to allow same-sex marriage and putting it on the same legal footing as its regional peers: Denmark, Iceland, Norway, and Sweden. The announcement that the bill had passed was met with cheers of jubilation in Helsinki's Citizens' Square as a crowd of at least 5,000 people shouted 'Thank you!' towards the parliament building.<p><p>'It's a demonstration of civic activism and it's also a sign that Finnish legislation is approaching the same level as that of other Nordic and Western countries on this very delicate and difficult issue,' Finnish Prime Minister Alexander Stubb told the crowd after the vote.<p><p>Homosexuality in Finland has been legalised since 1971, though it was only formally declassified as an 'illness' in 1981, and gay couples have been able to enter into registered partnerships in the Nordic nation since 2002. Registered partnerships gave same-sex couples most marriage rights, but banned couples from adopting and taking the last name of their spouse.<p><p>The announcement to legalise same-sex marriage is being lauded as a victory for activists and marks the end to an uncharacteristically tense debate about homosexuality in Finnish society, where polls and analysts were still undecided whether the law would pass right up until Friday's vote.<p><p>Attempts to pass a bill in the past were met with stiff opposition, both in the government and in segments of civil society. Officially recognising same-sex marriages was brought to parliament by Tahdon 2013, a pro-gay rights advocacy group, after a failed attempt to submit a citizens' petition in February 2013.<p><p>Following their rejection, Tahdon 2013 gathered more than 166,000 signatures in favour of same-sex marriage and resubmitted the petition in December 2013, where it was accepted and slated for debate in parliament this [last] week.\"<p><p>FOREIGN POLICY 28 November. REID STANDISH LEHTIKUVA / MIKKO STIG <p>", "time": "2014-12-04T08:51:31+02:00", "type": "finland"}
{"title": "Town called Nokia seeks a new calling", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12774-town-called-nokia-seeks-a-new-calling.html", "review": "", "content": "<p>\"VERY FEW places in the world have given rise to truly global brands: Evian and Cadillac in France are two. But possibly the most famous of them all is Nokia in Finland.<p><p>Not that you would know it from visiting the town. The centre consists of a parade of rather bleak shops, an apartment block that would be at home in Soviet-era Estonia and the Bossburger 'meathouse'. This is the sort of town from which teenagers dream of escaping.<p><p>As 14-year-old Iiris Majamaki, with the hood of her coat protecting her from the sleet, tells me: 'It is a little town in the middle of nothing. There's not much to do here.'<p><p>Even Merja Vainio, 59, a postal worker delivering letters on her bike, says: 'If you want to see some action, you have to leave and visit Tampere,' talking about the city 15 minutes up the road. 'All my three grown-up children have left here.' They are not the only ones.<p><p>The company that made this town in south-east Finland so famous has packed up and moved out. Nokia was once a brand so famous and so instantly recognisable that in parts of Africa a mobile phone was called 'a nokia'.<p><p>But Microsoft, which bought Nokia's handset division for 4.61 billion pounds (5.86 billion euros) last year, has announced that the next phone it releases will no longer have the Nokia logo stamped on it. It would appear that the brand, once considered more valuable than Apple, Google and McDonald's, has bitten the dust...\"<p><p>THE TELEGRAPH 15 November. HARRY WALLOP LEHTIKUVA / Pertti Jenytin <p>", "time": "2014-11-20T09:26:43+02:00", "type": "finland"}
{"title": "Finland rules bitcoin services as VAT exempt", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12773-finland-rules-bitcoin-services-as-vat-exempt.html", "review": "", "content": "<p>\"THE FINNISH Central Board of Taxes (CBT) today [16 November] declared that exchanges were providing 'banking services.' The commission rates charged by exchanges were, therefore, in accordance with the EU VAT Directive, exempt from VAT (Value Added Tax).<p><p>EU Directives, such as the VAT Directive, specify certain goals to be achieved by member states. The member states are granted considerable discretion as to how they will achieve these goals (see Article 288 of the Treaty on the Functioning of the European Union). 'EU Regulations,' in contrast, specify both the goals and the means by which states must achieve them.<p><p>The EU VAT Directive (Council Directive 2006/112/EC of 28 November 2006 on the common system of value added tax) applies to goods and services sold within the EU. Its aim is to harmonize VAT Law among EU Member States. It specifies that VAT rates must be within a certain range within all EU countries, but leaves it up to member states to decide where in the range their rates will fall. Article 135(1) of the VAT Directive grants an exemption for all 'financial services'.<p><p>In their decision, the CBT concluded that exchanges are providing a financial service and are, therefore, exempt from VAT (per Article 135(1)). Finland's position can be compared and contrasted with other EU countries.<p><p>Other Bitcoin VAT Decisions In Europe<p><p>Belgium's Federal Public Service Finance (FPS) has declared that domestic digital currency transactions are exempt from VAT. The FPS's reasoning was predicated on the view that Bitcoin was not 'a legal means of payment' and therefore could not be subject to VAT. It appears, however, that they may revise their ruling in the future.<p><p>The UK were yet more emphatic, declaring digital currency transactions to be VAT exempt. This is not the first pro-Bitcoin move that the UK has made recently. Earlier this year, Chancellor Osborne voiced his eagerness to make the UK a Bitcoin hub. Importantly, though, the VAT exemption declared by HMRC (Her Majesty's Revenue and Customs) will not apply to transactions in which merchants provide goods and services in exchange for Bitcoins. The exemption will only apply to the fees charged on bitcoin-trading transactions.<p><p>Other member states have adopted more conservative positions...\"<p><p>CRYPTOCOINS NEWS 16 November. BRIAN OBEIRNE LEHTIKUVA / Roni Rekomaa<p>", "time": "2014-11-20T09:24:31+02:00", "type": "finland"}
{"title": "In Finland, Tax Day is the best day", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12722-in-finland-tax-day-is-the-best-day.html", "review": "", "content": "<p>\"...EVERY NOVEMBER, Finland's top papers clamour to dig through the data, tracking the rise and fall of the fortunes of politicians and businessmen, while Finnish tabloids capitalize on the public disclosures to peek into the lives of the country's celebrities. In past years, investigative work based off the annual release of data has exposed tax-dodging cabinet ministers and sports stars with offshore tax havens.<p><p>But not all stories are so hard-hitting. This week, the top stories in the tabloid paper Iltalehti all aired the financial dirty laundry of Finland's celebrities and politicians. For example, one story stated that Juha Sipilä, the chairman of the Center Party, saw his fortune dwindle to the point that he is now the country's lowest earning member of the opposition. Another highly trafficked story gloated over the fact that popular Finnish rap star Cheek (a Nordic version of 50 Cent), actually netted less in 2013 than Matti Nykänen, a former Olympic ski jumper turned singer with a history of violence and alcohol abuse.<p><p>Apart from tabloid gossip, the frictions that the tax disclosures expose are very real. In the 1990s, the average income tax rate was 37.5 per cent in Finland, but throughout the 2000s income taxes eased considerably to 30 per cent. But since the eurozone crisis in 2009, tax rates have started to climb as Helsinki has grappled with trying to keep the welfare system funded while tightening its fiscal belt. The average tax rate is currently 30.4 per cent, but is slated to rise to 31.1 per cent next year. In March, the rising tax rate led Björn Wahlroos, a banker and one of Finland's richest men, to move to Sweden, reportedly because of the more lenient tax regime.<p><p>Not all of Finland's elite are fleeing from the rising taxes, though. Some see paying a high tax rate as a badge of patriotism. On 3 November, the seven owners of the gaming company Supercell, best known for their bestseller Clash of Clans, saw themselves at the top of Finland's income list, paying a combined 230 million euros (287 million dollars) in taxes. But instead of looking for tax havens abroad, Supercell touted itself as a true Finnish brand...\"<p><p>FOREIGN POLICY 5 November. REID STANDISH LEHTIKUVA / Seppo Samuli<p>", "time": "2014-11-14T13:12:19+02:00", "type": "finland"}
{"title": "Finland warns of new cold war over failure to grasp situation in Russia", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12721-finland-warns-of-new-cold-war-over-failure-to-grasp-situation-in-russia.html", "review": "", "content": "<p>\"WESTERN COUNTRIES are at the gates of a new cold war with Russia, sparked by the Ukraine crisis and a continuing failure to grasp the depth and seriousness of Vladimir Putin's grievances with the US and EU, the Finnish president, Sauli Niinistö, has warned.<p><p>Speaking to the Guardian at his official residence before Thursday's conference in Helsinki attended by the UK prime minister, David Cameron, and Nordic and Baltic state leaders, Niinistö said Finland had a long tradition of trying to maintain friendly relations with Russia. But it would not be pushed around.<p><p>'The Finnish way of dealing with Russia, whatever the situation, is that we will be very decisive to show what we don't like, where the red line is. And that is what we are prepared to do,' Niinistö said, referring to recent violations of Finnish airspace by Russian military aircraft.<p><p>'We put the Hornets [US-made Finnish air force F-18 fighter aircraft] up there and the Hornets were flying alongside the Russian planes... The Russians turned back. If they had not, what would we have done? I would not speculate.'<p><p>Cameron [joined] eight Nordic and Baltic leaders at the one-day Northern Future Forum hosted by Alexander Stubb, Finland's prime minister. Sources said they [discussed] a response to Moscow's official recognition of 'illegitimate' weekend elections at the weekend that were won by pro-Russia separatists in eastern Ukraine, at a private dinner at Stubb's residence at Kesäranta.<p><p>Cameron [was told] that Britain is seen as an essential player in formulating Europe's policy towards Russia and that the Ukraine crisis shows how the EU is much stronger when its members work together...\"<p><p>THE GUARDIAN 5 November. LEHTIKUVA / Martti Kainulainen <p>", "time": "2014-11-14T13:09:57+02:00", "type": "finland"}
{"title": "Vacations built to look like a Hollywood movie", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12653-vacations-built-to-look-like-a-hollywood-movie.html", "review": "", "content": "<p>\"Ever watched a movie and wished that was your life – or at least your vacation?<p><p>Now it can be, just as long as your fantasies involve Finland. Over-the-top dreams-to-reality filmmaking is the latest luxury travel offering to come out of the Nordic nation.<p><p>Called 'The Hollywood Experience,' the custom-designed travel concept was created by Janne Honkanen, owner of high-end travel company Luxury Action.<p><p>The concept goes like this: the client comes up with a 'literary or visual narrative' that serves as a script for his or her 'Hollywood movie.'<p><p>This could be parents who want to travel with their children to Santa's workshop in the North Pole.<p><p>Or a 'Bourne' fan who wants his own car chase caught on video. Or a 'Chronicles of Narnia' reader who'd love to step into the Hundred-Year Winter.<p><p>Personalized epics<p><p>The company arranges the on-site production and movie shoot, as well as the final edit incorporating visual or sound effects.<p><p>'My returning clients are always looking for something upgraded and more personalised,' says Honkanen about how the concept came about.<p><p>'These busy business people have dreams and want to offer something unique to their family and children.'...\"<p><p>CNN 28 October. FRANCES CHA<p><p>LEHTIKUVA / PEKKA SAKKI<p>", "time": "2014-11-06T11:06:55+02:00", "type": "finland"}
{"title": "Finland eager to deepen arms trade collaboration with Israel", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12487-finland-eager-to-deepen-arms-trade-collaboration-with-israel.html", "review": "", "content": "<p>\"MILITARY trade between Finland and Israel goes back for more than 60 years. Finland exported weaponry to Israel already in the 1950's, 1960's and 1970's. The major imports from Israel took place in the 1990's and during the very first years of the 21st century.<p><p>It would probably be an exaggeration to claim that more than a relatively tiny part of Finns are aware that Finland is conducting arms trade with some of the most egregious human rights violating countries in the world. However, the issue has received scattered coverage. In particular, Finland's arms trade links with Israel keep drawing a lion's share of the overall criticism.<p><p>Indeed, the fact that Finland continuously seals new military deals with a state that so openly breaches international law, that is the state of Israel, as well as conducts trade with, and produces economic benefit to, private Israeli weapons companies which are complicit in Israel's abysmal human rights breaches has arguably elicited more domestic criticism than Finland's arms trade with any other state.<p><p>Over 250 Finnish dignitaries from the arts, sciences and politics have signed a petition demanding an immediate discontinuation of all military trade and cooperation between Finland and Israel.<p><p>Among the signatories are foreign minister Erkki Tuomioja, world-renowned international law expert Martti Koskenniemi and distinguished professor at the University of Helsinki, forensic dentist Helena Ranta. They are joined by Finnish MEPs and MPs, a number of Finlandia Prize winners, film and stage directors, writers, actors, scholars and more than 40 university professors.<p><p>The Finnish film director Aki Kaurismäki encapsulated some of the reasons why Finland's arms trade with Israel is such an abomination: 'What makes the arms trade between Finland and Israel particularly disgraceful is the fact that it is carried out with companies and weapons which have had a central role in the killing of civilians in the territories illegally occupied by Israel.'...\"<p><p>TELESUR 13 October. AIRIN BAHMANI, BRUNO JÄNTTI LEHTIKUVA / Timo Jaakonaho<p>", "time": "2014-10-23T07:44:33+03:00", "type": "finland"}
{"title": "Finland bans the word 'whisky'", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12403-finland-bans-the-word-whisky.html", "review": "", "content": "<p>\"The organiser of a beer and whisky expo scheduled to take place later this month had been ordered to refrain from using the word 'whisky' in the titling or promotion of the event.<p><p>This meant that the beer and whisky event was, perversely, not allowed to be named or described as a beer and whisky event.<p><p>Due to strict alcohol advertising laws in the country, the State Regional Administration Agency (Avi) deemed the use of the word 'whisky' in the event's marketing to be considered as a promotion of a strong spirit.<p><p>\"This was about the event's marketing name, which had advertised strong spirits,\" said the agency's senior inspector Jarmo Oresmaa.<p><p>The event's license is dependent on the fair's website not showing up in search engine results for the word 'whisky' – 'viski' in Finnish.<p><p>Organiser Mikki Nyman, having consulted with Valvira, the National Authority for Health and Welfare, initially took the decision to ask private bloggers and social media users who were writing about the event to remove the word 'whisky' from their posts in an effort to remove it from search results.<p><p>This move has since been described as unnecessary by the state regulators, who now say that removing the word 'whisky' from the title should be sufficient. In the agency's view, the name must simply be changed from \"Beer and whisky expo\" to \"Beer expo\".<p><p>However, even after the name change, inspector Oresmaa said he had received complaints from members of the public about the event's website, as it still controversially contained references to whisky.<p><p>The story has now become national headline news in the country, with a backlash on social media and \"viski\" and \"Viskigate\" trending on Twitter...\"<p><p>The Drinks Business 13 October <p><p>LEHTIKUVA / Timo Jaakonaho<p><p> <p>", "time": "2014-10-16T15:03:42+03:00", "type": "finland"}
{"title": "S&P cuts Finland's credit rating one notch to AA-plus", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12402-s-p-cuts-finland-s-credit-rating-one-notch-to-aa-plus.html", "review": "", "content": "<p>\"Standard &amp; Poor's Ratings Services cut Finland's triple-A rating one notch to AA-plus, citing the Nordic country's continuing economic problems.<p><p>The outlook is stable, however, S&amp;P said.<p><p>The rating firm had earlier indicated a possible rating downgrade, warning in April that it could strip the triple-A rating within the next two years unless \"clear signs emerge that Finland's negative economic and fiscal debt trends are being reversed.\"<p><p>The nation, which once enjoyed robust economic growth, has been struggling to recover from the 2008 financial crisis. Its economy has lagged behind peers, with gross domestic product per capita shrinking by about 0.26 per cent, \"well below\" the norm for comparable economies, the rating firm said. And the country's budget deficit in 2015 is expected to violate the European Union's budget rules, Martti Hetemaki, permanent secretary of Finland's Ministry of Finance, said in August.<p><p>On 10 October, S&amp;P also warned of Finland's vulnerability to Russia, which accounts for about one-tenth of total exports, or about 4 per cent of country's GDP. It said it expects Finland to post its third consecutive year of negative real GDP growth, as real output remains about 6 per cent below its 2008 level. Further, the rating firm said, Finnish exports have underperformed world trade since 2008, an indicator of lower competitiveness...<p><p>...Despite weak economic performance, the rating firm noted, the country's labour costs, based on Eurostat data, have risen above those of the euro zone.<p><p>S&amp;P further warned the country's aging population, shrinking workforce and loss of global market share in the key information technology sector will pose further challenges in its recovery...\"<p><p>The Wall Street Journal 10 October. Maria Armental LEHTIKUVA / ERIC PIERMONT <p>", "time": "2014-10-16T14:54:31+03:00", "type": "finland"}
{"title": "Finland to raise retirement age from 63 to 65", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12218-finland-to-raise-retirement-age-from-63-to-65.html", "review": "", "content": "<p>\"Representatives of government, unions and pension funds of Finland agreed to raise the retirement age from the current 63 to 65.<p><p>The negotiations over Finland's state pension system have lasted for weeks, and agreement on the retirement age was finally settled.<p><p>According to the proposed pension reform, Finnish employees, both men and women, born in or after 1955 will retire two years later than the current age of 63, Finnish broadcaster YLE reported.<p><p>From 2017, the pensionable age will be gradually increased by three months every year. This means that employees born in 1962 will be the first group who retire at the age of 65.<p><p>In addition, the proposal claimed that employees doing physically or mentally demanding works will have possibility to retire earlier, but their career will be no shorter than 38 years...\"<p><p>GLOBAL POST / XINHUA NEWS AGENCY, 26 September LEHTIKUVA / Timo Jaakonaho<p>", "time": "2014-10-02T10:53:54+03:00", "type": "finland"}
{"title": "Finland's Jolla takes its Sailfish-powered smartphone to India, via Snapdeal", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12217-finland-s-jolla-takes-its-sailfish-powered-smartphone-to-india-via-snapdeal.html", "review": "", "content": "<p>\"Jolla, the Finnish smartphone startup that used the MeeGo open source OS as a jumping off point for its own Android-app compatible Sailfish OS – and which last November released its first handset in its home market – has now expanded availability of the phone to India.<p><p>Jolla's handset is priced at Rs. 16,499 in India (around 210 euros), and is selling exclusively via local ecommerce giant Snapdeal.<p><p>India is the second non-European market that Jolla has launched its eponymous debut smartphone into, after adding Hong Kong back in August – via a partnership with the 3 carrier. Elsewhere, it says it has local operator/distribution partners in Finland, Estonia, Kazakhstan and Italy. In most of Europe it sells its handsets direct, via shop.jolla.com.<p><p>Cumulative sales are an unknown at this point, as Jolla is not disclosing any sales figures for the handset.<p><p>While Jolla has set itself up as a refreshing alternative to the dominant smartphone platforms of Android and iOS – with a distinct, gesture-focused interface and smartphone hardware with a twist (thanks to a removable backplate that links via NFC to the phone's software interface) – the task of standing out in emerging markets with high growth potential, such as India, is getting harder because of increasingly fierce competition in the lower end of the Android space...\"<p><p>TECHCRUNCH 23 September. NATASHA LOMAS JOLLA <p>", "time": "2014-10-02T09:47:25+03:00", "type": "finland"}
{"title": "Success of Angry Birds reflects growth of young entrepreneurship in Finland", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12079-success-of-angry-birds-reflects-growth-of-young-entrepreneurship-in-finland.html", "review": "", "content": "<p>\"In a post-Nokia era, startups are emerging among an \"empathetic generation\" as a means not to get rich but to solve social problems.<p><p>Finnish gaming companies are having a moment. Just look at Rovio (Angry Birds) and Supercell (Clash of Clans), the rise of which has coincided with the unravelling of the once-unbeatable Nokia.<p><p>This surge in successful start-ups reflects an emerging culture of young entrepreneurship in Finland. Startup Sauna, a co-working hub and Slush, a start-up conference now said to be the largest event of its kind in northern Europe, are new staples of the Finnish entrepreneurial scene. And thousands of young Finns are beginning to identify themselves as entrepreneurs.<p><p>Finland is changing. What exactly has happened to foster a culture of young entrepreneurship in this frequently idealised \"welfare state\"?<p><p>Lack of 'secure work' in Finland<p><p>My colleague Noritoshi Furuichi and I set out in May this year to seek some answers. We interviewed more than 30 individuals, from secondary school students and young entrepreneurs to well-known role models and scholars. We were interested in what our interviewees thought of entrepreneurship and how they viewed the relationship between Finland's welfare state and entrepreneurial behaviour.<p><p>Elina Uutela, 24, is a communication studies undergraduate at the University of Helsinki who works as a host at the Helsinki Think Company, a hub for academic entrepreneurship. She launched her first content production company at 17 and went on, in 2011, to serve as the chief of operations for the expanding startup conference Slush. This event has engaged Silicon Valley icons and investors to inspire a new generation of techies across northern Europe. It brought Uutela in close contact with the Aaltoes, or the Aalto Entrepreneurship Society, a student-run entity at Finland's Aalto University that has been recognised as a key catalyst of Finland's startup craze.<p><p>According to Uutela, from the perspective of young adults at least, there is no such thing as \"secure work\" in post-financial crash Finland. In a fluid, competitive context where proud symbols of the nation's economic identity (such as Nokia's chunky mobile phones) could vanish overnight, entrepreneurship appears to be a better option.<p><p>Entrepreneurs can enjoy a stronger sense of control (however constrained in reality) over their work compared with company employees. Though a certain fear of failure still lingers, Uutela said the personal risks of launching a new venture in the context of free university education and a supportive entrepreneurial community have become minimal in practice...<p><p>THE GUARDIAN 8 September. TUUKKA TOIVANEN Lehtikuva / Roni Rekomaa <p>", "time": "2014-09-18T14:32:22+03:00", "type": "finland"}
{"title": "Homoerotic artist Tom of Finland gets global stamp of approval, with success of Finnish stamp set", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/12078-homoerotic-artist-tom-of-finland-gets-global-stamp-of-approval-with-success-of-finnish-stamp-set.html", "review": "", "content": "<p>\"A set of homoerotic Finnish stamps featuring images by gay icon and artist Tom of Finland have become a worldwide success, Finland's postal service company said.<p><p>During the six months that preceded the launch, buyers placed pre-orders from 178 countries, Posti said in a statement.<p><p>Tom of Finland, whose real name was Touko Laaksonen (1920-1991), is venerated internationally in gay circles for his explicit sexual drawings, created at a time when homosexuality was still taboo in the West.<p><p>The stamps feature partial nudity and muscular moustachioed men in uniforms.<p><p>\"It's great that these images, which in the past had to be sold under the table, can now be openly stuck on an envelope or a postcard,\" Timo Berry, the graphic artist who designed the stamps, told Finnish public broadcaster YLE.<p><p>Posti said the stamp set got \"the largest global media attention\" ever.<p><p>\"Our aim is to keep printing stamps which are in line with our time,\" Posti spokesman Markku Penttinen said in a statement. After Finland, the highest number of orders came from Sweden, Britain, the United States and France.\"<p><p>ABC 9 September. AFP LEHTIKUVA / Jari Lam <p>", "time": "2014-09-18T14:29:55+03:00", "type": "finland"}
{"title": "Retail dairy prices crash in Finland", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/11952-retail-dairy-prices-crash-in-finland.html", "review": "", "content": "<p>\"Retail prices for milk and dairy products have fallen by well over 40 per cent in Finland, in the wake of Russia's decision to ban food imports from the EU, according to Finnish farming journalist Tapio Vesterinen.<p><p>Tapio, who attended this week's Lely continuous baling launch event in the Netherlands, told Agriland that the ongoing trade dispute between Russia and the EU has had a devastating impact on Finnish agriculture.<p><p>'Our market is flooded with dairy products at the present time,' he said.<p><p>'Farm gate milk prices have already fallen by 6c/L in response to these developments. If this trend is sustained for the next 12 months, dairy farmers in Finland will incur losses of around 50 million euros. This is not a sustainable situation.<p><p>'Dairy and livestock production account for well over 70 per cent of total agricultural output in Finland. 'Something must be done to take all of these surplus dairy products off the market in Finland. And from what I am hearing, 'export refunds' is the only support model that will meet this need.'<p><p>This is a view shared by United Dairy Farmers' Group Chief Executive, Dr Dobbin. He told Agriland that the introduction of Private Storage Aids by Brussels for a selection of dairy products is a step in the right direction.<p><p>'It should help prevent further produce coming onto the European market, which is currently oversupplied. Private Storage Aids for butter were previously available to processors at this time of the year and their return will relieve the huge financial pressure on local processors who are generally carrying large stocks at present. I expect that most processers in Ireland will make use of this facility. That said, it remains to be seen if this measure on its own is enough to stabilise markets, we may need to see the reintroduction of export refunds to help boost export sales.'...\"<p><p>AGRILAND 6 September. Richard Halleron LEHTIKUVA / Heikki Saukkomaa<p>", "time": "2014-09-11T14:26:25+03:00", "type": "finland"}
{"title": "Finland EPR nuclear reactor construction now lags almost a decade behind original schedule", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/11951-finland-epr-nuclear-reactor-construction-now-lags-almost-a-decade-behind-original-schedule.html", "review": "", "content": "<p>\"The European Pressurized Reactor (EPR) under construction in Finland may not start operating until late 2018 — putting the project nearly 10 years behind its initial schedule.<p><p>Finnish utility Teollisuuden Voima (TVO) said in a statement on 1 September that the AREVA-Siemens consortium building Olkiluoto 3 had updated its schedule. The schedule review, which 'has been going on for some time,' is still a 'work-in-progress,' noted the company.<p><p>'However, it is hard for us to accept such a late start-up forecast given by the supplier because the completion degree is high, the completed works fulfill very high technical standards, and we know what the remaining works are,' said Jouni Silvennoinen, a TVO spokesperson.<p><p>According to AREVA, the principal driver of recent delays to the project has been the reactor instrumentation &amp; control (I&amp;C) system approval. 'After a four year period of exchanges with TVO, the I&amp;C architecture was finally approved in April 2014, giving the consortium a key visibility element to schedule the completion of the project,' the company said.<p><p>The updated schedule is based on 'key assumptions and commitments concerning TVO's cooperation as the owner of the plant,' AREVA added. 'From the beginning of the project, the role of the owner is essential to the progress on the project, for example to facilitate the review of technical and safety matters by [Finnish regulators], even more during the commissioning phase which is to come.'<p><p>The consortium and TVO are expected to hold workshops to 'optimise' the reactor's commissioning over the coming months...\"<p><p>POWER 9 September. SONAL PATEL <p><p>LEHTIKUVA / Heikki Saukkomaa<p><p> <p>", "time": "2014-09-11T14:24:20+03:00", "type": "finland"}
{"title": "Japanese girl crowned air guitar champion", "url": "http://www.helsinkitimes.fi/world-int/world-news/finland-in-the-world-press/11858-japanese-girl-crowned-air-guitar-champion.html", "review": "", "content": "<p>\"Somewhere between musical performance, physical exercise and comedy act, it's hard to define the art of air guitar playing. But some of its practitioners take it very seriously indeed. The 2014 Air Guitar World Championship has just lowered its curtain in the Finnish city of Oulu, and the latest world champion is a 19-year old girl from Japan.<p><p>The Air Guitar World Championships, a four-day event that culminates in a Grand Finale in Oulu. Thousands of people – both locals and tourists – gather in the city centre to witness the spectacle. National Air Guitar Champions, along with eight candidates from the qualifying round, battle it out for the main prize – a handmade electric guitar.<p><p>'Air guitar is something to be loved, there are a lot of people having an opinion about air guitar and air guitar playing, a lot of time they are thinking that air guitar is a stupid thing to do but I think people should come over here at least go look at a contest and watch some air guitar players because for to me it is really awesome and liberating,' said an air guitarist named Michael Heffels.<p><p>'I think air guitar means freedom of movements, freedom of expression, it's a great way to have fun and it's also about world peace because you can't kill someone with an air guitar in your hand,' said an air guitarist named Marquina Iliev.<p><p>The sixteen contestants in the final are from nine different countries. In the end, a happy Nanami 'Seven Seas' Nagura walks away with the title and the guitar. She is the 19th world champion, with reigning United States champion Matt 'Airistotle' Burns finishing in second place.<p><p>'I love all, I love air-guitar, I'm glad that I came to Finland and I'm glad that I fought the air-guitar world championship and won,' said Nanami Nagura, the 2014 Air Guitar World Champion.<p><p>According to the organisers, the purpose of the Air Guitar World Championships is to promote world peace. They say that 'if all the people in the world played Air Guitar, wars would end, climate change stop and all bad things disappear'. That statement may sound comical, but this competition proves that there's nothing absurd about dreaming big...\"<p><p>CCTV 1 September LEHTIKUVA / Vesa Ranta<p>", "time": "2014-09-04T09:36:41+03:00", "type": "finland"}
