{"title": "‘Mermaiding’ sports trend comes to Finland as country’s first mermaid swimming school opens in Helsinki", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/16062-mermaiding-sports-trend-comes-to-finland-as-country-s-first-mermaid-swimming-school-opens-in-helsinki.html", "review": "", "content": "<p>The alternative sports trend and social media craze ‘Mermaiding’ has made its way to Finland, with qualified ‘mermaid instructors’ now teaching classes in Helsinki and Espoo.<p><p>The sport, which is believed to have first gained prominence in the United States earlier this year, consists of swimming with the aid of a mermaid tail, allowing the user to move like a fish. <p><p>Finland’s first official ‘Mermaid School’ is teaching swimmers eager to channel their inner mythical sea creature at selected Sportaamo leisure centres in Helsinki and Espoo. Swimmers of all ages, genders, and skill levels are welcome, although first-timers must be able to swim for a length of 50 metres to take part.<p><p>Swimming instructor Maija Möttönen said in an interview with Yle that the classes have proved instantly popular with the locals, with the programme now having over 100 students on its books.<p><p>“I believe [previously] there were more kids mermaiding, but we now have a lot of adults who have taken up this hobby” reported Möttönen, before going on to describe how the sport has become increasingly popular with men as well as women.<p><p>The constrictive nature of a rubber mermaid tail has been the source of a number of safety concerns, with authorities in the UK recently issuing official warnings describing the activity as dangerous.<p><p>Nonetheless, this has done little to deter would-be mermaids, who continue to sign up in droves to Helsinki’s very own mermaid academy.<p><p> <p><p>Adam Oliver Smith – HT<p>", "time": "2018-12-26T17:00:21+02:00", "type": "health"}
{"title": "French body work method Antigym® arrives in Espoo", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/15876-french-body-work-method-antigym-arrives-in-espoo.html", "review": "", "content": "<p><p><p>Antigym® or Antigymastique® is a body work method developed by French physiotherapist Thérèse Bertherat in the 1970s. Its popularity has spread outside of France as Antigym practitioners have brought the method across the world, particularly to South America and Europe. Helsinki Times spoke to trained Antigym practitioner, Sonu Manglani, about the method after one of her classes. <p><p>THE CLASS takes place in a bright, well-lit room. We begin by standing on our mats, rotating our knees in and out to get a feel of the way different parts of our body are connected to one another. Sonu gives instructions and asks questions as we move through each subtle movement slowly.<p><p>The hour seems pass very quickly as we take a few minutes to focus on each movement and our breath. We go through a series of movements both standing and lying down using different props. We each get a small ball which we place underneath one foot at a time, closing our toes around it and squeezing it. The last movement involves placing a pillow underneath the sacrum in order to allow the lower back to relax fully. The end result is a feeling of total body relaxation and better body awareness. <p><p>“THIS METHOD OF BODY WORK emphasises the harmony between the neck, shoulders, back and sacrum,” explains Sonu after the class. “We pay attention to one specific movement, using the breath to help lengthen and relax the muscles”. The connection between the body, the mind and the breath helps to deepen body awareness, a key aspect of this method. It also provides a wonderful opportunity to focus on oneself amidst the stress fast-paced modern life brings to most people. <p><p>“Most of us overwork certain muscles which leads to compensation from others,” continues Sonu. “One area that is usually overworked is the back area, or what Thérèse Batherat refers to as ‘the tiger’.” In Antigym, your “tiger” refers to the “musculature of the back of your body, arranged in a solid and continuous chain” from the base of the neck to the toes. This chain is often overworked leading to tightness, pain and overcompensation in the front of the body. Antigym aims to lengthen and stretch this chain so that these muscles can finally relax and start working with greater ease and fluidity. <p><p>As it aims to improve flexibility, mobility and reduce stress, this method is a good counterbalance to other physical activity from more labour intense activities like running and gym training to yoga. Sonu herself has been practicing yoga for 15 years. “Since I discovered Antigym 3 years ago, my yoga practice has become more fluid,” says Sonu. <p><p>Antigym is taught in small groups of maximum 10 people, the ideal size of a class is around 3-7 people. It is recommended that Antigym is practiced regularly but no more than once a week as it takes around 5 days for the body to assimilate the changes. Reaping the benefits of Antigym is a process. Like in other forms of physical exercise it takes time and consistency in order to see and feel the changes. <p><p>Sonu holds weekly classes at 9.30am every Monday at Yoga &amp; Wellness Studio in Spektri Business Park in Espoo. <p>", "time": "2018-10-10T13:28:22+03:00", "type": "health"}
{"title": "Terrified of returning to work with mixed up sleeping and eating patterns? With these tips you will survive", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/11585-terrified-of-returning-to-work-with-mixed-up-sleeping-and-eating-patterns-with-these-tips-you-will-survive.html", "review": "", "content": "<p>The bright summer nights have mixed up the daily routines of many holidaymakers, and meal times are also in disarray. After endless barbeques and late nights, it is advisable to ease oneself gradually back onto the rails.<p><p>1. Sleeping and eating patterns are good to get under control simultaneously as they support each other. Avoiding heavy meals, coffee and alcohol in the evening makes falling asleep easier, and research shows that a good night's sleep curbs the desire to binge eat.<p><p>2. While on holiday, breakfast might stretch into lunchtime. When the machinery should suddenly be ready to run at seven in the morning, breakfast might not go down so well. Nutritional therapist Raija Partanen recommends a soft landing: eat in the morning something light and small that is easy to swallow but also have lunch earlier.<p><p>3. If the meals on holiday have mainly consisted of ice cream and strawberry cake, the body is still craving sugar. According to Partanen, sweet cravings will wane naturally when you start eating regularly again. When hunger has been satisfied with a nutritious meal, it is completely acceptable to have a small sweet for desert.<p><p>4. The reparative measures of mixed up sleeping patterns can start already before returning to work. Regular waking in the morning adjusts one's inner clock within a couple of weeks so that sleep comes earlier in the evening. If the pattern is changed radically at once, the foggy feeling may accompany you for days. According to a research from the Finnish Institute of Occupational Health, already one night short of sleep may dampen performance the following day, and one well slept night after is not enough for the body to recover. Returning to work in the middle of the week may also make things a bit easier.<p><p>Laura Grönqvist – HS Mari Storpellinen – HT © HELSINGIN SANOMAT Image: Kimmo Taskinen / HS<p>", "time": "2014-08-18T15:53:00+03:00", "type": "health"}
{"title": "A sporty lifestyle never starts by accident", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/11587-a-sporty-lifestyle-never-starts-by-accident.html", "review": "", "content": "<p>Nobody ever decides to quit doing sports. It just ends or slowly becomes more and more rare and eventually sinks to an embarrassing level. The reason is always the same: a break.<p><p>A small, innocent pause can kick off a year-long slacking off period meant to last originally either a week or two, after which you'd pull yourself together again. The reason may have been summer holiday, flu, travel, work commitments, kids or a backache.<p><p>The break is always fatal. Already a week's idleness starts to push a person towards more comfortable choices. The further the pause stretches, the harder it is to get back in the saddle.<p><p>Sure, there are also those who don't take breaks or who just decide to continue where they left off.<p><p>There are those who embark on their fifth jog of the week even on Christmas Eve if that's part of the plan. However, only few people have been blessed with such steely determination. The rest of us have to train the mind with resilient perseverance, as a sporty lifestyle never starts by accident. \"Slowly getting active\" goes to the same league of empty promises as the slimming diet starting on Monday.<p><p>When facing a new beginning, one should therefore choose a clear strategy.<p><p>I recommend one of the following: 1. Create routines. 2. Set a goal. 3. Find such an enjoyable sport that you would do it even without the benefits.<p><p>Routines are the saving grace of a weak human being. The times for doing sports should be written beforehand on the calendar, with a marker. Morning yoga, evening jog, Friday tennis. No excuses. When routines are learned in the beginning, even when forced, at some point they become automatic.<p><p>Setting goals<p><p>Every sports trainer compels you to set goals. However, everyone does not need to run a marathon but can use creativity instead in setting the goal. A more humane option is a list of everyday goals, such as being able to touch the floor with your hands while your legs remain straight, and to walk to the eighth floor without panting. For preventing exhaustion immediately after commencing, it's good to chop the goal into suitable parts.<p><p>And the price waiting at the finishing line needs to be something awesome.<p><p>Enjoyable sport might sound like an exaggeration for some but the key really is persistence in trying out different types of sports. Good company for doing sports might also be crucial.<p><p>When talking about sports, the word \"enjoyable\", however, needs to be defined critically. Most activities are actually alright, especially after the performance. But doing sport as a hobby requires it to be so cool that even after a day's work, it attracts you more than chocolate and sofa. If such sport is difficult to find, one should concentrate on strategy options 1 and 2.<p><p>Doing sport is most efficient if one can tick all three boxes.<p><p>Laura Grönqvist – HS Mari Storpellinen – HT © HELSINGIN SANOMAT Image: Antti Aimo-Koivisto / Lehtikuva<p>", "time": "2014-08-18T12:28:00+03:00", "type": "health"}
{"title": "Several newborns in the USA fallen ill after missing vitamin K jab", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/11584-several-newborns-in-the-usa-fallen-ill-after-missing-vitamin-k-jab-2.html", "review": "", "content": "<p>Several serious illnesses have been reported in the United States after parents' refusal of a vitamin K jab to be given to their baby. American magazine Mother Jones was the first to report this.<p><p>At the children's hospital at Vanderbildt University in Nashville, Tennessee, for example, seven children have been treated for internal bleeding caused by lack of vitamin K. The condition at its worst is very serious and can lead to permanent neurological problems if the bleeding takes place in the brain, or even to death.<p><p>The lack of vitamin K is such a rare condition that the doctors first thought that the children were suffering from some kind of blood poisoning. Only when the parents informed that they had refused the vitamin K jab for their babies did the doctors understand what was happening. The jab gives nearly 100 per cent protection against the bleeding caused by lack of vitamin K.<p><p>Some parents who had refused the vitamin K jab for their children were also opposed to vaccination. The reasons the parents gave include fear that the vaccines would cause leukemia or that they were unnecessary, or that they wanted to protect their children from toxic substances.<p><p>As there are several websites online opposing vitamin K vaccinations, the doctors fear that they have only seen the top of the iceberg. According to the Center for Disease Control and Prevention in the USA, the majority of babies born in hospitals get the vitamin K as recommended, but those born out of hospitals in birth centres were worryingly often lacking the vitamin K jab.<p><p>...<p><p>JANI KAARO, RUUT TOLONEN – HS MARI STORPELLINEN – HT<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-08-14T09:48:21+03:00", "type": "health"}
{"title": "Research: Emotionally cold child must not be labelled as psychopath ", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/11020-research-emotionally-cold-child-must-not-be-labelled-as-psychopath.html", "review": "", "content": "<p>“We know that it is very difficult to change psychopathic characteristics in adults. But this commonly held view is changing as we are accumulating research data showing that such characteristics in children can be changed,” explains Taina Laajasalo, a professor of psychology. <p><p>A research team from the University of Helsinki compiled a review of several international studies and the conclusions have now been published in the medical journal Duodecim.<p><p>“Psychopathic personality and emotional detachment are currently hot research topics in the field of child psychiatry,” says Laajasalo.<p><p>A recent study found that 10 to 32 per cent of 8–12-year-old children with behavioural problems had emotionally cold characteristics. Such personality traits could be observed already at the age of three or four.<p><p>Around 21 to 50 per cent of children receiving treatment for psychiatric problems have some characteristics typical of an emotionally cold personality. When researchers looked at the whole population, they found that around 3 to 7 per cent of 5–18-year olds had emotionally cold personality characteristics without behavioural problems.<p><p>Emotional detachment refers to a person’s inability to connect with other people emotionally, or to experience or express emotions.<p><p>Emotionally detached person does not experience remorse or guilt over their actions. Researchers say that such personality traits are at the core of psychopathic personality disorder.<p><p>“But a child must not be labelled as a future psychopath: that is taking a conclusion a step too far,” says Laajasalo, adding that there are no well-designed studies where subjects would have been followed from childhood into adulthood.<p><p>Researchers do not yet know which factors give rise to an emotionally cold personality.<p><p>“It’s not clear yet what roles genetics and environment play in the development of these characteristics. It seems likely that a person’s genetic background also affects the development of emotionally detached personality,” explains Laajasalo.<p><p>She says that environmental factors and experiences can help promote or suppress the personality traits. Traumatic experiences, such as abuse or neglect, during a child’s early years may increase the likelihood of the child developing emotionally cold characteristics. <p><p>Emotional detachment in adults was extensively studied in the 1980s and 1990s, says Laajasalo.<p><p>According to research, children with tantrums or behavioural problems coupled with emotional coldness often cope less well as adults.<p><p>Emotional detachment in children has traditionally beenconsidered a personality trait that does not change with age but there are only a very few follow-up studies on the topic.<p><p>Conventional therapies have not been effective in treating behavioural disorders and emotionally cold characteristics connected with these problems.<p><p>A commonly held notion has been that fearless personality, unresponsiveness towards punishments and inability to recognise negative emotions that go hand in hand with emotional detachment shape a person’s conscience in a way that contributes to an increased risk of aggressive and anti-social behaviour.<p><p>Laajasalo, however, says that these characteristics can be influenced and modified.<p><p>“A number of studies have shown that it’s possible to reduce the emotionally cold personality traits in a child. Parents and other care-givers are advised to start treating the child in a more positive way by leaving out orders, prohibitions and punishments that are ineffective, instead giving the child positive feedback,” explains Laajasalo. <p><p> Katri Kallionpää – HS Niina Woolley – HT ©HELSINGIN SANOMAT Image: Miikka Pirinen / HS <p><p> <p>", "time": "2014-06-28T17:03:55+03:00", "type": "health"}
{"title": "Vitamin B can provide a natural aid for stress", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/10593-vitamin-b-can-provide-a-natural-aid-for-stress.html", "review": "", "content": "<p>The brain requires Vitamin B to calm down. Stress, depression and memory-related problems can be related to a lack of Vitamin B.<p><p>With stress looming over you and the blues take over, the need for vitamin B rarely crosses the mind first.<p><p>Studies in recent years have proven, though, that vitamins of group B can lift the mood and alleviate stress. They may well be called \"nervous vitamins\".<p><p>Technically, Vitamin B is a group that includes eight water-soluble vitamins, which means that they leave the system rather quickly with urine. The vitamins of this group are often found in the same foodstuff, such as fish, meat, milk, yeasts, whole grains, peanuts and seeds.<p><p>These \"nervous vitamins\" are necessary in metabolism, the production of energy and the formation of red cells. Vitamin B also supports brain cell functions and advances the production of serotonin, a neurotransmitter that lifts the mood and regulates sleep and heart and circulation.<p><p>Vitamin B may pose a natural remedy for stress. Researchers at Swinburne University in Australia studied the effects of a Vitamin B compound on work-related stress on a 90-day treatment period.<p><p>The test took into account the personality differences of test subjects as well as work demands.<p><p>Test subjects consumed a strong Vitamin B compound for 30-90 days. Their stress levels were decreased by 19 per cent.<p><p>Anxiety, depression, hostility and fatigue were also reduced among those who consumed Vitamin B. Those who consumed a placebo did not experience any changes.<p><p>According to researchers Vitamin B provides a cheap treatment method for work stress as well as mental problems in general.<p><p>A moody role<p><p>Vitamin B can even play a part in the most difficult mood disorders. For example a study by Okayama University in Japan revealed that those who suffer from panic disorders and hyperventilation have a deficiency of Vitamin B6 and iron. No deficiency was noted among the healthy test group.<p><p>What about depression, then? Even then Vitamin B cannot be ignored. Doctor of Medicine Jussi Seppälä's dissertation revealed that a lacking intake of folic acid and Vitamin B12 increased the risk of certain symptoms of depression, such as a lowered mood. Folic acid is a synthetic form of folate, i.e. Vitamin B9, which is contained in vitamin pills, for example.<p><p>\"The risk of having melancholic symptoms was smaller almost by half with those who received most folic acid when compared to the group with the smallest intake,\" Seppälä says.<p><p>Seppälä's research also revealed that those with the lowest levels of Vitamin B12 also experienced the most melancholic symptoms of depression. Those with the highest levels of Vitamin B12 did not have an increased risk of depression symptoms.<p><p>Seppälä believes that the results should be used in planning treatments.<p><p>\"When a person is diagnosed with depression, it would be sensible to measure the Vitamin B12 concentration in their blood.\"<p><p>Vitamin deficiency may not always be observed by the person in question. According to experts, the only reliable way to study vitamin levels is through a laboratory test at a health care centre.<p><p>Alarming signs of a Vitamin B deficiency may include fatigue, weakness, problems of memory and concentration, the numbing or tingling of hands and feet, skin symptoms and ulcers in the corner of the mouth.<p><p>A prolonged Vitamin B deficiency can lead to permanent nervous and memory damage. A lack of Vitamin B increases the risk of cardiovascular diseases, intestinal cancers, depression and memory-related sicknesses. Vitamin B12 deficiency increases the likelihood of having Alzheimer's disease or another dementia.<p><p>The good news is that Finns usually have a good intake of Vitamin B, a 2007 report by Finravinto reveals. The exception is folate, which can be found in particularly significant amounts in vegetables, berries and fruits.<p><p>According to experts a lack of folate signifies a major lack within the Finnish diet: we should consume vegetables almost twice as much.<p><p>Because Vitamin B12 is only found in products of the animal kingdom, vegetarians and vegans particularly are at risk. Experts recommend additional nutrients for these people.<p><p>Lauri Seppälä – HS Annika Rautakoura – HT © HELSINGIN SANOMAT Images: Kimmo Taskinen / HS<p>", "time": "2014-05-17T17:11:00+03:00", "type": "health"}
{"title": "Thousands of Finns suffer from rare cancer", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/10592-thousands-of-finns-suffer-from-rare-cancer.html", "review": "", "content": "<p>\"Prostate, breast, lung and bowel cancers are common,\" says Pirkko Kellokumpu-Lehtinen, professor of oncology at the University of Tampere and chief physician at the Tampere University Hospital.<p><p>\"All other cancer types are rare, including childhood cancers.\"<p><p>Maarit Leinonen, the chief medical officer at Finnish Cancer Registry, explains that the number of rare cancer diagnoses may vary from one up to more than 300 a year, with a cancer defined as rare if it has an incidence less than 1 in 20,000.<p><p>The list of rare cancers is long, with the European RareCare project including 186 cancers and numerous cancer subtypes in its register of rare cancers.<p><p>One of these rare diseases affects one in five European cancer patients, amounting to more than four million sufferers. In Finland alone, there are tens of thousands of patients with a rare cancer.<p><p>Is a rare cancer more difficult to spot?<p><p>\"Cancer usually manifests itself as a lump,\" says Kellokumpu-Lehtinen.<p><p>\"Because of this, doctors realise quickly it is a cancer. On the basis of the symptoms, the doctor sends the patient for a scan which shows the tumour.\"<p><p>The right course of treatment is determined on the basis of international recommendations.<p><p>It seems that the cancer being rare has an impact on the treatment. According to RareCare, the diagnosis is often delayed, care is not knowledgeable and research on various treatments is lacking.<p><p>Unpromising results<p><p>The Finnish Cancer Register is carrying out two studies on rare cancer, one concerning centralised cancer care and the other delays in the treatment of rare cancers.<p><p>The preliminary results show that treatment results are not as good as for common cancers as measured by survival after treatment. Eleven per cent of lung cancer patients are alive after five years, compared with 89 per cent of breast cancer patients.<p><p>Survival figures for patients with a rare cancer are worse than the corresponding figures for patients with a common cancer, reports RareCare. The Cancer Register statistics show a similar trend for survival after one, three and five years after the diagnosis.<p><p>\"A delay in diagnosing the disease goes a long way in explaining the difference,\" says Leinonen. Kellokumpu-Lehtonen argues that one way of fixing the problem is to centralise the treatment of cancer.<p><p>\"A central hospital may well only have one oncologist who never comes across all the different cancer types during their whole career,\" she explains.<p><p>\"We have more than 30 doctors who can specialise in treating different cancers.\"<p><p>Leinonen would centralise also the diagnosis phase as \"doctors should also see a high enough number of exceptional findings\".<p><p>RareCare and the national cancer treatment strategy, which was approved four years ago, also advocate centralised treatment.<p><p>Healthcare services in Pirkanmaa are working on a proposal under which patients would first visit a university hospital, then receive treatment in a central hospital and go back to the university hospital for check-ups.<p><p>Päivi Repo – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Arttu Kokkonen<p>", "time": "2014-05-17T13:07:00+03:00", "type": "health"}
{"title": "Breakthrough in the disputed field of hypnosis", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/7971-breakthrough-in-the-disputed-field-of-hypnosis-2.html", "review": "", "content": "<p>A recent study reveals that hypnosis can produce real hallucinations.<p><p>A STUDY conducted by the Universities of Helsinki and Turku in collaboration with the Swedish Skövde University was able to determine that a hallucination produced by hypnosis was real by measuring the brains electrical activity.<p><p>During the study, a test was conducted with two highly hypnosis-prone persons who were shown figures, such as a square, triangle or circle, which were coloured either blue or red. The researchers then left the test subjects with a suggestion while they were under hypnosis, stating that a specific figure is always the same colour, for example: “triangles are always red.”<p><p>One of the test subjects then reported, in a completely normal and awakened state, seeing all the figures mentioned according to the colour suggested during the hypnosis.<p><p>The researchers who were measuring the subjects EEG – brain’s electrical activity – could then determine that the observation happened so quickly that it could not have been imagined or made up.<p><p>“The result of our study puts into question many central theories surrounding hypnosis as the results cannot be explained by the active and conscious use of imagination,” Sakari Kallio, a docent at Turku University, commented in a Turku University press release.<p><p>“Perceiving colours is known to be a highly automatic process,” Kallio explains, and “during the study we were able to produce an especially strong visual memory, which was activated before the test subject even became aware of the shown stimulus.”<p><p>Kallio told YLE that the results increase the potential use of hypnosis and could be more extensively applied in the medical field in treating different phobias, addictions and weight problems.<p><p>The use of hypnosis still remains limited within the medical field, despite its centuries-old tradition in medicine. But the arrival of modern hypnotherapy has led to the revival of medical hypnosis and it is being applied more extensively in nations such as Great Britain and Sweden while remaining rather moderate in Finland, Dr. Markus Sundblom, a hypnotherapist at Eira Hospital in Helsinki, explains.<p><p>“In Finland, there are only a few dozen properly educated hypnotherapists who have a medical background in psychology or dentistry,” Sunblom said.<p><p>Sundblom, who uses hypnosis during psychotherapeutic sessions, explains that “a lot of it has to do with treating different stress related illnesses and these kinds of psychosomatic syndromes like anxiety or then these sort of burnouts that stem from the body and mind going into overdrive.”<p><p>The treatment method can also be applied when addressing different fears and phobias such as dental fear, or to ease often painful symptoms of psychosomatic disorders like irritable bowel syndrome (IBS), to anything from mental practice to more difficult mental illnesses.<p><p>...<p><p>RASMUS HETEMÄKI HELSINKI TIMES PHOTOS: MALTMANIACS.COM / DONALDSON LITH. CO. <p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-10-10T10:23:52+03:00", "type": "health"}
{"title": "Bipolar affective disorder is not easy to diagnose", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/7969-bipolar-affective-disorder-is-not-easy-to-diagnose-2.html", "review": "", "content": "<p>Diagnosis was a relief and disappointment for Päivi Storgård.<p><p>A mother with small children calls 112 after having collapsed on the kitchen floor because of mental problems. No ambulance arrives, however, because “mothers with small children are always a little tired”.<p><p>This is how Päivi Storgård describes bipolar affective disorder in her book. Even though the book, called Keinulaudalla, is a work of fiction, the experiences described in it are true.<p><p>It often takes years before bipolar affective disorder is diagnosed. The patient doesn’t necessarily understand that they are sick during a manic phase and fail to mention the episode to their doctor.<p><p>According to a specialist in psychiatry Minna Sadeniemi, the average time it takes to get a diagnosis after the first symptoms have occurred is eight years. Sadeniemi says that a diagnosis cannot be given if the patient’s first symptoms are similar to depression: the disorder cannot be identified until the first manic or hypomanic episode hits.<p><p>“The patient can feel so good during the period of elevated mood that they don’t feel sick,” Sadeniemi explains.<p><p>Journalist Päivi Storgård says that it took six years for her to be properly diagnosed.<p><p>“At first, I was treated for depression, which is absolute poison for a person with bipolar disorder because the medication is completely wrong,” Storgård explains.<p><p>Storgård was partially relieved to get the correct diagnosis. Finally there was an explanation for why she was behaving like she was and why life sometimes felt so difficult.<p><p>“On the other hand, it was a huge disappointment and loss because I thought that now I have a mental disorder, which makes me a bad person.<p><p>It was difficult for me to understand that it is an actual disease. It is not a question of my own choice.”<p><p>...<p><p>LIISA KUJALA – STT Taru Laiho – HT LEHTIKUVA / PIHLA LEHMUSJOKI <p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-10-10T10:15:12+03:00", "type": "health"}
{"title": "In good health", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/7487-in-good-health-2.html", "review": "", "content": "<p>A variety of experiences are had every day in Finnish hospitals by patients and their families.<p><p>Few topics have been so endlessly discussed and so bitterly disputed during the past few years as the future of Finnish healthcare. In an era where more and more people use private services, the public system can appear to some to be unwieldy and inefficient. On the other hand, others perceive it to be a massive step up from services on hand in a lot of other Western countries.<p><p>Amidst the variety of perspectives, here are the experiences of three residents living in the Capital Region: Debora, from Italy and now living in Tammisalo; Elisa, who lives in Pohjois-Haaga; and Frank from The Netherlands, who now lives in Vantaa.<p><p>Debora’s story<p><p>My daughter Amelia (7) was suffering from vomiting and diarrhoea, and seemed very weak. She got worse during the afternoon, so I decided to take her to Lastenklinikka. To make matters worse, my younger daughter Minea (5) was also developing symptoms.<p><p>We got there at around 19.30, and a nurse quickly took blood tests and isolated us, thinking Amelia might be contagious. They told us that they would get back to us with the results of the blood test, and a nurse brought rehydration liquid for Amelia. They told us that we probably wouldn’t need to stay the night, but then we didn’t see anyone for two or three hours. At around 22.00, I asked where the doctor was and was told that she was very busy. There was only the one bed, so I had to try and make a bed for Minea and myself out of two chairs. Finally, the doctor came at 00.30. They told me that Amelia would have to stay for the night and go on a drip because she hadn’t had enough liquid – and yet she had drunk exactly what we had been given. If we had been told all of this earlier, I could have arranged for a friend to take Minea, but I had kept her with me simply because we had been told that Amelia would not need to stay overnight.<p><p>In the morning we were not given any breakfast. I did ask, but was told that we would not be given any because Amelia was going to be released. So I had to buy food and juice from an automat machine.<p><p>By this time Minea had started to get worse. She was given a popsicle, so I asked if Amelia could have one as well. I was amazed that the nurse actually had to go and ask permission before giving her one!<p><p>A couple of days later Amelia was still sick, so I called a private doctor to come and see her, which cost 150 euros. He said that she needed to go back on the drip, and told us that she had been released too quickly. We went back to Lastenklinikka and this time they put her on a drip straight away. There was no bed and she was eventually released at 4:30 am. It doesn’t make any sense to me to ask a very sick child to sleep in a chair and then release her in the middle of the night. That isn’t the kind of care I would expect in Italy.<p><p>The worst of it was that I got the same virus three days later and had to spend a day at Töölö Hospital myself. I was sleeping on the floor downstairs at home because I was too exhausted to go upstairs to bed. So all three of us had Roto or Nora virus, whichever it was.<p><p>The doctors were friendly, but nobody was over 28! There didn’t seem to be anyone older or more experienced around. One seemed to be having one of his first days, asking a lot of questions that didn’t seem relevant – you have to wonder how experienced he was.<p><p>In future I would use private health care if we could afford to. But in any case we would have had to go to a public hospital for things like the drip, because private doctors cannot do those things.<p><p>...<p><p>YANNICK ILUNGA HELSINKI TIMES KUVALEHTI / VILJA VEHKAOJA / RONI LEHTI <p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-08-29T09:02:42+03:00", "type": "health"}
{"title": "Diets that change your metabolism: try them or leave them?", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/6353-diets-that-change-your-metabolism-try-them-or-leave-them-2.html", "review": "", "content": "<p>Gluten-free and protein-rich diets promise an improved metabolism and a dream body.<p><p>In many weight loss regimes, two factors are key: diet and exercise. Many of us start to eat smaller portions or opt for healthier foods, all the while putting regular exercise on our weekly schedule. However, the final outcome of our efforts does not only depend on what we put in our mouths and how much we sweat in the gym. Instead, our metabolism is an important determinant in how easily we shed those kilos.<p><p>A human’s base metabolic rate corresponds to the amount of energy an organism needs in order to function smoothly during rest, and varies according to individual characteristics – among others, genetic profiles, gender and muscle mass. Those unlucky enough to have a slow metabolism know that weight management is, to say the least, quite challenging. But despite the hereditary nature of metabolism, it can be modified with dietary habits. In fact, nowadays a worldwide trend invites people to follow diets that promise changes in metabolism and, with that, a slimmer body and an improvement in the overall well-being.<p><p>For starters, the extremely popular gluten-free diet – excluding all foods that contain gluten such as wheat bread from one’s diet – is thought to be the solution to successful weight management. This diet was initially intended for patients suffering from celiac disease, that is, a reaction to gluten that causes damage to the intestinal walls and a subsequent failure in nutrient absorption. A gluten-free diet has also been linked to an effort to improve the symptoms of diabetes.<p><p>...<p><p>ANNA MARIA ALEXANDROU HELSINKI TIMES LEHT IKUVA / ANTTI AIMO-KOIVISTO / SARI GUSTAFSSON<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-05-16T10:42:36+03:00", "type": "health"}
{"title": "Can anxiety and work stress increase your chances of having a tumor?", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/6351-can-anxiety-and-work-stress-increase-your-chances-of-having-a-tumor-2.html", "review": "", "content": "<p>A recent study published in the British Medical Journal analysed the possible correlation between job strain and risk of cancer.<p><p>Are work-related stress and pressure factors that may cause or increase the chances of getting a tumor? An analysis published in the British Medical Journal investigated whether work-related stress is associated with the overall risk of cancer.<p><p>A team, that included researchers from the Finnish Institute of Occupational Health (Työterveyslaitos) and University College London, conducted a meta-analysis compiled from 12 European studies, with a sample of more than 116,000 men and women aged 17-70 in Finland, France, Netherlands, Sweden, Denmark and United Kingdom.<p><p>The participants, all cancer-free when the study started, were studied for 12 years. The level of psychological stress was calculated using job strain – work-related stress – and analysed with parameters like age, sex, socio-economic position and consumption of alcohol and tobacco. Of the total number of people under observation, around 5 per cent was diagnosed with cancer. Even so, no relation between stress and risk of tumor was found.<p><p>Cardiac and gastroenteric – pertaining to stomach and intestines – problems, chronic fatigue, difficulty sleeping, headaches and fibromyalgia – widespread muscle pain and joint stiffness – are the most common health issues caused by stress.<p><p>“Even though it may sound easy to become ill, the reality is a bit different,” says Katriina Heikkilä, a member of the research team. “Going through a difficult time or being nervous a lot isn’t usually enough to get sick. It’s more a mix of genetic predispositions and other factors like obesity, smoking, lack of exercise, high cholesterol, diabetes and high pressure,” she adds.<p><p>...<p><p>YANNICK ILUNGA HELSINKI TIMES LEHTIKUVA / PIHLA LEHMUSJOKI<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-05-16T10:37:00+03:00", "type": "health"}
{"title": "The hazards of office work", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/5861-the-hazards-of-office-work-2.html", "review": "", "content": "<p>We are beginning to see the negative effects that long-term sedentary work can have on the human body.<p><p>IT WOULD SEEM that the average office worker has a physically low-impact job while construction sites are where the real body-breaking work takes place. However, today’s desk jockeys spend on average 6 hours per day sitting at a desk, often hunched behind a computer. As a result they suffer from numerous occupational diseases that can cause serious and sometimes permanent damage.<p><p>An occupational disease is a preventable condition that can be attributed to the workplace by a fraction of more than 50 per cent. Office workers suffer from conditions such as neck and back pain, carpal tunnel syndrome, tennis elbow, vision impairment, weight gain, and emotional stress.<p><p>Finland’s Occupational Health System<p><p>Companies in Finland are required by law to provide occupational healthcare service to their employees. This is done either internally, through private doctors, or through the public system that has occupational health centres available in each municipality. The state reimburses companies by one half for their spending in this area.<p><p>Helsinki’s Occupational Health Centre provides care to about 40,000 city workers ranging from health and social workers, to educational and economic sector workers, to manual labourers.<p><p>Jouni Silvo, an M.D. of Occupational Health at the health centre, reports about 60,000 visits to doctors per year in Helsinki alone. But he estimates that a majority of those come from about 20 per cent of the workforce.<p><p>Out of these patients, about 1/3 suffers from musculoskeletal conditions, 1/3 from infections and illnesses, and 1/3 from emotional stress, depression, or burnout. Musculoskeletal and emotional conditions are the most common amongst office workers.<p><p>Helsinki City Occupational Healthcare Statistics<p><p>Helsinki city workers = 40,000 Estimated visits to occupational health doctors per year = 60,000<p><p>Reasons for visits: 1/3 musculoskeletal conditions 1/3 sicknesses and infections 1/3 mental/ emotional stress<p><p>Costs per year: 14 million euro total 300 euro per person 2012 Reasons for sick leaves in the economic sector (2,000 people) 37% musculoskeletal 24% mental /emotional stress<p><p>Musculoskeletal Diseases<p><p>“The treatment for musculoskeletal issues often involves medication or physical therapy,” states Silvo, “But the most important thing is to assess the ergonomics at work.”<p><p>To do this, occupational health physiotherapists go to the patient’s office and check for needed ergonomic improvements. At the same time, they assess the company working life to see if employees are given enough break time and opportunities to allow their bodies free movement.<p><p>Current trends in office ergonomic improvement include standing desks which are better for circulation, arm support to reduce static load in the neck and shoulders, special chairs that allow up to 30 different sitting positions, and non-keyboard input devices such as a Wacom Tablet that use an electronic pen and tablet instead of a mouse.<p><p>John Starr, a senior art director at an advertising agency, has been working behind a computer for 12 years. Over time he developed back pain, his vision worsened, and he began gaining weight. As a result, he began feeling fatigue and depression.<p><p>“All the sitting is a viscous cycle,” Starr states. “You get more and more lethargic and it just makes you keep sitting.”<p><p>About a year ago, his company provided him with a standing desk and within weeks he noticed a difference. “My back felt better, I started shedding some extra pounds, and I got my energy back,” he said.<p><p>Mental Diseases<p><p>The treatment for emotional stress can involve medication and therapy, but most often taking a leave of absence is most effective. Again, the priority of the occupational health specialist is to meet with the workers and managers to find ways of adjusting the working life to keep the worker mentally healthy.<p><p>Markku Koskinen, a user experience digital designer, has been working behind a desk seven hours a day for 20 years. He has experienced many physical problems, but actually points to emotional stress as the biggest issue.<p><p>Last year, due to excessive workload, he reached the point of burnout and was given four months leave from his job in order to recover. However, Koskinen blames his own inability to “downshift” on his work as the reason behind the breakdown.<p><p>“When you are able to handle the stress and you’re in the flow, you don’t worry about the clock,” he says. “So it’s not necessarily pressure from clients or deadlines that is the problem, but the lack of work−life balance.”<p><p>Silvo agrees, saying that working in an office can be worse for the mind and body than performing manual labour. “Construction workers or bus drivers stop at four o’clock and are done,” he says. “Office workers often work late and then bring their work home with them thinking about it rather than relaxing.”<p><p>Prevention<p><p>The main goal of occupational healthcare systems is prevention. Specialists are constantly assessing workplaces and searching for ergonomic issues as well as company cultures, looking for ways to increase worker happiness.<p><p>“The main idea of the occupational healthcare law is to prevent problems before they occur,” Silvo states. “Our aim is to develop working life as a whole so workers don’t ever need our services.”<p><p>ANDY KRUSE HELSINKI TIMES LEHTIKUVA / JARNO MELA<p>", "time": "2013-03-28T14:10:18+02:00", "type": "health"}
{"title": "Fit and happy for the summer", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/5859-fit-and-happy-for-the-summer.html", "review": "", "content": "<p>Summer is fast approaching, which can be a cause of pressure for many.<p><p>AS THE YEAR changes and Christmas treats remain but a distant memory, summer seems to be the next big thing to look forward to. For some, however, this is quite a stressful prospect, as wearing less clothing is a motivator for looking better and fitter. Finns have a term for being fit for the summer, kesäkunto.<p><p>People have different methods for becoming fit. Not everyone wants to lose weight, but merely increase excercise and healthy living habits as the gloomy wintertime and somber mood subside and joyous and active summer leisure kicks in.<p><p>Different diets may be tested for losing weight, but it should be kept in mind that everyone is an individual and bodies react differently to different methods of weight loss. Methods that are too drastic are always somewhat dangerous, with possibly severe effects.<p><p>The much-debated low-carb diet relies on a low consumption of carbohydrates and an often increased intake of fat or proteins. The diet places emphasis on digestion instead of limiting calories. Foods high on starch and sugar are replaced by vegetables and natural fats.<p><p>The low-carb diet has been advocated by the US doctor Robert Atkins, whose Atkins diet is highly popular and based on a low intake of carbohydrates. It relies on ketosis, which refers to an increased level of ketone bodies in the system, either due to a diet or fasting. The Atkins diet reduces the level of insulin, due to a reduced consumption of carbohydrates, which is why these low-carb diets have been used with diabetes patients.<p><p>Be realistic<p><p>Besides eating healthy and eating less, or following a particular diet, exercise is the key to getting in shape for the summer. Sofia, 24, exercises regularly and trains boxing. When asked if she changes her diet during the early months of the year or spring, she answered: ”I don’t change my diet, as I try to eat healthy throughout the year. I do often increase exercise, as outing opportunities are better than during winter.”<p><p>She has specific tips for those who wish to get fit for the summer. ”Increase sports and eat small portions of food 5-7 times a day. Don’t cut your intake of calories too drastically, for that results in gaining weight later. Drinks lots of water and avoid sugar. Don’t set standards that are too high, be realistic,” she says.<p><p>A major problem for dieters and exercise enthusiasts is a lack or motivation, or even lack of company. It is often easier to fully invest in gym or sports if you have a friend with similar goals to encourage and accompany you. It is also important to find the eating habits and exercise routines for each individual. Some prefer the solitude of a gym session, while others enjoy group activities.<p><p>The Internet as well as women’s magazines have sections dedicated entirely to kesäkunto. Diet tips, exercise methods and expert advice are something to be looked into, if a personal routine for the summer is still lacking. The commonly held view seems to indicate that the combination of a proper diet and enough exercise is the way to go.<p><p>Naturally, healthy living habits should be maintained all year around, though the dark and freezing winter days are a challenge for those who live in Finland. Nevertheless, it is good to immerse yourself into something as useful as getting in shape. Needless to say, the benefits of exercise go beyond a bikini-body; they pave the way for lighter days.<p><p>ANNIKA RAUTAKOURA HELSINKI TIMES LEHTIKUVA / ROOPE SALONEN<p>", "time": "2013-03-28T13:57:53+02:00", "type": "health"}
{"title": "An Arctic birth", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/5283-an-arctic-birth-2.html", "review": "", "content": "<p>Many of us would be extremely nervous to give birth if we lived hundreds of kilometres from the nearest hospital. But that’s just the way it is in northern Finland.<p><p>THE PEOPLE of northern Finland share in the magic of childbirth just like any of us in the urban areas. However, the experience can be quite different, as the round-trip to the hospital can be as long as 500 km.<p><p>One couple from Lappland, Kaisa Salo and Tommi Taimi, gave birth last winter to a healthy little boy named Pessi. They live just outside Muonio, 230 km from the Rovaniemi hospital.<p><p>Although their situation might seem precarious to many of us, it did not bother the couple. “We were not really worried about it,” Salo remarked. “Normally people around here aren’t.”<p><p>Almost everyone giving birth in these remote parts call the local health centre soon after the labour starts, and wait for the ambulance instead of driving their own car. They then make the several hour journey to the closest hospital.<p><p>Mobile labour<p><p>Salo happened to go into labour during a heavy snowstorm. Nonetheless, after a few hours at home with contractions, they called the health centre in Muonio. On the snowy roads, the ambulance took 45 minutes to arrive at their house and then another three hours to get them to Rovaniemi.<p><p>Inside the ambulance, Salo was strapped down, immobile. She did not mind this either. “I actually enjoyed the moving vehicle for my labour,” she said. “The motion was quite relaxing.”<p><p>Everything went smoothly for the couple. They made it with plenty of time and little Pessi was born safely in the hospital.<p><p>Ambulance birth<p><p>Things are not always that easy. Sometimes the coming baby arrives a little early, and the birth happens in the back of the ambulance.<p><p>The local midwife in Muonio, Outi Palojoensuu, has been in the profession for over 20 years. She reports that an ambulance birth occurs in one out of five children in her area. This represents approximately six births a year.<p><p>She will usually accompany the birthing couple on the road trip. With no doctor on board, the possible birth is in her hands. “Even though we prefer a hospital birth,” Palojoensuu says calmly, “it is always special for me to be the one to deliver the baby.”<p><p>The ambulances are well prepared with the necessities for giving birth and Palojoensuu has only had smooth experiences. However, all births on the road are natural, since there is no epidural available to the mother.<p><p>Safe Arrival<p><p>Once at the hospital, the care is the same as any baby born there. Because these remote hospitals are usually the only one to cover a large area, often there is only room for the mother to stay with the baby after birth. This was the situation for Taimi, who went to stay in a hotel room for the night.<p><p>Soon, with both baby and mother doing well, it was time for the new happy family to make the long drive back home. For this trip, however, Salo was not strapped down. She was able to relax in the back seat of their own car with her little boy while Taimi steered them safely home.<p><p>ANDY KRUSE HELSINKI TIMES LEHTIKUVA / KAISA SIREN / TAUNO KOHONEN / KAISA SALO<p>", "time": "2013-02-07T10:31:20+02:00", "type": "health"}
{"title": "Liquor, tar and sauna – excuse, myth or an option?", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/5281-liquor-tar-and-sauna-excuse-myth-or-an-option.html", "review": "", "content": "<p>“JOS ei viina, terva ja sauna auta, niin tauti on kuolemaksi” is an old Finnish proverb basically meaning that if liquor, tar and sauna won’t help, an illness is fatal. In the old times, when the availability of medical treatments and medicine was a little more on the poor side, people resorted to myths and folklores, probably to console their despair. Some even claim these three “alternative treatments” actually did the trick, but modern medicine is of the opposite opinion.<p><p>Finns just love their sauna, it’s no secret. Back in the old days it advanced hygiene, and after combining it with ice swimming in the freezing cold water, Finns went crazy for this sport, which is said to be “good for your health” and “refreshing for your body and mind”. But actually for those with a heart condition, sauna and ice swimming bears an actual risk of resulting to a heart attack. Even sauna alone, taken to extremes, can result in death. However, experts do admit that sauna can have a relaxing effect, which is good for the health.<p><p>Finns are sometimes said to get drunk for any possible reason. Whether it was Easter or Christmas or even the birthday of a pet, Finns might celebrate it with a night out in the town. Some Finns also seem to crack the bottle in order to cure flu or a sore throat, based on the belief it kills bacteria. Back in the old days, alcohol was actually used externally, for example to disinfect wounds. Still, there is no medical evidence that drinking alcohol is an alternative to proper medication.<p><p>Tar, acclaimed to have been formed from the sweat of Väinämöinen, a central character from the Finnish national epic Kalevala, was an important medicament to the former-day Finns. Tar actually did bear antiseptic features, which worked as a cure for infections. Lately tar has been recognised to include parts that can cause cancer, and the European Union has urged that its use should be avoided.<p><p>ANNI RAJASTO HELSINKI TIMES LEHTIKUVA / HEIKKI SAUKKOMAA<p>", "time": "2013-02-07T10:23:02+02:00", "type": "health"}
{"title": "The state of parkinson’s disease in Finland", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/5280-the-state-of-parkinson-s-disease-in-finland-2.html", "review": "", "content": "<p>PARKINSON’S Disease is not a new disease, nor a new challenge. In spite of the disease’s many unknowns, the Finnish health system and its stakeholders are becoming more effective in supporting individuals living with Parkinson’s as well as leading innovative research to find a cure.<p><p>More than 15,000 people in Finland live with the disease, which has symptoms ranging from a slight tremor to loss of voice to depression and physical incapacitation. The composition and intensity of symptoms are as individual as the patients are, making treatment and research challenging.<p><p>Supporting Parkinson’s patients<p><p>One of the greatest challenges faced today by the Parkinson’s community is awareness. Much remains to be done to better educate and inform the public and medical practitioners about the process of diagnosing Parkinson’s as well as the options for treatment and care. In the same vein, educating doctors about the importance of referring patients to neurologists and movement disorder specialists is crucial to providing effective care for each individual patient.<p><p>What is it?<p><p>Parkinson’s disease is a chronic, degenerative neurological disorder that affects one in 100 people over age 60, more than 15,000 Finns and over 5 million worldwide.<p><p>What causes Parkinson’s Disease?<p><p>A definitive cause of Parkinson’s is not known, but both genetic and environmental factors are believed to play a role.<p><p>What are the symptoms?<p><p>While the symptoms manifest differently in every individual, the cardinal symptoms are resting tremor, slowness of movement, postural instability (balance problems) and rigidity.<p><p>How is it diagnosed?<p><p>There are no definitive tests to diagnose Parkinson’s disease. Health care professionals who suspect Parkinson’s in a patient will examine medical history and conduct neurological exams, looking for the presence of two or more cardinal Parkinson’s symptoms.<p><p>What treatments are available?<p><p>Most treatments attempt to control symptoms by sending more dopamine to the brain. Surgical intervention, such as deep brain stimulation, may also be appropriate. Current treatments are symptomatic in nature — the underlying disease continues to worsen. It is recommended that Parkinson’s patients be seen by a movement disorder specialist, who is usually the most up-to-date on current best practices in treatment.<p><p>That being said, Finland boasts one of the most comprehensive support networks for Parkinson’s patients. Ariel Gordin, the Chairman of the Finnish Parkinson Association, points out that Finland is ‘one of the few countries in Europe that has its own rehabilitation facilities specifically for Parkinson’s’, which provide increased access to specialised programmes that support patients through all stages of their treatment.<p><p>Those receiving Parkinson’s treatment in Finland can use the public health system, as well as visiting private clinics. Unlike other countries, these separate public and private options complement one another and work well for Parkinson’s patients. In addition, all Parkinson’s medication is 100 per cent free to patients, as are surgical procedures, including deep brain stimulation and levodopa pumps, which are used when the patient’s symptoms cannot be adequately controlled through standard medication delivery.<p><p>...<p><p>Matthew Mitchell LEHTIKUVA / HEIKKI SAUKKOMAA<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2013-02-07T10:17:05+02:00", "type": "health"}
{"title": "Docrates Cancer Center", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/4648-docrates-cancer-center-2.html", "review": "", "content": "<p>Five star treatment and first class care.<p><p>OPEN since 2009, the new Docrates Cancer Center in Jätkäsaari strives to ensure the best possible care for patients with cancer. As Siv Schalin, CEO of Docrates, explains in this interview, with access to the best treatments, latest equipment and leading experts in this field all under one roof, the patients of Docrates can experience end to end treatment in safe and assured surroundings.<p><p>Q: Tell us about yourself; who are you and how did you end up here?<p><p>My education is in business and I’ve worked in healthcare technology for 15 years. I was previously the president of GE Healthcare in Finland and also general manager for patient monitors globally. I started at Docrates as CEO in March. I believe that in general, in Finland we’ve mostly been very product oriented, but more and more I believe we can create competitive advantages in the areas of service. There’s a lot of work to do in this area and I’m inspired about developing the service concept of Docrates. .<p><p>Q: In Finland, we have the public sector for free but many people don’t use it because of its perceived lack of quality and speed. Many people choose to use private services. Do you think that time has come that people need to have more choice, or is it that when this hospital started, the founders were thinking more international?<p><p>The public sector is such that there is a lot of volume and demand for cancer services which, of course, means there isn’t as much time for each and every patient. This is why Timo Joensuu, one of the founders and our Clinical Director, wanted to create a cancer hospital where the patient actively participates in their care and is given time to understand the different alternatives. He then also saw the chance to use the latest technologies available and that is why we have invested in the state-of-the-art equipment to be able to provide the best possible care for our patients.<p><p>We also do quite a lot of clinical studies which allow us to then offer the newest treatment opportunities. For example, in radiotherapy we have deep expertise and the newest methods are standard of care for every one of our patients. In the Nordic countries we are the only cancer hospital on the private side, but we really believe there is room for both the public and private sector and that good co-operation between us is what will benefit the patient the most.<p><p>We have around 20 per cent of international patients but the rest are Finns. We have partners in some countries such as Russia, Sweden and Norway, but about half of our international patients find us through the internet. We’ve had patients from all around the world, from 30 different countries, but mostly they are from neighbouring countries or countries where there is a big need for cancer treatment.<p><p>Q: So do you co-ordinate your treatments with the public healthcare?<p><p>Yes, to some extent, and we’d like to do it more in the future. The demand for cancer treatment is so great that people will wait for a long time, between 1 to 3 months in public healthcare, which is much too long.<p><p>Q: I can imagine that when you are diagnosed with cancer it’s really a relief that someone like Docrates can take care of you.<p><p>Yes, it’s very, very important. That’s why we have an international client manager who, when the person from abroad is contacting us, can help with all the practical arrangements. Also, our employees speak nine different languages; it’s very important for our patients to be able to discuss such a delicate topic as their cancer care in their mother tongue.<p><p>Q: How many patients do you usually have at one time?<p><p>Last year we had 15,000 patient visits and we had about just under a thousand patients, so that means that there are a little under a hundred new ones per month. If people are, for example, coming to radiotherapy it takes five to seven weeks so they are here for quite a long time.<p><p>Q: How many doctors and nurses do you have?<p><p>We have six full-time doctors, and then we have approximately 15 who come here for some hours or days per week who are specialists in different cancers. Altogether we have 40 full time employees. We’ve treated more than 30 different kinds of cancer and that is why we have experts from all the different cancer areas within our staff.<p><p>...<p><p>www.docrates.com<p><p>BETH MORTON HELSINKI TIMES PHOTOS: EMIL CHALHOUB / DOCRATES<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2012-12-07T10:43:20+02:00", "type": "health"}
{"title": "The Perfect Smile", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/4646-the-perfect-smile-2.html", "review": "", "content": "<p>OFTEN taken for granted, our teeth are actually one of our most precious features, which we only tend to pay attention to when something goes wrong. HT spoke to practising dentist Eeva-Maija Ahtiainen about the changing face of dentistry and how to look after those pearly whites.<p><p>Q: Dentistry has changed a lot during the last 30 years. You’ve been practising in Helsinki for 34 years after graduating from Helsinki University’s Faculty of Dentistry. What has changed during this time?<p><p>When I got my licence I first worked with a dentist who was very experienced. She was interested in periodontal (gum) diseases, so I needed to take care of very difficult cases. While she did the periodontal surgery, I took care of the calculus (hardened dental plaque) by cleaning the teeth. I made new restorations and tried to prevent cavities by teaching the patients to take good care of their teeth. I also saw what would happen if the treatment (prophylaxis) didn’t work.<p><p>For me, the way I treat the patient has not changed much over the years, but the techniques have. For example, now I can make more beautiful fillings that actually look like part of a tooth whereas, back when I started, only amalgam fillings and the golden or metal ceramic crowns were available for the back teeth. With these materials, I could only take care of the tooth’s shape and polish it well but everybody could see that there was a restoration in the mouth. Now, I use composite materials that are more enamel-like and, when I make the restorations, I can use different shades of colours in order to make it look as natural as possible.<p><p>Q: And amalgam is now becoming history…<p><p>In Finland, some colleagues think that amalgam is strong. It’s easy to make and it tolerates more moisture during the filling procedure, but I would say that amalgam is history. It is a material with which we saved people’s teeth here in Finland because they couldn’t afford crowns all over the mouth. That’s why I started using composite on the back teeth in the 80s and I’ve used them for over 25 years. Amalgam is not forbidden these days, even for children, but it is not recommended.<p><p>Q: The general population is getting older – do they still have their own teeth?<p><p>It’s a big challenge but I have a long experience with old patients who still have their own teeth, the oldest being 99 years old. To help with this, I prefer seeing the patient every 6 months, but if it’s needed they visit me more often for cleaning or cavity treatments. When you get older the amount of saliva decreases and its quality also changes but there’s no reason why people can’t keep their teeth for as long as they need them. When young people visit me, I tell them the importance of a proper diet for their teeth, the desired frequency of cleaning, how to use dental floss, and to avoid fizzy drinks and smoking. If you start flossing at an early age and brush your teeth at least 3 times a day with toothpaste that contains fluoride, then you’ll have no dental problems when you’re in your middle age. Think about the future! There are now over 1000 different types of bacteria that have been found in the mouth cavity, but not everyone has them all. If you’re not infected by the bad bacteria by the time you turn two years old, then the good ones will take control.<p><p>...<p><p>BETH MORTON, ANNI RAJASTO hELSINKI TIMES<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2012-12-07T10:25:21+02:00", "type": "health"}
{"title": "Throw your old brush away!", "url": "http://www.helsinkitimes.fi/themes/themes/health-a-wellbeing/4644-throw-your-old-brush-away.html", "review": "", "content": "<p>ANYONE who has sees an X-ray picture taken from the head of a child for the first time, is in for a surprise. The scene is almost horror-movie like, with two rows of teeth one over the other, inside the jaw and the palate bones. We are all born with all the teeth we are going to have in our mouth for the rest of our lives.<p><p>Taking care of the dental hygiene goes back to the early human history and the beginnings of civilization, and the instruments of this task have evolved constantly.<p><p>There is a vast amount of research on how to brush your teeth and how many times, what toothpaste to use and how to floss. The advantage of using electrical toothbrushes has been confirmed in many of those results. The difference compared to hand movement is enormous. Both dentists and electrical toothbrush makers have been trying to convince the last die-hards to convert to electrical.<p><p>Now Oral-B has come up with a revolutionary new product which could help the last hand-held brushers convert and many of the electrical brush users change to this new model. It has taken Oral-B seven years to develop the unique TriZone technology, which combines the best of manual and electric brushing. Trizone is promised to remove 100 per cent more plaque than with manual brushing. TriZone brush head is a change back to the traditional longer form after many Oral-B models with the rounded head, moving in half circles. TriZone’s brushes move sidewise and there are three distinct areas of movement.<p><p>TriZone comes in different models with the high end Smart series on the top. Smart eries include a wireless timer, which not only tells you how long you have brushed your teeth, but also when to change quarters. A red light warns you about pressing too hard, so bye bye bent brush heads!<p>", "time": "2012-12-07T10:16:45+02:00", "type": "health"}
