{"title": "Temporary homes enter rental market", "url": "http://www.helsinkitimes.fi/themes/themes/housing/11979-temporary-homes-enter-rental-market.html", "review": "", "content": "<p>To give us a mortgage, the bank required that we sell our old home before buying a new one. Now we've exchanged contracts on our old place, which leaves us in a quandary: where will we live until we find a new house?<p><p>House-owners who need to move out because of renovation work on drains face the same dilemma: they also need to find a short-term home, while landlords expect tenants to sign a one-year lease.<p><p>Do we need to go to my mother-in-law's?<p><p>There is no need to do that, says Johannes Kangas, the managing director of Forenom, a company specialising in temporary accommodation solutions. According to Kangas, a family needing temporary accommodation has several options to choose from, depending on certain criteria, such as location, price and quality.<p><p>\"Location makes a big difference. A family in Martinlaakso escaping from drain work may not be able to find anything suitable in Martinlaakso.\"<p><p>If the renovation project is completed ahead of schedule, can the family terminate their rental contract?<p><p>Rental agreements are valid until further notice and tenants can choose the period of notice to be either 7 or 30 days. With the longer notice period, the rent is lower.<p><p>Short notice for possibilities<p><p>The rental housing company Sato also has furnished flats available. Sales manager Asta Immonen says that rental prices for short-term lets at Satos's HotelHome accommodation can be enquired by phoning the company.<p><p>Sato's conventional rental flats have a one-month notice period. The company has vacant flats available at all times so a temporary home can be arranged at a very short notice.<p><p>If the timetable is not too tight, the company has a wide variety of bigger family flats to offer.<p><p>Nina Stenberg, a unit director at the Realia rental company, explains that sometimes their clients hesitate to say they are only looking for a temporary home, out of fear that only wanting a short-term lease will put them at the back of the queue.<p><p>Realia also has some flats that are not in great demand and is prepared to rent these out on a short-term contract. The company has on its lists flats that are owned by private investors, companies and foundations.<p><p>Private investors usually want the tenant to sign a one-year agreement or a contract that is in effect until further notice. An agreement valid until further notice can usually be terminated by paying the rent for a one- or two-month notice period.<p><p>Stenberg says that a rental flat can always be found if the tenant is not too picky. Eastern Helsinki and Espoo have got more rental flats available than the central Helsinki.<p><p>Few months on offer<p><p>Kim Jolkkonen, the real estate development director at VVO says that the company has flats available all the time, also small flats, which are sought after at the moment.<p><p>\"We don't offer hotel-like accommodation for a couple of weeks, but we are happy to accept tenants for a few months,\" says Jolkkonen.<p><p>The majority of the VVO flats have a one-month notice period.<p><p>So there are plenty of options for people looking for short-term accommodation, even though a quick search online may give a misleading impression.<p><p>To date, Vuokraturva is the only rental housing company to have turned the quandary faced by people changing houses into a product.<p><p>The company launched a relocation service, through which tenants can find a rental flat for up to 8 months.<p><p>Why did Vuokraturva not grab the business opportunity earlier?<p><p>\"Because it's not easy to turn this into a profitable business,\" answers Timo Metsola, the managing director of the company.<p><p>The service offers a solution for the company's own clients who may need a temporary home or are looking for a short-term tenant for their property.<p><p>\"The landlord may be looking for a short-term tenant because they are going abroad or then drain renovation is set to start in a few months' time,\" explains Metsola.<p><p>\"We turn what was originally intended to be a long-term let into short-term contracts. That way, there is plenty of choice.\"<p><p>Taru Taipale – HS Niina Woolley – HT ©HELSINGIN SANOMAT Image: Kimmo Mäntylä / Lehtikuva<p>", "time": "2014-09-14T11:12:59+03:00", "type": "housing"}
{"title": "District heating price to surge – price hikes of 70 per cent possible by 2020", "url": "http://www.helsinkitimes.fi/themes/themes/housing/11978-district-heating-price-to-surge-price-hikes-of-70-per-cent-possible-by-2020.html", "review": "", "content": "<p>The price of district heating may surge by 70 per cent by 2020, according to the estimates of PTT, the Finnish Real Estate Federation and the Finnish House Owners' Association.<p><p>For a family living in a 90-square metre flat this would translate into a 50-70-euro increase in the monthly energy bill, says PTT. Having already gone up by 31 per cent since July 2010, district heating prices have skyrocketed in the 2010s.<p><p>\"That's a startling figure,\" says Jukka Kero, the chief economist at the Finnish Real Estate Federation, emphasising that the 70-per cent estimate is the result of a preliminary calculation and not yet an official forecast.<p><p>Markus Lahtinen, the research director at PTT, goes along with Kero's view. \"There are still many uncertainties. However, the main point is that the district heating price will spiral. The price hikes will be dramatic and rapid,\" says Lahtinen.<p><p>Last year, the monthly cost of district heating for a block of flats in Helsinki amounted to 1.06 euros per square metre on average, accounting for almost a fifth of the average 5.65-euro maintenance fee paid by a flat owner. In Finland in general, residents paid 1.12 euros per square metre for their district heating, translating into almost a quarter of their monthly maintenance fee.<p><p>Based on these figures, a family living in a 90-square metre flat may have to pay 50 to 70 euros extra for their energy, depending on the region of the country they live in.<p><p>Tightening of regulations<p><p>The spiralling district heating costs are a result of the tightening of the carbon credit regulations for industrial emissions. To date, the carbon credit system has only played a minor role in energy prices as district heating plants have been granted free emission rights.<p><p>In future, power plants and industrial facilities emitting carbon dioxide will be granted fewer free emission rights. The resulting extra costs to companies will also be reflected in consumers' energy bills.<p><p>At the beginning of the year, the European Commission released its energy policy, part of the EU's climate programme, setting forth a 40-per cent reduction in carbon dioxide emissions from the level of 1990 by 2030 as the goal. The cost of district heating will be determined to a large extent by how the EU decides later on this autumn to implement the climate programme.<p><p>Factors that will influence the district heating cost include the changes in emission right prices, use of renewable energy in production and advances in technology.<p><p>Electricity prices may go up 30 per cent by 2020, according to PTT, the Finnish Real Estate Federation and the Finnish House Owners' Association. The owners of large detached houses with electric heating would be hit the hardest by the price hike.<p><p>Dramatic increase before 2020<p><p>A report published by the VTT Technical Research Centre of Finland earlier this year also predicts a dramatic increase in the cost of district heating already before 2020. The centre has calculated three different scenarios on how the EU climate policy will affect district heating prices but none of these figures is as steep as the rises predicted by PTT, the Finnish Real Estate Federation and the Finnish House Owners' Association.<p><p>Almost 95 per cent of blocks of flats in Finland use district heating, while in Helsinki more than 90 per cent of all houses and flats are heated via the district heating system.<p><p>District heating plants use natural gas, coal, peat and renewable energy sources, such as wood and biogas, as their fuel. Almost 80 per cent of district heating energy is generated by combined heat-and-energy power plants, as excess heat by the industry or from waste turned into biogas.<p><p>Tanja Vasama – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Sami Kilpiö / HS<p>", "time": "2014-09-13T15:30:00+03:00", "type": "housing"}
{"title": "House prices dropping in parts of Helsinki", "url": "http://www.helsinkitimes.fi/themes/themes/housing/11977-house-prices-dropping-in-parts-of-helsinki.html", "review": "", "content": "<p><p><p>Flat prices have continued to climb in the capital region this year. This is in contrast to elsewhere in the country where a slight downward trend has been seen in house prices. Even in the capital region, prices are slightly down compared with last year in certain areas. Helsingin Sanomat compared flat prices in different parts of the capital region, including in its statistics areas where at least 20 flats have been sold this year. New housing estates were not included in the list.<p><p>According to Statistics Finland, the prices of houses and flats belonging to a housing company went up by 1.6 per cent during the second quarter of the year compared with last year.<p><p>Vast regional differences are seen in the house price trends in the capital region, with prices slightly down in 21 post code areas compared with last year. For this year, price information is only available for the first two quarters of the year.<p><p>The steepest increases in prices were seen in the 00620 post code area, which includes, for example, Metsälä. In the area, the average flat prices were up by 14 per cent compared with last year. Another region with rising house prices was the 01350 post code area, which contains Hiekkaharju and Simonkylä in Vantaa.<p><p>In contrast, prices were down in the 01480 post code area, which includes Vantaa's Jokivarsi, Mikkola and Metsola. The 02310 post code area including Espoonlahti in Espoo and the 00940 area including Kontula in Helsinki also saw flat prices dropping in comparison with last year.<p><p>In the long term, owning a flat in the capital region is profitable as prices have surged by at least a third everywhere in the region since 2005.<p><p>Seeking something ready<p><p>Seppo Hämäläinen, the managing director of the Kiinteistömaailama estate agents, says that the housing market has recently undergone some structural changes, which are reflected in the statistics. A growing number of house-hunters are after a home that is ready to move in and does not require any work.<p><p>\"People are shying away from buying large houses that need more done to them than a lick of paint. There is more demand for small places in a top-notch condition, which pushes the square-metre prices up in some areas.\"<p><p>Hämäläinen speculates that price statistics are slightly misleading because the average price for small flats works out more expensive per square metre than for bigger places, which are not sold in large numbers at the moment. Work carried out in the housing company also has a huge effect on flat prices, with flats in housing companies where drains have been recently renovated commanding higher prices.<p><p>\"New drains immediately increase the square metre price by 900 euros on average.\"<p><p>Eija Miehola, a regional manager at the Huoneostokeskus estate agents, says that studio flats and one-bedroom flats are sought after at the moment. There is also some demand for affordable family flats. \"But family flats at the top end of the price range are not sold that often. That shows up in the statistics.\"<p><p>Tuuli Vattulainen – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Maria Halkilahti / HS<p>", "time": "2014-09-13T11:25:00+03:00", "type": "housing"}
{"title": "Decor of dreams for nothing", "url": "http://www.helsinkitimes.fi/themes/themes/housing/9984-decor-of-dreams-for-nothing.html", "review": "", "content": "<p>Ninni Laaksonen furnished her friend's two-bedroom flat with items collected through Facebook.<p><p>Is it possible to create a cosy and harmonious decor without spending a cent? Believing it could be done with time, patience and a little bit of ingenuity, Ninni Laaksonen (28) decided to put the idea to a test.<p><p>And so last November, Laaksonen suggested to her friend that she would furnish for her and her family the kind of home they wanted to have when they returned to Finland in March after several years spent working abroad.<p><p>Excited about the idea, the friend gave Laaksonen, an interior design enthusiast, free rein to conjure up a perfect home for them.<p><p>\"I wanted to save them from having to take a loan to furnish their home. Even getting just the essentials would have set them back thousands of euros,\" explains Laaksonen.<p><p>And the hunt for furnishings really had to start from scratch as the family of three had rented a fully furnished flat as their home abroad. The only piece of furniture they had bought themselves was their three-year-old son's bed, which they were bringing with them.<p><p>Everything else from a kitchen table to a toilet brush needed for the new home had to be found – for free. And not just anything would do as Laaksonen had an image of a home with a warm, cosy atmosphere on her mind and she wanted all the pieces to work with this plan.<p><p>Laaksonen kicked off her nest-building project by setting up a Facebook group called \"Ninni's great interior design challenge\", hoping to prompt her friends to check their cellars and cupboards for any furniture and other household items going begging but to her surprise the project attracted more widespread attention.<p><p>\"We have a cabinet going spare!\" \"Do these cushions go with the decor?\" With messages coming thick and fast, Laaksonen calculated that she was in contact with more than a hundred people.<p><p>\"We all have accumulated all kinds of stuff we don't need any more but just don't get around to getting rid of. All that is needed is someone to come and collect the extra stuff, and that person was me.\"<p><p>Diluting stress<p><p>Thanks to the deluge of offers of free bits and bobs, over the last few months she has spent plenty of time on the road in Southern Finland in her estate car picking up pieces of furniture.<p><p>\"It might sound crazy but this project has helped counterbalance the stress of day-to-day life,\" explains Laaksonen, who is currently at home with her children.<p><p>She would not have got involved in such a huge interior design project without pay for just anyone as for several months her and her family's home served as a storage space for all the furniture that had been donated while her friend was still searching for a suitable flat.<p><p>The numerous encounters with people giving away household items followed by an all-hands-on-deck call gathering friends to help with the move finally resulted in just the kind of home in eastern Helsinki that Laaksonen had planned and her friend had hoped for. \"Even though I knew it would turn out well I was still pleasantly surprised to see how good it all looked.\"<p><p>Achieving her goal<p><p>The family's English-speaking father described his new home as fantastic. Even though all the furniture in the 80-square-metre flat comes from different sources the result is not a hotchpotch of styles. Laaksonen explains that her aim had not been to reproduce an image taken from an interior design magazine but to create a cosy space where you want to spend time in.<p><p>The goal of the project is spelled out on the kitchen wall with embossed letters: home.<p><p>\"Wall stickers may not be the height of fashion any more but my friend wished for them and of course we used them as some were available,\" says Laaksonen.<p><p>The harmonious look was only made possible by her learning to say \"no, thank you\". Keeping her eye on the prize – the overall look she wanted to achieve for the flat – the interior designer did not accept everything that was offered to her free of charge.<p><p>\"Of course I was sorry to have to turn down some very kind offers.\"<p><p>Laaksonen sold the objects that did not get used on her Facebook page and spent the proceedings on a matching armchair to go with the sofa as she was not able to get the right chair for free or by swopping it for another piece of furniture.<p><p>All the finishing touches, including candles on the coffee table, are in place, but Laaksonen is not off duty quite yet, having promised to organise the house-warming party to boot.<p><p>After toasting \"Finland's most beautiful home furnished without any money\", she turns her gaze to her next project.<p><p>\"Perhaps next I'll try to get rid of all the stuff I don't need. This project has taught me that sometimes less is more.\"<p><p>Lena Nelskylä – HS Niina Woolley – HT @HELSINGIN SANOMAT Image: liisa Takala<p>", "time": "2014-04-26T15:38:00+03:00", "type": "housing"}
{"title": "Housing in suburbs going to rack and ruin – housing companies slow to launch renovations", "url": "http://www.helsinkitimes.fi/themes/themes/housing/9983-housing-in-suburbs-going-to-rack-and-ruin-housing-companies-slow-to-launch-renovations.html", "review": "", "content": "<p>The renovation of housing in suburbs going to rack and ruin must be speeded up, urges the Ministry of the Environment. Built in the 1960s and 1970s, these blocks of flats are behind with work that needs doing, with the cost of this backlog of maintenance amounting to tens of billions of euros.<p><p>Housing companies, in particular, have been dragging their feet in getting maintenance work done, largely because getting a project approved at a housing company meeting can be a long drawn-out process as the aging residents do not have money or enthusiasm for costly work.<p><p>To stall the dilapidation of suburbs, 15,000 to 20,000 flats should be renovated annually, costing billions of euros a year until the end of the 2020s.<p><p>Suburbs house around 1.5 million Finns, many of whom have their whole wealth tied to their flat.<p><p>An expert working group that was established by Housing Minister Pia Viitanen (SDP) to find ways to kick-start a renovation boom submitted its report to the minister on Tuesday.<p><p>The working group proposes that the government guarantees renovation loans for housing companies that draw up a report on the renovation needed and work plans for the next ten years. The state guarantee is likely to come under discussion soon in the budget framework talks.<p><p>Housing companies have already been able to receive interest subsidies on renovation loans but this system does not include state guarantee on the loan. With the banks tightening their loan terms particularly in small municipalities with decreasing populations, a state guarantee could make a difference.<p><p>\"We have to consider whether the current legislation needs to be changed to enable housing companies to launch renovation projects. That's something for the Ministry of Justice to do,\" says Teija Ojankoski, the head of the working group and the managing director of VAV Asunnot Oy, a rental housing company owned by the city of Vantaa.<p><p>The expert group calls for municipalities to give a helping hand to housing companies and allow the construction of extra buildings on plots in suburbs.<p><p>Selling the right<p><p>When a housing company is granted building permission for a block of flats or a terraced house to be built in the woods at the edge of the plot, the housing company can sell this right to a construction firm, earning much needed cash to pay for work on the plumbing, façade or the roof.<p><p>The working group says that some of the increase in the value of the property should be channelled into the housing company's renovation fund. In practice, municipalities should decrease the land use charges that are currently payable for any increase in the value of the property.<p><p>To make the process of constructing additional buildings run more smoothly, municipalities should cut the red tape involved in getting a building permit. The working group expressed a wish that proposed changes to city plans could be processed and decided more quickly.<p><p>\"Municipalities should draw up strategies that apply to an entire suburb, also addressing social issues such as home care for the aging population,\" says Risto Vahanen, the chair of the Board of Directors of Vahanen Oy, a company specialising in maintenance and renovations.<p><p>The group proposed two ways of curbing runaway renovation costs: joint projects and industrial working methods. Two or more housing companies can join forces in shopping around for design and construction work, creating savings and improving quality.<p><p>As the blocks of flats were built using elements, similar techniques can be applied to repairs. Preparing the elements that need replacing in factories in advance saves money and helps minimise the time the flats are unliveable.<p><p>To make the construction of additional buildings an attractive proposition for municipalities, the expert working group would establish a state infrastructure subsidy fund. Currently, the state subsidises the construction of municipal infrastructure in new suburbs to the tune of 36 million euros a year and a similar sum could allocated for the renovation of old suburbs that are in need of more than a lick and a promise.<p><p>The subsidy money could be used for work on drains and pipes along with the construction of cycling lanes and parks, if deemed necessary.<p><p>The group suggests that subsidy systems for housing companies set up to boost the construction business during the economic downturn should be abolished by 2020. Housing companies have been able to receive a 10-per cent subsidy on the cost of any repair work they have ordered.<p><p>If the housing in suburbs is not kept shipshape, the quality of accommodation will suffer and energy costs increase, affecting the value of the property.<p><p>Some of the small suburbs are located in municipalities with dwindling populations where the renovation costs might exceed the value of the property, in which case in the only feasible option is to demolish the whole building, according to the working group.<p><p>Marja Salmela – HS Niina Woolley – HT ©HELSINGIN SANOMAT Image: Kalle Koponen / HS<p>", "time": "2014-04-02T10:34:57+03:00", "type": "housing"}
{"title": "Stay connected!", "url": "http://www.helsinkitimes.fi/themes/themes/housing/8459-stay-connected-2.html", "review": "", "content": "<p>There are several ways to get on the Internet while on the go.<p><p>THESE days, being without an Internet connection is not an option in Finland. It doesn’t matter if you are at your summer cottage or skiing in the middle of nowhere, the Internet Service Providers (ISP’s) in Finland will offer you an option to connect, just by using a dongle and a SIM card.<p><p>A dongle is an Internet modem or router that does not depend on the traditional Internet cable connection to work. Thus, to obtain network access, the user only needs to insert a data SIM card into the modem. This card is available at any ISP shop in Finland.<p><p>At the moment, the market offers multiple data SIM cards with both 3G and 4G connections available. They differ in the speed of downloads. If you are not a heavy Internet user, a 3G card (21 Megabit/s) is enough to download a movie in less than an hour.<p><p>What’s new about dongles?<p><p>Many different types of dongles are available in most of the electronics shops in Finland. They have been on the market for more than three years now.<p><p>Mobile dongles are becoming common because they allow you to connect up to ten devices wirelessly from anywhere, without having an electrical port or laptop. The speed will depend on the user’s SIM card, activated in the modem (from 21 Mbit/s to 100 Mbit/s). This type of modem works off its own battery, with autonomy of up to five hours.<p><p>For instance, if you are going on a trip to Tahko with your friends, you could pack a dongle with a SIM card and upload a video of your best snowboarding jumps, while one friend downloads a movie and another plays an online video game. All of these activities can be done with the same mobile router.<p><p>...<p><p>LIA V. LEZAMA R. HELSINKI TIMES LEHTIKUVA / PEKKA SAKKI<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-11-21T11:21:36+02:00", "type": "housing"}
{"title": "On the move", "url": "http://www.helsinkitimes.fi/themes/themes/housing/8145-on-the-move.html", "review": "", "content": "<p>Moving house in Finland doesn’t need to be a daunting affair.<p><p>MOVING house is never simple, but as a foreigner, trawling the endless estate agency, private rentals and student accommodation websites using Google’s rusty “Translate Page” function can be tedious. You have already lugged your belongings halfway around the globe, and like most of us, through the generosity of in-laws and fellow travelers, have probably acquired a load more baggage..<p><p>The good news, according to Aris Hamidulla, Managing Director of Takio Real Estate Company, Helsinki is, “as long as you speak English, you’ll be okay as most of the necessary legal documents and paperwork have already been translated into English. This, coupled with Finland’s current economic climate and high unemployment rate, means that generally property prices are currently down between six and nine per cent in the Helsinki area, and between 40 and 60 per cent cheaper throughout the rest of the country.”<p><p>Finding the Area<p><p>According to Hamidulla, the first thing to do when looking for a new home is to weigh your budget against your needs. “If you need to be smack bang in the city center for whatever reason, but you only have a budget of 600 euro per month, you’ll need to accept that you’re not going to be kicking back in a 70 square metre apartment with a panoramic view of the ocean. You may however be able to find a room in a house share close to the sea if you’re willing to compromise a little.”<p><p>If, however, your private space is a little more important to you and your family, then think about moving 10 or 20 minutes outside the city. Hamidulla emphasises that even a half hour each way is not that bad for your own spot in the countryside, considering that almost anywhere in Finland comes with glorious Nordic landscapes, forests and lakes.<p><p>Transport<p><p>“First check if there are buses that meet your schedule, and if not, you may want to consider moving somewhere within walking distance of the night bus route. Otherwise weigh up the option of acquiring yourself a small car,” says Aris. It will be worth it when the weather turns cold.<p><p>Things to consider<p><p>• It is not uncommon for scam artists to advertise on websites such as craigslist and gumtree. Typical signs of a scam include emails telling potential tenants that the owner is currently out of the country on business, but if you make a deposit or security payment into their account, they will post you the key. Do not be fooled; if you do decide to rent privately, make sure to reference check your new landlords. Most Finns are cautious people too and will most likely appreciate your thoroughness.<p><p>• Remember, that after moving, Finnish law requires you to register your new address. This is a simple procedure can be done at your local post office.<p><p>• Unlike in some other European countries, most apartments in Finland are rented unfurnished.<p><p>• When leaving Finland, you need to notify the tax and registration authorities; it is recommended that you leave a forwarding address in case they need to contact you regarding any issues.<p><p>• All in all the process isn’t nearly as daunting as it seems and with friendly Finns in the moving business you should be well on your way to finding the house of your dreams.<p><p>Finding a Home:<p><p>When you have decided what type of accommodation you need, and where you will live, it is essential to contact the correct agency or people in order to find the right home. According to Hamidulla, there are a number of ways to go about this.<p><p>For student accommodation, the student accommodation program HOAS is highly recommended. “They have a comprehensive guide to applying for housing in English and will help you through the entire process from application to tenancy. Their apartments are usually of high quality and will be selectively located within close proximity to your campus. It is worthwhile noting that this process can take up to six months, so plan ahead where possible,” says Australian grad student Liam Thomas.<p><p>Student accommodation: www.hoas.fi.<p><p>Private and Municipal Rentals: www.koti.fi www.infopankki.fi www.expat-finland.com www.takio.fi<p><p>Moving Companies: www.victorek.fi, www.lainalaatikko.fi<p><p>If you live alone, you may want to consider the option of renting privately. There are hundreds of elderly individuals whose children have moved out or work abroad temporarily and they are often willing to provide high quality housing with flexible terms and conditions at an affordable rate. Infopankki and Expat Finland have loads of useful information in English regarding everything from finding accommodation to actually moving house, and it is well worth checking out their websites.<p><p>Thomas Poole HELSINKI TIMES LEHTIKUVA / RONI REKOMA / AVICTORIA KULYABKINA<p>", "time": "2013-10-24T12:02:17+03:00", "type": "housing"}
{"title": "The ABCs of insuring your home", "url": "http://www.helsinkitimes.fi/themes/themes/housing/8144-the-abcs-of-insuring-your-home-2.html", "review": "", "content": "<p>When applying for home insurance policies, there are a few things to keep in mind.<p><p>ALTHOUGH a voluntary expense, many count home insurance among their standard housing costs. In fact, home insurance is the most common voluntary insurance plan in Finland, according to a 2012 study by the Federation of Finnish Financial Services, with 86 per cent of the survey respondents (15-79 year olds) having a home insurance policy.<p><p>Moreover, the public holds an extremely favourable view of home insurance, as 92 per cent of the respondents of the same survey saw it as essential for any household. There are currently seven companies that offer home insurance, and about 2.5 million home insurance policies in total have been taken out. (The number of people with home insurance is lower as a person may have several policies.) The number has also kept growing over recent years.<p><p>When looking at homeowners and tenants separately, the study found that of the former, almost all – 96 per cent – have insured their homes. Of those renting, 67 per cent have insurance. The latter figure is on the rise, however, one likely factor being that more and more landlords require their tenants to take out a home insurance policy.<p><p>Needs define policy<p><p>Regarding tenants, Päivi Vuorenmaa, Product Manager at the insurance company LähiTapiola, points out that some may be under the impression that an insurance policy taken by their landlord or housing cooperative covers also their needs. This is not the case, as the tenant’s belongings (furniture, bicycle) and interiors of the apartment (wallpaper, parquet) are covered only by the tenant’s own insurance, even if they were damaged because of a bigger accident in the building.<p><p>There are also other benefits to a home insurance policy: it usually includes liability insurance, covering damages that are incurred on third parties, and legal expenses insurance, which concerns juridical costs. However, all policies have restrictions with regard to their coverage and amount of compensation, points out Tuomas Korkeamäki, Head of Division at the Finnish Financial Ombudsman Bureau.<p><p>When taking out an insurance policy, it is important to consider one’s needs as these ultimately define the content of the contract. “Different companies offer different plans, and it’s important to keep one’s needs in mind when looking at the content and prices of the different options.” Korkeamäki says. According to him, a good way to start when looking into taking out insurance is by getting offers from several companies.<p><p>Typically, when a detached house (omakotitalo) is insured, both the building and personal property inside are covered, whereas in an apartment the housing cooperative or the apartment’s owner has usually taken insurance that covers the real estate, but not the residents’ belongings. This, along with the size of the home, has a strong influence on the price of the insurance.<p><p>...<p><p>TEEMU HENRIKSSON HELSINKI TIMES LEHTIKUVA / MIKKA LEHTIMÄKI / SARI GUSTAFSSON<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-10-24T11:52:15+03:00", "type": "housing"}
{"title": "The Pelican philosophy: room for everything", "url": "http://www.helsinkitimes.fi/themes/themes/housing/7644-the-pelican-philosophy-room-for-everything.html", "review": "", "content": "<p>Thinking of moving? Find out how self-storage can make your life easier.<p><p>Rasmus Nalle is the title of a popular Danish children’s book, and one of its characters happens to be a pelican that keeps putting one item after another into his beak. This childhood memory must have switched a light on in somebody’s head when in 2009 a name was needed for a new business initiative based on renting storage spaces for private use. Thus, the Pelican Self Storage brand was born to prove that some animals from warmer climates can actually do very well in the snow.<p><p>“Whether you are moving abroad, changing apartments in the same city, or just going through a plumbing renovation in your building, at some point you might need to find a place to store your stuff,” explains Niklas Sontag, Operations Manager at Pelican Self Storage. “In Finland, traditionally, when people have seen themselves in these situations they have turned to their mother-in-law’s attic or to their friend’s garage [very creative ideas have popped up with regard to the issue]. So, the first challenge we had to overcome as a company was getting people to understand that there is a more appropriate solution for storage.”<p><p>The Pelican family gets bigger<p><p>It all started back in 2009, when Pelican was founded in Denmark; the same year a local operator in Helsinki, Minivarasto, was acquired.<p><p>The first Pelican sites opened in Copenhagen and Helsinki in 2010 and, in the years to follow, several more sites were established and a local operator in Sweden, SelStor, was also acquired. Now, three years after the first opening in Helsinki, the network comprises 16 sites in Finland. But it doesn’t stop there, December 2013 will see the arrival of a brand new site in Konala (Helsinki).<p><p>What’s forbidden to store, and what’s not<p><p>Wondering what isn’t<p><p>allowed to store at the Pelican site?<p><p>Here are a few definite no-no’s:<p><p>• Liquids<p><p>• Degradable food<p><p>• Flammable items<p><p>• Materials hazardous for the environment.<p><p>What is allowed?<p><p>That ugly but highly valuable piece of furniture inherited from a distant relative for which you cannot find a place in your home…but can’t get rid of it either (true story!).<p><p>More info:<p><p>pelicanselfstorage.fi<p><p>The concept was already widely present in the US with some 50,000 sites available. Meanwhile, the UK market is the most significant in this sector across the pond: the same size as the rest of mainland Europe combined. In Finland it started to take shape when an investment fund was raised by Nordic Real Estate Partners (NREP) to set up a self-storage business in the Nordic market. To get the ball rolling, the small company of Minivarasto was bought in Finland, and, in July 2010, the first Finnish Pelican facilities were opened in the Helsinki suburb of Vallila. In December 2012 the operations continued in Sweden, with the acquisition of a local brand called SelStor.<p><p>“The business is growing very rapidly,” Sontag observes. “By the end of 2013 we would have been in operation for about three-and-a-half years, and we will be counting a total of 17 different sites.<p><p>We have added a lot of capacity into a market that had been formerly underdeveloped. Our customers are mainly divided into two categories: the ones renting units for a limited period of time, such as those who are moving, and then those who think of our sites as an extension of their own home and decide to rent on a permanent basis.”<p><p>Safety guaranteed<p><p>Among the measures taken to guarantee the safety and privacy of customers’ belongings, the Pelican minds have established a system that includes a gated area for self loading to which the person has access via a personalised pin code, 24-hour closed-circuit television (CCTV) and a burglar alarm control panel connected to an ongoing security operator. Furthermore, separated units are locked with individual padlocks manufactured to solely work in the Pelican facilities. Even the “A Team” would have had a rough time trying to break in.<p><p>The other side of the coin is how to ensure all the items stored fulfil the company’s security requirements. “The contract signed by the costumer contains a very detailed description of the objects that are not permitted,” Sontag states. “We are talking about liquids, degradable food, highly flammable items, or any other hazardous material for the environment. Besides, in general, Finns always behave according to the rules, so we haven’t faced any major issues regarding this. Then, following the same logic as when you rent an apartment, all the stored items always have to be insured.”<p><p>The Pelican Self Storage business is conducted according to three parameters: clean, clear and fresh – with accessibility principles completing the equation. For instance, cars can be driven right up to the loading area, where everything has been set up to easily transport belongings to the storage unit.<p><p>Strange as it may sound, feeling pelican has never been more tempting.<p><p>EVA BLANCO HELSINKI TIMES<p>", "time": "2013-09-12T10:15:17+03:00", "type": "housing"}
{"title": "New home, sweet home", "url": "http://www.helsinkitimes.fi/themes/themes/housing/7643-new-home-sweet-home-2.html", "review": "", "content": "<p>Moving and purchasing furniture cheaply.<p><p>AUTUMN marks the beginning of a new academic year for thousands of students. Every year, between the end of August and beginning of September, numerous new students arrive in Helsinki from all over the world. Finding a flat can be quite challenging for both locals and foreigners, but moving and purchasing furniture can be hard too. Helsinki Times takes a look at some low-cost ways to relocate to a new place and find household items at good prices.<p><p>There are several stores in Finland where one can find high-quality beds, tables, chairs and all the other items needed to furnish a flat or a house. In addition to well-known chains such as Isku, Asko and Pentik, there are many other smaller stores with all kinds of furniture. There are stores and shopping centres dedicated to furniture and interior design, like Lanterna, all around the city. The main issue is that the prices offered by such stores are beyond the budget of students and many others.<p><p>Furniture deal hunting<p><p>“I will go to IKEA then,” some may think. Many consider the yellow and blue Swedish giant as the perfect place to purchase ready-to-assemble furniture cheaply.<p><p>However, there are other solutions. The website www.kirpputorihaku.com offers an overview of second-hand shops and flea markets located all around the country. With a basic knowledge of Finnish, or a quick look at the dictionary, it is relatively easy to browse a city map and find the closest shop.<p><p>Events such as Cleaning Day (Siivouspäivä in Finnish), for instance, are an excellent time to look for the best deals on household items. During this festival, which takes place a few times a year, anyone can register as a street vendor and sell all kind of items. For shoppers, this means an impressive selection of inexpensive goods.<p><p>The Helsinki Metropolitan Area Reuse Centre (Kierrätyskeskus) promotes a culture of urban recycling. People get rid of old items by simply delivering them to the Reuse Centre. The centre subsequently puts the products on sale and, in some cases, even gives them away for free.<p><p>Furnishing your dream home online<p><p>The Internet provides a few websites for people looking for furniture, such as www.huuto.net, a sort of Finland-centered eBay. Users can register in just a few seconds and get access to an incredible virtual marketplace. Used cars, electronics and household items: pretty much everything is sold on huuto.<p><p>Once an interesting item has been found, a user can either purchase it directly – by paying the specific price set by the seller – or can take part in an online auction. The seller sets the starting price and the minimum amount that possible buyers can offer, and the auction begins. Once the closing date and time are reached, the one who has bid the most wins and gets the product. At this point, the seller and the buyer negotiate the shipment fees.<p><p>Tori.fi is another online portal that offers “buy &amp; sell” opportunities for people living in Finland. Here, users go straight to business without any kind of auction. It is possible to contact a seller directly, even with a phone call, and discuss the details of a possible purchase. Both Tori.fi and Huuto.net are mainly in Finnish, but with a basic knowledge of Finnish, a dictionary or an online translator, shopping online is easy.<p><p>Netcycler.fi is the place where recyclers living in Finland meet online. On Netcycler, users can buy, sell, or even swap used items. With numerous virtual marketplaces out there, shopping has never been this easy (and cheap)!<p><p>Moving without a car? No problem!<p><p>What happens when one is in a new city and has to move into a new house, or flat? Those with a car, for instance, could simply borrow a trailer from the Helsinki Metropolitan Area Reuse Centre. By paying a 50 euro deposit, one can get a trailer for big and long items, such as beds and closets. The only requirement is to return the trailer, in the same shape as it was when borrowed, before the Reuse Centre’s closing time.<p><p>For those without a car, there are rental services such as those offered at www.pakuovelle.com. With just a phone call, one can rent a van (pakettiauto) and pay by the hour, day or week. Alternatively, it is also possible to pay a little extra and have professionals do the moving for you.<p><p>YANNICK ILUNGA HELSINKI TIMES LEHTIKUVA / PEKKA SAKKI <p>", "time": "2013-09-12T10:08:14+03:00", "type": "housing"}
{"title": "Student housing situation continues to be difficult", "url": "http://www.helsinkitimes.fi/themes/themes/housing/5365-student-housing-situation-continues-to-be-difficult-2.html", "review": "", "content": "<p>Six-month queues for international students not uncommon.<p><p>STUDENT housing continues to be a problem in Helsinki in 2013. One out of every 10 students has difficulty in getting an apartment; some new international students are still waiting for one even after six months in the queue.<p><p>“The housing situation has worsened during the past years,” says Aino Jones, board member of the Student Union of University of Helsinki, specialised in housing and international affairs. Statistics from the Foundation for Student Housing in Helsinki Region (HOAS) have shown a rapid growth in student housing applications, from about 3,500 in 2004 to nearly 7,000 in 2011. Last year, a slight improvement has been seen, as application numbers decreased to 6,000. “This year the housing queue is not quite as long as it was last year, but along the same levels anyway.”<p><p>The main reason for the shortage of student housing has been the general rise of rents in the housing market. Currently, a room in a student apartment would cost around 230 euro per month on average, but in the private market the price can rise to 400 euro per month, which can still only cover the price for a shared apartment.<p><p>“It’s quite a lot of money when you consider the budget students are able to spend on housing”, says Jones.<p><p>For new international students, the housing situation is even worse. Firstly, they do not receive student grants from the Finnish government. Secondly, they lack connections with the local market and information on other possible rental sources.<p><p>The student union has been cooperating with the City of Helsinki and HOAS to help new international students with their housing problems by providing information on the current housing situation and private housing market. They have in some cases also provided temporary accommodation for new students.<p><p>“Housing is one of our biggest operations. We are trying to influence the city into making decisions in terms of the benefit for students,” Jones says.<p><p>“It sounds like a very bureaucratic achievement, but it is very important in solving the housing problem”, says Liina Länsiluoto, Customer Relation Manager of HOAS.<p><p>Due to the shortage of student housing, HOAS has stopped providing student housing in Helsinki to students studying outside the Helsinki region. Students in Universities of Applied Sciences have also been required to accrue at least 30 credits every year in order to be able to live in a student apartment, which is higher than the number of credits required to apply for a student grant.<p><p>...<p><p>XILONG WANG HELSINKI TIMES LEHTIKUVA / MARKKU ULANDER / HANNU KIVIMÄKI<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2013-02-14T11:39:12+02:00", "type": "housing"}
{"title": "Dealing with indoor air woes", "url": "http://www.helsinkitimes.fi/themes/themes/housing/5363-dealing-with-indoor-air-woes-2.html", "review": "", "content": "<p>When looking for a new home, try and make sure you can breathe easy there before sealing the deal.<p><p>A FAMILY goes to see a house, and falls in love with it. They agree to buy it, and move in. But some time later, they start having recurrent colds or notice their asthma getting worse, and after a talk with the doctor the idea dawns on them: does our house have mould or moisture damage somewhere?<p><p>To live well, we need good-quality indoor air, which always depends on many different factors. “There is more to indoor air problems than just moisture and mould. Symptoms may also be caused by ventilation issues, particulate or gaseous impurities or fibrous matter,” says Tuula Syrjänen, repair advisor at the Pulmonary Association and the Allergy and Asthma Federation of Finland. “These problems are not exclusive to Finland. But because of our climate, most of us spend a lot of time indoors, which amplifies the importance of indoor air quality.”<p><p>“Take airborne particulate matter, for example. A lot of it comes from outside, with outdoor air, and can include dust from traffic and industrial sources as well as pollen, even from far afield, and may cause us problems indoors. But airborne particulate matter can also originate from indoors, from interior decoration materials or cooking and other activities,” Syrjänen says.<p><p>Tuula Syrjänen and the other regional repair advisors of the Allergy and Asthma Federation can be called for advice at +358 (0)20 757 5181 Tuesday-Thursday 09:00-15:00<p><p>Pointers for home hunters<p><p>How can home buyers ensure that the quality of indoor air is good? “All people can rely on their senses – their eyes and nose – in this. And they do well by asking questions from the previous owner or tenant, landlord, estate agent, housing manager, perhaps even the neighbours, to find out about any problems or repairs. The law says that those selling or letting residential property are obliged to tell the buyers or new tenants about any technical problems they know of.”<p><p>What about taking a moisture meter with you? “I don’t recommend it for laymen. You need a pro to use that gear right and, more importantly, interpret any readings the right way,” Syrjänen says. “For prospective house buyers, there are specialised engineering companies that perform indoor air inspections and condition surveys. Tenants should report indoor air problems to the landlord, who will approach the housing company, which is often represented by a housing manager; whereas apartment owners experiencing such issues should contact the housing manager, because the housing company is responsible for apartment building structures. But then there needs to be clear indications such as rotten smell, dislodged bathroom tiles or visible mould growth. Inspections should always be focused on a physical object such as a ventilation system or building structure.”<p><p> <p><p>Beware of moisture damage<p><p>• Moisture damage can affect walls, windows, ceilings, floors and the building’s foundations<p><p>• Broken pipes, broken dishwasher hose, clogged toilet, etc, commonly cause moisture damage. Subterranean water flow, bad waterproofing of exterior walls, cracks or construction defects can also cause moisture damage.<p><p>• Moisture damage can be detected by changes on the colour of walls, deterioration of paint, appearance of mould and smell.<p><p>• Exposure to mould in a closed environment can cause breathing difficulties and coughs in healthy people and babies exposed to mould in their home have a greater risk (twice) to develop asthma.<p><p>...<p><p>MIKA OKSANEN HELSINKI TIMES LEHTIKUVA / ALEKSI MAKKONEN / MARKKU ULANDER<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2013-02-14T11:29:08+02:00", "type": "housing"}
{"title": "Kalasatama: A developing haven  ", "url": "http://www.helsinkitimes.fi/themes/themes/housing/4031-kalasatama-a-developing-haven-2.html", "review": "", "content": "<p>WHAT just four years ago was a bustling harbour, at which huge cranes handled thousands of containers, is now just a vast, empty area filled with piles of rock while huge pits in the ground mark the foundations of the future suburb. This is Kalasatama, one of the biggest residential construction projects in Helsinki at the moment.<p><p>As Helsinki’s population grows, so does the need for housing, which means projects such as the one in Kalasatama. However, the project manager of the east coast area, Tuomas Hakala, doesn’t see Kalasatama as anything unusual: “Kalasatama and Jätkäsaari are biggest ones right now, but for instance the building of Vuosaari started in the 1980s and is still going on. There have also been many large constructions in the past, such as the development of Töölö some 90 years ago.”<p><p>The plans for Kalasatama are still ambitious, as housing for up to 20,000 new residents is planned. There will be 390,000 square metres of commercial space and around 45,000 square metres for local services.<p><p>• Functioned as a harbour from 1874 to 2008.<p><p>• Planning began in 2003, construction in 2009.<p><p>• The whole site covers 175 hectares and is planned to be ready in 2035.<p><p>• Will include multiple types of housing, such as floating houses and terrace houses.<p><p>• Modes of living also vary from private owned houses to student housing.<p><p>• First residents can move in this autumn.<p><p>• When finished, the tallest building will be the largest residential house in Helsinki with 33 floors.<p><p>• Estimated to create a total of 10,000 new jobs in the area during and after the construction.<p><p>Source www.uuttahelsinkia.com/kalasatama<p><p>www.ksv.hel.fi/fi/projektisivu/kalasatama/historia<p><p>www.kalasatamaan.fi/alue_historia.html<p><p>fi.wikipedia.org/wiki/Kalasatama<p><p>From factories to floating houses<p><p>Kalasatama has always been a forerunner in the development of Helsinki. In the early 1800s, Helsinki was a small city with a few thousand inhabitants. Districts such as Kallio and Sörnäinen were merely woods and farmland, with few inhabitants, and were therefore a safe place for factories. With the factories also came the need for a port closer than the one in Kauppatori. With good sea routes and close proximity to the industrial quarter, the Kalasatama harbour was founded in 1874. It boosted the economy and gave birth to districts such as Kallio and Hermanni, as the harbour workers needed cheap homes close to their jobs.<p><p>The harbour may be gone, but its shape stays in the new plan, as well as one harbour building from the 1960s and an old gas container from 1929. The spirit of seafaring will be preserved, in the form of 40 floating houses. These are buildings that do not have solid foundations, but instead are moored to concrete pontoons.<p><p>According to Hakala, they are designed to endure both winter and the waves, which reach a maximum height of one meter. “We are also building seawalls to stop the waves, but the houses are still going to swing a little, so people moving in should have some seafaring spirit in them.” Hakala says.<p><p><p><p> ...<p><p>VILLE KOSKI HELSINKI TIMES<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2012-10-18T12:03:54+03:00", "type": "housing"}
{"title": "The story of one man and his castle  ", "url": "http://www.helsinkitimes.fi/themes/themes/housing/4029-the-story-of-one-man-and-his-castle.html", "review": "", "content": "<p>CASTLES are the great edifices of fairytale, towering majestically over the landscape. Many a small child has dreamed of residing in one of these monuments of power someday, but almost all of us have given up on this fantasy.<p><p>Artist and seasoned carpenter Reino Koivuniemi was not so easily discouraged and instead decided to build one for himself and his family, one piece at a time. After years of hard labour, the impressive four-story Hiidenlinna was ready for display and opened to the public.<p><p>“That first summer in 1991, we had some 15 000 visitors, the same amount that visited the president’s official residence, so that was something else,” Koivuniemi said.<p><p>The idea first took shape while he was working as a doorman at Hotel Hämeenlinna in Somero, and had time to plan during the small hours. Inspiration soon followed after he went to see some of the greatest self-made constructions in Finland: “Not the ones financed by loads of community money but the ones put together out of one person’s creativity and skill – amazing artists – the ones whom I truly appreciate.”<p><p>Koivuniemi had obstacles to overcome right from the beginning. He was denied a building permit for his lot in Tammela in southeast Finland. “The inspector who went through the building plans didn’t think I had it in me. He looked at me, then at the papers, and thought the contrast was wrong. In his opinion I should have had an architect, which I didn’t, so that was that. But the reception at nearby Somero was wonderful, and I got to choose from nine different lakeside sites, the one I liked the most, so I had good guardian angels there.”<p><p>The actual building of Hiidenlinna was made with such a small budget that he could not afford to hire assistants. He received some help from two Estonian building craft students during two summer months, and from his son-in-law and his wife Marja Koivuniemi. But for the most part, Hiidenlinna steadily rose through his own efforts.<p><p>But the sheer workload of building Hiidenlinna took its toll on Reino. “There were times when I thought it better to just throw in the towel. But after the second floor was done, I took a week’s holiday, when my wife Marja saw just how exhausted I was. We went on a short trip as it also happened to be her 50th birthday. It helped, and afterwards I was back on my feet again.”<p><p>The bottom floor of the building has a cafeteria, with six long, heavy tables, and enough seating to host 60 guests at once. The second floor, called Hiidensali, is where most of Koivuniemi’s carvings can be found and the third floor houses the living quarters. To top it all off, there is a porch at the highest point of Hiidenlinna, with a breath-taking view of the two nearby lakes, Särkjärvi and Siikjärvi.<p><p>Some of the main attractions inside include a 5 metre-long knife (Finland’s biggest) hanging down from the lobby ceiling, and Koivuniemi’s main piece of woodcarving, “Ukkohiisi”, covering a whole wall. The ten square metre relief took him five winters to complete and includes life-sized people, 36 animals and a horizon only one centimeter thick. He made all the furniture in Hiidenlinna as well, including a longcase clock, pool table and weapons cabinet.<p><p>Koivuniemi crafted his first wooden sculpture (of an elk) when he was six, at his grandfather’s wood workshop. It is still on display at Hiidenlinna. Since then he has been involved with woodwork, although the artist in him emerged later. “As a descendant of a carpeting family, working with wood has fascinated me my whole life. I knew I could make wooden art, but unfortunately it doesn’t pay well, and I had a family to provide for, so I had to find work that did.” But after finally deciding to go ahead and build his life’s work, he quit his job at Hotel Hämeenlinna and put everything he had on the line, and the rest is history.<p><p>Hiidenlinna is currently for sale, so it’s not too late to become the king or queen of your own castle.<p><p>Rasmus Hetemäki HELSINKI TIMES<p>", "time": "2012-10-18T11:53:00+03:00", "type": "housing"}
{"title": "Sato welcomes you home", "url": "http://www.helsinkitimes.fi/themes/themes/housing/4028-sato-welcomes-you-home.html", "review": "", "content": "<p>Sato introduces a cosy and convenient alternative to hotels.<p><p>AFTER a few years on the drawing board, the Sato HotelHome apartment on Lapinlahdenkatu welcomed its first visitors, from Japan, earlier this autumn. Essentially, the HotelHome concept is to offer an alternative short-term lodging solution for both tourists and business visitors in a central and convenient, yet cosy and quiet, location in Helsinki. Visitors can experience the Finnish capital and return to their home away from home – as Sato puts it – in a prestigious Helsinki neighbourhood.<p><p>According to the manager of HotelHome, Petri Kajaan, the concept was devised by Miikka Karjaluoto, who was the customer service manager at Sato at the time. Similar short-term housing services are available abroad, and also to a limited extent in Finland, but Kajaan maintains that the impetus for developing the HotelHome concept emerged mainly from the domestic real estate market. “There is a severe lack of furnished apartments available for short-term leasing. The supply has long failed to satisfy the demand.”<p><p>Despite the booming demand, Kajaan believes that Sato can establish itself as a force to be reckoned with. “The current market is extremely fragmented and consists of a multitude of small service providers. Our competence in the real estate industry is definitely a benefit.”<p><p>For booking and other information, see<p><p>www.satohotellikoti.fi/en/<p><p>HotelHome prices vary according to demand, but long stays are rewarded with reduced prices. The minimum length of stay is one week.<p><p>Clientele<p><p>The need for a temporary housing solution like the Sato HotelHome typically stems from a change in either personal or professional life. “Personal reasons may range from renovations and water damage to divorce,” says Kajaan. Business visitors may include employees on secondment, consultants, project workers, researchers, as well as both Finnish and overseas sellers who visit Helsinki on a regular basis.<p><p>“But, there is also a growing demand from tourists, especially families,” Kajaan says. “They appreciate the cosy and quiet atmosphere, as well as the full kitchen facilities, which make their holidays so much more convenient.”<p><p>Apartments<p><p>For a variety of customers, a variety of apartments is needed. Sato’s HotelHome apartments range from 27-square metre studios to over 70-square metre two-bedroom apartments suitable for entire families. All apartments feature a fully equipped kitchen and modern electronic appliances, while complimentary services include weekly and end-of-stay cleaning, clean towels and bed linen, and a wireless internet connection.<p><p>“That alone makes our service more developed than most competitors,” Kajaan states. “Naturally, we aim to develop the concept further in order to improve the customer experience. But for now, we encourage customers to leave us feedback.”<p><p>In the building – which is accessed with a key code provided after your booking is confirmed – guests have a self-service laundry room and common sauna at their disposal. The apartments are decorated by Piritta Kokkonen, Sato’s design manager, in the vein of Finnish functionalism, with classic wooden furniture and designer lamps.<p><p>“The decor embraces the spirit of the building, which was constructed in the 1950s, and the whole neighbourhood,” describes Kajaan.<p><p>Locations<p><p>In addition to the Lapinlahdenkatu apartments, another HotelHome in Helsinki is set to open its doors on Kristianinkatu in 2013. Both locations were carefully selected from a number of Sato apartments identified as renovation targets in the preparation phase of the project, because, as Kajaan acknowledges, location is a crucial component of the HotelHome service.<p><p>“A quiet neighbourhood is a significant part of the appeal of HotelHome.”<p><p>Naturally, the availability of basic services was also a criterion used to identify the HotelHome locations. “On Lapinlahdenkatu, the nearest grocery shop is only a few minutes’ walk away. And in the near vicinity, there are a dozen restaurants from various parts of the world,” Kajaan says.<p><p>In addition, the street level of the Lapinlahdenkatu building is leased to proprietors. Therefore, HotelHome guests may enjoy indulge in a cup of coffee or a haircut before exploring the city and drop by a gym on their way back before calling it a day.<p><p>ALEKSI TEIVAINEN HELSINKI TIMES<p>", "time": "2012-10-18T11:14:59+03:00", "type": "housing"}
{"title": "Pipe renovations are at hand", "url": "http://www.helsinkitimes.fi/themes/themes/housing/4027-pipe-renovations-are-at-hand-2.html", "review": "", "content": "<p>A major overhaul may be necessary, but it may turn out quite tricky for some.<p><p>PIPE RENOVATIONS are at hand in many households, particularly in buildings built in the 1970s and 1980s. In bigger buildings, it is possible to remain in the household for the duration of the renovation, but especially in the cases of thorough pipe renewals and smaller places, it is necessary to move elsewhere temporarily.<p><p>According to a report by the Federation of Finnish Financial Services, pipe leakage causes the greatest proportion of reimbursable household damage. Up to half of all pipe renovation cases are caused by recurrent leaks. It is estimated that the real surge of pipe renovations is still ahead, as the large group of apartments built in the 1970s and 1980s reach the point of needing overhaul.<p><p>This decade will see an average of 10,000-15,000 pipe renovations per year, and even 30,000 in the 2020s. According to a statement by Jari Syrjälä, the Managing Director of construction union LVI-Tekniset Urakoitsijat, housing companies run by tenants are especially lax in maintenance and repair.<p><p>Different methods of pipe renovation:<p><p>• Traditional “open-trench” method<p><p>• Old pipes are taken out and replaced by new ones<p><p>• Requires structures to be opened<p><p>• Suited for old houses which often have moisture and asbestos problems<p><p>• Old houses often have sunken pipes, and easily situated property pipe lines<p><p>• Involves renewing electricity in the bathroom<p><p>• Often more costly and labour-intensive than other methods<p><p>• Estimated life-span of renewed pipes is up to 50 years<p><p>Coating methods<p><p>• Involves the coating of existing pipes with different materials<p><p>• Less expensive than other methods<p><p>• Not suited for locations with moisture problems or extensive damage<p><p>• May increase lifespan by up to 20 years if successful<p><p>• Finnish insurance policies on damage to coated pipe systems varies<p><p>Flue-element solution<p><p>• Flue-elements are “ready” ascending pipe elements that pipes and cables can be inserted into<p><p>• New pipes may be inserted via new routes or left where they are<p><p>• Does not necessitate opening of structures on a large scale<p><p>• Moisture insulation must be in order<p><p>• Viable solution if new pipelines are to be inserted on the surface instead of in the structures<p><p>What the pipe renovation generally stands for is the renewal of a building’s water and sewer pipelines. In the traditional renovation the estate’s moisture insulations, tiling and water fittings are also renewed, along with the main lines of the basement. Sometimes heating pipes and radiators are renewed in the course of the pipe renovation as well.<p><p>Maria Tuominen, 23 had to move back to her parents’ home as the renovation took place at her apartment from May to July. Many renovations take longer, especially if they include other refurbishments. She says it was nice to be at home as this amounted to fewer expenses, but the situation may be worse for many. The renovation itself often also causes practical problems for tenants.<p><p>“The noise was horrendous of course, for a long time. As I moved back, I was missing a shower wall panel, so the water leaked out whenever I took a shower. I tried to prevent it from leaking with towels and plastic bags, and I had to dry the bathroom after showering. The panel wasn’t installed until the end of August, and it only took about 5 minutes,” Tuominen says. “Maybe they got the panels only then, I don’t know.”<p><p>“Installing the washing machine was also very challenging. We almost had to tear out the toilet seat or sink to make the machine fit. The layout of the toilet seat is somewhat bizarre. It would have been a whole lot easier if they could have let us bring the washing machine, before installing the toilet seat and sink so that it was almost impossible to fit it between them,” Tuominen says.<p><p>Belongings and furniture need to be moved in most cases, especially technological devices and valuables, as construction companies do not account for possible damage. If possessions are left in the apartment, they need to be well covered, and they are often still covered in dust by the end of the renovation.<p><p>...<p><p>ANNIKA RAUTAKOURA HELSINKI TIMES LEHTIKUVA / HEIKKI SAUKKOMAA / JUSSI NUKARI<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2012-10-18T11:10:43+03:00", "type": "housing"}
{"title": "Home sweet home", "url": "http://www.helsinkitimes.fi/themes/themes/housing/3673-home-sweet-home.html", "review": "", "content": "<p>Furnishings fit for royalty, which combine both elegance and comfort.<p><p>IMAGINE coming home after a gruelling day at the office and being met by neutral colours and clean lines, plush upholstery and gentle lighting to rest your weary eyes.<p><p>Blending elegance with comfort is the hallmark of Cobello, a company founded 20 years ago by Seija Kytöniemi.<p><p>Step by step<p><p>From small beginnings, their speciality was loose upholstery from the elegant furniture houses of Italy.<p><p>The next step was to transform beautiful fabrics into covers and curtains custom-made for customers’ homes.<p><p>Since then, Cobello has gone from strength to strength. Expanding into the furniture market, they started importing from Italy but soon diversified. These days they source products from France, Belgium, Spain, Sweden and Denmark. However, they have never forgotten their roots, and there has always been a strong representation of Finnish furniture in their showroom.<p><p>Style<p><p>Their selection is trendy, combining New England style sans nautical influence with a touch of old England in the luxurious leather and fabric armchairs, a sense of French chic in the slim cupboards and cabinets with delicate feet, and Finnish minimalism with its clean lines.<p><p>“All products are made from wood, iron, glass and other good materials including recycled supplies,” says Arnevi Kytöniemi, managing director of Cobello. High quality is a given, whether in imports or locally-made goods.<p><p>While their stuff is swish, they cater for the newlyweds, the family of four or more, and the settled retirees who like to be surrounded by beauty. Hence, there is something for every budget. “Our price categories make it possible to place something beautiful in every home”, says Kytöniemi.<p><p>Outlets<p><p>While they are still in operation in the heart of Helsinki on Kasarminkatu, their main store is nowadays situated in Vantaa, where they obviously have a lot more space to show off their product line.<p><p>Just walking through this store, the atmosphere is so inviting that you immediately feel relaxed and ready to pop your shoes off and put your feet up. They even have a café, decorated in their style with not a hint of plastic in sight, to cater for the partner who might not be that interested in scrutinising the fabrics.<p><p>Espoo is an area with people of all levels of affluence, and is the clear choice for their next venture. This double-storey store will open its doors sometime this autumn and promises to have a home-type atmosphere with even more pleasing goods.<p><p>Niche<p><p>Where Cobello is special is that they not only offer a showroom full of furniture to wander about, but are also willing to help you select the right item and give advice on interior design and decoration. Service is the key!<p><p>VIOLETTA TEETOR HELSINKI TIMES<p>", "time": "2012-09-20T11:45:59+03:00", "type": "housing"}
{"title": "Solar energy still too expensive for Finnish homes", "url": "http://www.helsinkitimes.fi/themes/themes/housing/3672-solar-energy-still-too-expensive-for-finnish-homes-2.html", "review": "", "content": "<p>Minister of Economic Affairs planning compensations for households.<p><p>ON THE roof of the row house are six solar panels, which produce a quarter of the home’s yearly electricity consumption.<p><p>Most of the electricity is accumulated from the spring and summer sunshine, so at this time Jyri Seppälä’s – who is a director of the Centre for Sustainable Consumption and Production in the Finnish Environment Institute – panels can also spare energy for his neighbours. If something is left over, the electricity company snags it for free.<p><p>Seppälä’s home in Järvenpää is still a rarity in Finland. Christer Nyman, Executive Director of the Association for Solar Technology, estimates that there are only some tens of homes taking advantage of solar energy in Finland.<p><p>According to Nyman, the spread of home solar power is prevented by the fact that electricity companies don’t have to pay for the surplus energy that the households produce, which accumulates in the summer. At present the energy companies decide for themselves whether to pay households for the surplus electricity. Additionally, some companies charge a fee for joining the electricity grid.<p><p>Nyman says the surplus energy has to be spent in the summer, because storing electricity is too expensive.<p><p>“From an economic point of view, using solar power is not worthwhile for households at the moment”, he says.<p><p>Solar energy<p><p>• A home solar energy system costs at least six thousand euros.<p><p>• A solar power system for the home costs, together with installment expenses, 6,000-7,000 euros per kilowatt.<p><p>• A system smaller than one kilowatt is usually not worth installing in a home.<p><p>• A one-kilowatt system produces just under 900 kilowatt-hours of electricity per year.<p><p>• In Finland the use of solar power is more common at the summer cottage than at home. 50,000-60,000 cottages use solar power.<p><p>• A summer cottage system usually has 50–150 watt solar panels, and they cost 1,000-2,000 euros.<p><p>• In the summer cottage a 50-watt solar panel together with a 150 ampere-hour battery is enough for moderate lighting and the use of radio and television.<p><p>Compensating for summer in the winter<p><p>The bottleneck has also been noted in the Ministry of Employment and the Economy. Minister of Economic Affairs, Jyri Häkämies (NCP), wants to change the system so that households producing solar energy are reimbursed for their surplus electricity. His suggestion is a yearly net bill, in which the electric company compensates the extra electricity accumulated during spring and summer in the darkest part of the year, when homes must purchase electricity from the company.<p><p>In Häkämies’ proposal, electricity companies would be obligated to take net billing into use. However, the companies have expressed interest in moving into the net billing model voluntarily, so according to Häkämies it remains to be seen whether the obligation will be necessary. He will present his proposal to the government in the autumn. The proposed obligation could come into effect next year.<p><p>So far there are no intentions of supporting solar energy with a feed-in tariff, a price guarantee like the one given to wind energy.<p><p>“Just the net billing would already give significant benefits,” the minister says.<p><p>...<p><p>MARIA MANNER – HT MINNA KARKKOLA – STT LEHTIKUVA / MIKKO STIG / KIMMO MÄNTYLÄ<p><p> <p><p> <p><p> <p><p> <p><p> <p><p> <p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2012-09-20T11:36:21+03:00", "type": "housing"}
{"title": "Competition intensifies on the property listing market", "url": "http://www.helsinkitimes.fi/themes/themes/housing/1865-competition-intensifies-on-the-property-listing-market-2.html", "review": "", "content": "<p>The Etuovi, Jokakoti and Oikotie property portals compete with their prices and services.<p><p>There is intense competition for visitors and advertisements on the Finnish property listing market. The major estate agent chains have transferred their advertisements to the Jokakoti service, which they own with the MTV3 television station. Jokakoti currently has almost twice as many advertisements as its competitors, approximately 35,000.<p><p>However, Etuovi.com, owned by Alma Media and Arena Partners, and Oikotie, owned by Sanoma and other media groups, are not going to give up without a fight, even though they have lost a substantial share of their advertisements to Jokakoti. From the start of the year the drop has been as much as 30 per cent. Alma Mediapartners is holding co-determination negotiations with the employees at Etuovi.<p><p>Riikka Kouhi, Business Director at Oikotie, says that measured by visitor numbers the service provided by Sanoma is still the overriding favourite. “Would you rather sell balloons in a deserted square, or somewhere where there are lots of people? The majority of estate agents still have faith in Oikotie,” says Kouhi.<p><p>Oikotie has over 400,000 individual visitors per week. It is also particularly popular in the areas in which it has a newspaper partner, such as Helsingin Sanomat, Turun Sanomat, Kaleva, Etelä-Suomen Sanomat and the Sanoma Group’s local papers in South-East Finland.<p><p>...<p><p>NINA TÖRNUDD – STT HT LEHTIKUVA - MIKKO STIG - MARKKU ULANDER<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2012-03-29T11:42:51+03:00", "type": "housing"}
{"title": "Low rents for high earners", "url": "http://www.helsinkitimes.fi/themes/themes/housing/1858-low-rents-for-high-earners-2.html", "review": "", "content": "<p>The average person has no other option but to pay market prices for rent or take out a large mortgage.<p><p>During past decades, employers of large numbers of people owned entire blocks of houses and rented these company-owned dwellings out to the company’s own employees at a cheap rate. This guaranteed the availability of a workforce.<p><p>Renting properties to employees is no longer the done thing, and the houses have been sold. However, the company-owned flat isn’t a relic of the past and still lives on, prospering as a form of housing for company management.<p><p>“Nowadays, the company-owned dwelling is more often a fringe benefit for international experts or people in leading positions,” says Sales Director Petri Meckelborg of the real estate agency Vuokraturva.<p><p>Over three per cent rise in rents<p><p>• Last year, rents went up, on average, by 3.3 per cent in the whole country.<p><p>• The rents of capital-region houses unsupported by the state increased markedly quicker (5.2 per cent) than those located elsewhere in the country (2.7 per cent). For example, rents went up in Jyväskylä by only 0.5 per cent and in Lahti by 1.5 per cent.<p><p>• According to Statistics Finland, in the whole country rent per square metre for houses unsupported by the state was 10.74 euros. In the capital region, rent of over 14 euros per squared metre was paid, while in the rest of the country it was around 9.50 euros.<p><p>• So-called Arava flats, which are partly funded by cheap state loans, were 10.80 euros per squared metre in the capital region and just over nine euros elsewhere in the country.<p><p>The financial benefit company-owned housing brings is significant. For instance, according to Vuokraturva’s calculations, a 110 m2 four-bedroom house in the upmarket district of Kruununhaka in Helsinki that would normally cost 2,700 euros a month to rent has a value for tax purposes of only 1,240 euros a month. Moreover, the sum paid is treated like a salary when taxed. Therefore, if the person occupying the dwelling pays a 50 per cent rate of tax, like high earners do, the cost of the property for this person will be 620 euros. An average person living in the capital region will only get a 30 m2 studio apartment in Vantaa’s Myyrmäki for the same price.<p><p>Meckelborg doesn’t think that deceit is involved in the cheapness of company-owned properties; the state simply wants to support cheap accommodation, he says.<p><p>...<p><p>ANTTI AUTIO – STT ALLAN BAIN – HT LEHTIKUVA - ANTTI AIMO-KOIVISTO <p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p>", "time": "2012-03-29T11:29:09+03:00", "type": "housing"}
{"title": "Capital region plot prices for detached houses very steep", "url": "http://www.helsinkitimes.fi/themes/themes/housing/1849-capital-region-plot-prices-for-detached-houses-very-steep.html", "review": "", "content": "<p>Last year, the average price per squared metre of a plot of land for a small house was 161 euros in the capital region, while elsewhere in Finland the price was 14.2 euros, according to data released by Statistics Finland earlier this month.<p><p>Prices of plots of land consistently dropped during the whole of last year, with the trend accelerating at the end of the year. During the year, prices dropped by around three per cent in the whole country and during October-December by 10.5 per cent on the corresponding period the previous year. Conversely, prices became more expensive in the capital region during the year by almost two per cent.<p><p>In October-December last year, prices of detached houses increased throughout most of the country. The 4.3 per cent increase in detached house prices from last year seen in the capital region was the strongest. Elsewhere in the country prices went up by 0.5 per cent. Compared to July-September, prices dropped by around 0.5 per cent in the whole country.<p><p>HELSINKI TIMES LEHTIKUVA - MARJA AIRIO<p>", "time": "2012-03-29T10:47:25+03:00", "type": "housing"}
