{"title": "Study: Music lessons spur emotional and behavioural growth in children", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/13199-study-music-lessons-spur-emotional-and-behavioural-growth-in-children.html", "review": "", "content": "<p>Parents who have patiently sat through countless music recitals and questioned their sanity at encouraging all those trumpet or violin lessons need do so no longer. Even ear-splitting dissonance has an upside.<p><p>Music training not only helps children develop fine motor skills, but aids emotional and behavioural maturation as well, according to a new study, one of the largest to investigate the effects of playing an instrument on brain development.<p><p>Using a database produced by the National Institutes of Health Magnetic Resonance (MRI) Study of Normal Brain Development, researchers at the University of Vermont College of Medicine analysed the brain scans of 232 healthy children ages six to 18 specifically looking at brain development in children who play musical instruments.<p><p>\"What we found was the more a child trained on an instrument,\" said James Hudziak, a professor of psychiatry at the University of Vermont and director of the Vermont Center for Children, Youth and Families, \"it accelerated cortical organisation in attention skill, anxiety management and emotional control.\"<p><p>The cortex, or outer layer of brain, changes in thickness as a child grows and develops. Previously, Hudziak and colleagues Matthew Albaugh and Eileen Crehan found relationships between cortical thickening and thinning in various areas of the brain responsible for depression, aggression and attention problems. This research, announced last month in the Journal of the American Academy of Child &amp; Adolescent Psychiatry, was different.<p><p>\"I wanted to look at positive things, what we believe benefits child development,\" Hudziak said. \"What I was surprised by was the emotional regulatory regions. Everyone in our culture knows if I lift 5-pound, 10-pound, 15-pound weights, my biceps will get bigger. The same is true for the brain. We shouldn't be surprised we can train the brain.\"<p><p>Because the study's participants were all mentally healthy children, Hudziak thinks the positive effect of music training on those who are not could be significant.<p><p>\"A kid may still have ADHD,\" he said. \"It's the storm around it that improves.\"<p><p>Inspired by his own research, and having never learned to play an instrument, the 56-year-old Hudziak decided to take viola lessons last year.<p><p>\"I had this passion for health promotion in children, it seemed silly not to do it myself,\" he said.<p><p>Though music isn't his only health-related extracurricular activity – Hudziak also engages in regular exercise and meditation – he believes the viola lessons contribute to his overall wellness. They have not, however, contributed much to his overall playing ability – at least not yet. The sanguine psychiatrist had just one word for his viola skills:<p><p>\"Horrible.\"<p><p>Amy Ellis Nutt<p><p>The Washington Post<p><p>LEHTIKUVA / Antti Aimo-Koivisto<p>", "time": "2015-01-25T11:53:50+02:00", "type": "science-and-technology"}
{"title": "Not 'The Onion': A London college is offering a new class on selfie photography", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/13198-not-the-onion-a-london-college-is-offering-a-new-class-on-selfie-photography.html", "review": "", "content": "<p>The online satirists at The Daily Currant earned lots of laughs in September when they claimed that Boston's Emerson College would soon be launching a course on \"The Art of the Self Portrait.\"<p><p>But four months later, a London college is offering a class by almost the exact same name — and this time, it's no joke.<p><p>\"The course is a theory/practice introduction to photographic self-portraiture,\" intones a syllabus for City Lit's \"Art of Self-Portraiture.\"<p><p>\"It is conceived for students to improve their critical understanding of the photographic self-portrait, as well as a platform to develop ideas towards the creation of a coherent body of work.\"<p><p>City Lit, admittedly, isn't a conventional college; it has more in common with a continuing ed programme than an actual, degree-conferring university. That said, the British school is daring to tread where only satirists (and the occasional community college) have tread before. And it's doing so in accordance with a pretty significant trend: now more than ever, it appears that academics see the lowly self-portrait – and other maligned trappings of Internet culture – as subjects for serious academic inquiry.<p><p>Just think about some of the other buzzy college classes to make news in recent months. You can study YouTube and online porn and \"wasting time on the Internet\" — it's about time the selfie saw some of that love.<p><p>Academics are, after all, enamoured of the form: More than 2,000 belong to an informal group called The Selfies Research Network, a hub for people studying \"the artistic, economic and sociological impact of 'selfies.'\" (If you doubted, for a moment, that the lowly selfie had such wide-ranging impacts, you need only scroll through the SRN's Facebook page – where, at any moment, high falutin' academics are discussing everything from \"Marxist Feminism photo-boasting\" to Lady Gaga.)<p><p>Conferences on everything from art to anthropology have hosted panels on the selfie. An upcoming issue of the International Journal of Communication will study its sociology and ethics, considering the selfie as both as an \"act of production\" and a \"cultural signifier.\"<p><p>When you sum it all up, in fact, it's less amazing that this one school is teaching a class on the selfie... and more amazing that more colleges haven't followed suit. Sure, there are still a few, arthritic grumps out there, harrumphing the habits of the \"kids these days.\" But increasingly, mainstream academia seems to understand the selfie as a cultural artifact – and perhaps the mainstream public does, too. That would at least explain why so many people fell so easily for The Daily Currant's \"selfie class\" story in September.<p><p>\"Sometimes I read satire and wonder how long until it becomes reality,\" one woman tweeted at the time.<p><p>Apparently, no time at all.<p><p>Caitlin Dewey<p><p>The Washington Post LEHITIKUVA / Timo Aalto<p>", "time": "2015-01-24T15:51:01+02:00", "type": "science-and-technology"}
{"title": "Facebook may know you better than your friends and family, study finds", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/13197-facebook-may-know-you-better-than-your-friends-and-family-study-finds.html", "review": "", "content": "<p>Clicking “like” on Facebook on pages for Wikipedia, hugs and R&amp;B doesn’t seem like you’re giving away profound information that provides a window into your soul. How much can such benign stuff say about you anyway?<p><p>Well, plenty.<p><p>University of Cambridge and Stanford University researchers found that taking stock of an individual’s Facebook likes creates a strikingly-accurate personality assessment — even more accurate than an assessment done by friends and family. Their findings appear in a new study published on 12 January by the journal Proceedings of the National Academy of Sciences.<p><p>Researchers wanted to see how well a computer system could predict personality as measured by openness, conscientiousness, extraversion, agreeableness and neuroticisms – “the traits that human beings are especially good at predicting,” said co-lead author Michal Kosinski, a Stanford University postdoctoral fellow.<p><p>So they created a computer model that went through the Facebook “likes” of 86,220 volunteers who provided access to that data – including likes of pages, articles, musicians, books, statuses, you name it. Those volunteers also completed a 100-question surveys via the app myPersonality.<p><p>Liking traits<p><p>Researchers found certain likes correlated to particular traits. For instance, liking meditation and David Bowie correlated with liberal and artistic openness. Liking Lil’ Wayne and Mike “the Situation” Sorrentino went along with outgoing and active extraversion. Oh, and liking Wikipedia correlates with being shy and reserved; hugs with being cooperative; and R&amp;B with being with well-organised. (You can try it yourself here. It may not work if you don’t have enough likes or if they are set to private).<p><p>MyPersonality users also had their personalities judged by friends and family on Facebook via a 10-question survey, and researchers also examined roughly 30 previous studies on how well humans judged others’ personalities.<p><p>Taking all of that data into account, the researchers found that their computer model more accurately predicted an individual’s personality than actual humans could.<p><p>“We were surprised to find that actually computers are beating us at something we excel at,” Kosinski said.<p><p>Knowing someone well does make a difference in how well they can judge another’s personality. The model only needed to analyse 10 likes to outperform a person’s coworker; it needed 70 likes to do better than that person’s friend or roommate, and 150 likes to do better than a parent or sibling.<p><p>Husbands and wives seemed to know their partners best of all; the computer model needed 300 likes to outperform an individual’s spouse.<p><p>Measuring without discretion<p><p>How is it that computers do so well in measuring traits that are so innately human? Part of the reason may be because the algorithm can analyse a lot of data all at once, and it doesn’t discriminate – it has a perfect memory, so to speak. “The more likes you give to the computer, the more accurate the picture becomes,” Kosinski said.<p><p>But people, well, we carry a lot of biases. We have a tendency to project traits we think are good onto those people we like, Kosinski said. We also have short-term memory; say you just hung out with your friend last week and had a great time. You may now rate him as outgoing because of your recent experience, regardless of things that may have happened in the past, Kosinski said.<p><p>While these researchers had previously found that Facebook likes can accurately predict certain psychological and demographic characteristics, the findings of this recent study could have some major implications for the use of hard data on everything from online dating to career recruitment.<p><p>“This is an emphatic demonstration of the ability of a person’s psychological traits to be discovered by an analysis of data, not requiring any person-to-person interaction,” the authors write. “It shows that machines can get to know us better than we’d previously thought, a crucial step in interactions between people and computers.”<p><p>“Emotionally-intelligent and socially skilled machines” could be features of the not-too-distant future, Co-lead author Wu Youyou of Cambridge said in a statement. “In this context, the human-computer interactions depicted in science fiction films such as ‘Her’ seem to be within our reach.”<p><p>Limitations<p><p>Obviously, there are limitations; computer models won’t work on people without a public, digital footprint, and people may be much better equipped to judge certain traits in others.<p><p>While such a discovery may startle some, Kosinski said he isn’t a proponent of shutting down access to data, but rather providing users with the ability to control their privacy. “Companies should give users the choice if they don’t want to give you the (digital) footprint,” he said. Plus, he adds, phone and credit card companies already know so much more about you than Facebook does.<p><p>So, go ahead and like away on Facebook — just know that you may be revealing something profound in the process.<p><p>Elahe Izadi<p><p>The Washington Post LEHTIKUVA / AFP PHO TO / KAREN BLEIER<p>", "time": "2015-01-24T12:41:17+02:00", "type": "science-and-technology"}
{"title": "Study: Flu virus thrives in a cold nose", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/13163-study-flu-virus-thrives-in-a-cold-nose.html", "review": "", "content": "<p>ResearcheRs at Yale University in the US have finally found an answer to why a cold often leads to the flu. When a nose cools down in lower temperatures, the immune system's ability to stop the virus from spreading decreases.<p><p>It has long been known that the most typical cause of mucous illness, rhinovirus, increases more quickly in a cold nose than in the warmth of the lungs, but it hasn't been known why.<p><p>Most studies have focused on determining the effect of cold air directly on the virus. Now, however, researchers have changed course and given attention to the nose's immunology.<p><p>Researchers compared the cell structure in the nose mucous membrane immune system against the rhinovirus in temperatures of 37 and 33. They found that in a cold environment, the immune system's ability to prevent the proliferation of the virus was clearly diminished.<p><p>It is because of this that the virus finds it easier to proliferate in a cold environment than in a warm one, which increases the risk of mucous illness.<p><p>The researchers found that the effect of the cold environment was linked particularly to the immune system, rather than linked to a higher efficiency.<p><p>The study helps to understand why people can get a mucous illness for example on a hike in Lapland, where they don't meet another person.<p><p>It is estimated that 20 per cent of people carry asymptomatic rhinovirus in the mucous membrane of their nose at all times. If the mucous membranes get cold enough, the virus can go wild.<p><p>Proceedings of the National Academy of Sciences published the study.<p><p>Jani Kaaro – HS Alicia Jensen – HT © HELSINGIN SANOMAT LEHTIKUVA / Trond H. Trosdahl<p>", "time": "2015-01-22T11:18:00+02:00", "type": "science-and-technology"}
{"title": "First future innovation is exaggerated – then it's followed by a hangover", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/13164-first-future-innovation-is-exaggerated-then-it-s-followed-by-a-hangover.html", "review": "", "content": "<p>When did you first hear about 3D- printing?<p><p>That is, the device that builds small objects by extruding plastic string, which has avowed to change the whole industrial production of goods?<p><p>It could hardly be more than two or three years ago, unless you closely follow the tech field's publications from around the world.<p><p>Helsingin Sanomat, for example, published a longer article for the first time in the summer of 2012. Following that, expectations have been high for the new technology, with one article following the other.<p><p>In December, even oil company Shell's chairperson Jorma Ollila mulled over the technology in an interview with HS.<p><p>The long-term challenge is technological innovation, which is making breakthroughs in all fields. Of all technological innovations, Ollila considers the most significant to be robots, nanotechnology, the Internet of Things, artificial intelligence and 3D printing.<p><p>A person considering themselves aware of proportionality doesn't really understand.<p><p>Why has a robot that extrudes trivial plastic trash gathered so much media interest?<p><p>Disproportionate hype has, however, already achieved zenith with regards to 3D-printing.<p><p>Now at the top of the hype is the Internet of Things. At least, so claims consulting company Gartner in this year's report, which looks at Hype Cycles.<p><p>Gartner has published an annual report with new technological Hype Cycles for 20 years. The reports were devised to outline how new technologies and services grow from market hype and become a utility in mainstream business.<p><p>The idea was to follow how new technologies, services and trends develop over time, explains Gartner's head of research Betsy Burton on Talking Technology's audio-blog.<p><p>\"We noticed quite quickly that whenever any technology or service develops, they all evolve in a similar manner. This always happens, were it a question of technique, or for example wireless services or infrastructure,\" explains Burton.<p><p>This led to the Hype Curve, which looks at media presence and the increase and decrease of expectations of different innovations. It often happens that when a new technology is released into a broader public audience, a snowballing effect takes place.<p><p>Curve to the top<p><p>All newspapers want to write about the topic that their competitors have already written about. This is how new technology rises to the top of the hype curve.<p><p>Old wisdom dictates, however, that the significance of new technology often is overstated over an interval of two years. On the other hand, their revolutionary effect on society over the next twenty years is frequently understated.<p><p>As such, hype resulting from oversized expectations is followed by a hangover. From published articles one might deduce that all the efforts put towards companies developing new technology are just a ludicrous way to gain business.<p><p>But in reality new innovations are ripe for the market only once they have been downplayed in public – that is, when people decide that \"in fact, nothing came of this.\"<p><p>A company that has gotten stuck with old technology or an old business model could at this point potentially make its biggest error in assessment and imagine that the danger is over.<p><p>For example online shopping didn't threaten conventional shops for years, although it was a subject under plenty of discussion already by the 1990s.<p><p>Now the industry is threatened by international online shops. Domestic shopkeepers cannot sustain their business either on the street or online.<p><p>Within reach of the consumer<p><p>Some new innovations miss out on a great future. On the other hand, most hyped technology still gradually rises to the mainstream to a point where it is within the reach of the average consumer.<p><p>But is Gartner's hype curve more accurately considered as simply entertainment?<p><p>\"I can't really take it seriously,\" says futurist Risto Linturi. He compares the hype curve to a theory on the diffusion of innovations, which communications researcher Everett Rogers presented in the beginning of the 1960s.<p><p>According to the theory, 2-3 per cent of the population are daring and educated Innovators. The group who follow the Innovators are the Early Adopters, at 10-15 per cent of the population. Because they are often popular and social, following them is an Early Majority, at around 30-35 per cent of the population.<p><p>A Late Majority forms a third of the population. They are usually sceptical towards new things and they often have a lower socioeconomic status.<p><p>Laggards make up 10-20 per cent of the population. They actively oppose new innovation.<p><p>\"In the beginning, the inventors and experimenters embrace an idea. They act as excitation to external marketing and media. Of course they also speak about it because they are pioneers.\"<p><p>\"Then we move to the early majority, who are significant in their numbers, but don't speak a lot about the subject,\" describes Linturi. \"For inventors and experimenters a useless thing will also suffice. The ideas that fall off the hype curve are supposedly these,\" suspects Linturi.<p><p>The hype ends when mass media is no longer interested in the innovation.<p><p>The innovation is already familiar to the early majority. Innovators and experimenters have moved on to something new.<p><p>The laggards don't wake up to advertising, so they aren't a vital target group for the media, says Linturi.<p><p>\"So I would describe the phenomenon with more curves and theories. But of course in the beginning there is always hype when it comes to any successful, and even unsuccessful, new idea,\" says Linturi.<p><p>The Internet of Things is at the top of the hype<p><p>• The Internet of Things usually means that embedded industrial equipment is connected to the web. Each embedded device gets its own IP address. This way, the equipment is easier to control and maintain.<p><p>• The idea was already presented in the beginning of the 1990’s, but it is only recently that technology makes it possible to be part of everyday life.<p><p>• There is a similar notion regarding the everyday object’s Internet. That means, for example, that your dog’s chain has an IP address. Once embedded, you will always know where your pet is. Car tyres can be equipped with an address, giving information on when they have worn out.<p><p>Following different trends<p><p>The media in Finland doesn't always follow sensations in, for example, the United States.<p><p>\"3D-printing was a really hyped topic in the US, but not so much in Finland,\" Linturi points out.<p><p>\"The phenomenon can be compared to the Internet in the 1990's – every minister was speaking about it in every speech. Every newspaper mentioned it in every issue, even though only a few thousand Finns were using the net simultaneously.\"<p><p>\"3D-printing has a larger effect on society, but there is less talk about it,\" claims Linturi. He thinks that a certain amount of hype is necessary for things to move forwards.<p><p>\"But you have to be careful in choosing topics and timing. I have tried to be more careful after the flying car episode. The timing wasn't right. Normally it has gone better.\"<p><p>Through his family business, Linturi invested in Californian Paul Moller's project, which was the development of a flying car.<p><p>In the beginning of the century, Linturi expected that Finnish skies would embrace flying cars in 3-7 years. But we haven't seen it so far.<p><p>Linturi wrote a report for a government committee on the future titled 'Finland's one hundred new possibilities'. He also compiled a metropolitan vision for automatic traffic. He enthused robot cars. Linturi admits that even they were hype reports.<p><p>\"We are trying to give confidence to the idea that the world could look different in the future. And that we should put effort into new things. Above all, that relies on experimenters and innovators,\" says Linturi.<p><p>\"And let's hope that people aren't put off too easily – although the message that nobody ever makes a mistake is really difficult to formulate.\"<p><p>Marko Hamilo – HS Alicia Jensen – HT © HELSINGIN SANOMAT LEHTIKUVA / Jarno Mela<p>", "time": "2015-01-22T08:24:00+02:00", "type": "science-and-technology"}
{"title": "The year the world turned on Facebook", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/13121-the-year-the-world-turned-on-facebook.html", "review": "", "content": "<p>By all accounts, 2014 was a pretty ace year for genius Mark Zuckerberg and his ongoing takeover of the world.<p><p>Facebook celebrated its 10th anniversary in February and its 1.35 billionth user just nine months after that. (Stop here for a minute, because that number is worth considering: 1.35 billion. Billion. OK, continue.)<p><p>Facebook acquired Oculus, makers of a much-touted virtual reality headset, and WhatsApp, the massively popular messaging app. The company launched a steady stream of its own apps, too: Paper, Slingshot, Mentions, Messenger, Rooms. In late July, Facebook released a mobile app to provide free basic Internet service in regions of the world lacking what so many of us take for granted; that's since rolled out in Zambia, Kenya and Tanzania. And as if we needed further proof that the social network is a global powerhouse, the World Cup broke all-time records for the site: 350 million people posted about the games a total of 3 billion times.<p><p>Cracks appearing<p><p>And yet, even as Facebook strides boldly toward world domination, cracks have appeared in its once fresh-faced facade. Teens – the best indicator for Web zeitgeist – have fled the network for younger, hipper venues. In the past year, users have begun complaining about the insidious reach of algorithms, as well as the site's every incremental change. A wave of anonymous apps has begun to erode the distinctly Facebookian notion that everything you do online should be tied to your real-life name.<p><p>Perhaps most damningly, for the first time since Facebook launched in 2004, someone made a go at an overtly, intentionally anti-Facebook network. Sure, Ello sputtered out in a span of months – but it gave voice to the concerns of a million wary Facebook users, first.<p><p>In the words of one industry analyst: \"You look at Facebook and you say, 'Wow, something really changed in 2014.'\"<p><p>Much of this is, of course, nothing more than predictable backlash to Facebook's gargantuan growth. Only six or seven years ago, pundits were still dismissing it as the fringe sandbox of college students; now the company – valued at more than 200 billion US dollars – is as much a household name as Coca-Cola or Ford.<p><p>Testing loyalty<p><p>But the sheer number of controversies and culture wars that Facebook's gotten tangled in over the past year would seem to suggest something more than run-of-the-mill contrariness in the face of change.<p><p>Users practically rioted over an A/B testing experiment that, they feared, \"manipulated\" their emotions and gave Facebook psychological powers it seemed destined to abuse. Soon after, they objected to Facebook's forced rollout of a stand-alone messaging app – \"creepy\" and \"invasive,\" critics ruled – and a series of changes to the News Feed that, while arguably valuable, also increased the visibility of Facebook's mysterious algorithmic filtering.<p><p>In May, Facebook rolled out an unabashedly nosy feature called \"Ask,\" which – practically speaking – encourages users to publish more personal details than they might otherwise. A few months later, the site found itself clashing with drag performers, LGBT advocates and others over another type of personal detail: Facebook has long insisted that users operate under their \"real,\" or legal, names regardless of the context.<p><p>From a business perspective, that policy makes sense: Your identity, with all the demographics and browsing data attached to it, is exactly what Facebook sells advertisers. But from any kind of personal POV, that seems pretty crazy: It's essentially Facebook – a largely automated, algorithmic, non-human entity – telling you who to be.<p><p>\"You are the product that's bought and sold,\" intoned the widely shared manifesto of the social networking start-up Ello, which briefly billed itself as an ad-free alternative to Facebook. \"We believe there is a better way.\"<p><p>Question of identity<p><p>Ello is not the first or the only social network to challenge Facebook, of course – though it was the first to do so explicitly. A series of newly trendy anonymous apps, from Whisper and Secret to Yik Yak and newcomer After School, have all questioned the identity ethos at the heart of Facebook. On Whisper or Yik Yak, you do not have to be friends with your college professor or your cousin's neighbour or your office cubemate; you do not have to share your relationship status or your current location; you can be anyone or no one, and either is OK, and no one (or no thing) will tell you otherwise.<p><p>To members of Facebook's LGBT exodus, that premise was enticing. (In the wake of the real-name spat with Facebook, users signed-up for Ello at a rate of 4,000 per hour.) But even to casual users, the promise of an empowering, validating social network – one that put users' humanity before its own corporate concerns – was like straight-up manna. Tech writers were all too eager to anoint Ello the \"Facebook-killer,\" or predict it would \"steal Facebook's lunch.\"<p><p>\"Facebook may be the biggest... social network around,\" Jeremy Quittner wrote over at Inc. \"But that doesn't mean the competition isn't giving it hot flashes.\" (We interpret the odd reference to menopause as a commentary on the fact that Facebook's audience increasingly skews toward the middle aged.)<p><p>Ello has, of course, cycled out of the tech hype cycle just as fast as it cycled in. Facebook made nice with the LGBT community, ushering some of Ello's earliest adopters back into the FB fold; the site faded from Google searches and social mentions; a quick browse through Ello's proffered model profiles shows that many have only posted once or twice in the past week. A Facebook killer, this is not.<p><p>Self damage<p><p>But truth be told, maybe Facebook needs no killer: the site is doing quite enough damage to itself. Just last week, Facebook became embroiled in a new controversy after it pushed a celebratory \"Year in Review\" feature to all users' pages. For the writer and Web consultant Eric Meyer, Facebook surfaced a photo of his recently deceased 6-year-old. (\"It's been a great year! Thanks for being a part of it,\" the package's tagline read, while partying clip art figures danced around Meyer's daughter's face.)<p><p>\"Yes, my year looked like that. True enough. My year looked like the now-absent face of my little girl,\" Meyer wrote on his blog. \"And I know, of course, that this is not a deliberate assault... Algorithms are essentially thoughtless. They model certain decision flows, but once you run them, no more thought occurs. To call a person 'thoughtless' is usually considered a slight, or an outright insult; and yet, we unleash so many literally thoughtless processes on our users, on our lives, on ourselves.\"<p><p>It's a criticism of Facebook, or at least an epiphany about Facebook, that many have apparently experienced this year: when human relationships and identities are moderated by algorithm, particularly for profit, bad things happen. Inevitably! There are simply more variables in life than a string of code could ever account for. There are too many shades and expressions of personal identity, too many internal irrationalities and inconsistencies, too many secrets and whispers and emotional baggage for an algorithm to encode. That shortfall can leave us feeling anxious. Or dehumanised. Betrayed by the site, even.<p><p>Of course, the hordes of people who left Facebook in 2014 didn't usually articulate their concerns that way. A study out shortly before Christmas, by the research firm Frank N. Magid Associates, found that 6 per cent of high-schoolers abandoned the site in the past year. A much larger survey, this one conducted by the Pew Research Center last year, found that 61 per cent of all Facebook users have taken long breaks from the network and when asked why they went on hiatus, users most frequently said they were busy or bored or considered Facebook a \"waste\" of their time.<p><p>Facebook, unsurprisingly, sees itself in a different light. Early this month, the social network published a typically flashy, feel-good \"year in review\" for itself; the resulting video recounts the \"moments, places and people that moved us in 2014\" – a pretty bold claim, when you think about it, since Facebook is basically equating the stuff you post on Facebook with the stuff that matters most to you.<p><p>After winding through a series of news events and celebrity deaths, the video ends on a screengrab of a Facebook status: \"Feeling connected,\" it reads. Thumbs up.<p><p>Alas, there may be no better symbol for Facebook's long year of discontent.<p><p>Caitlin Dewey The Washington Post LEHTIKUVA / Roni Rekomaa<p>", "time": "2015-01-10T13:59:17+02:00", "type": "science-and-technology"}
{"title": "Nordic eating habits top favoured Mediterranean diet", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/13013-nordic-eating-habits-top-favoured-mediterranean-diet.html", "review": "", "content": "<p>Up to now, the Mediterranean diet has been regarded as one of most the health-improving diets; it's rich in vegetables, legumes, fruits and nuts, cereals, fish and seafood, involves moderate alcohol consumption and low consumption of meat and meat products, explains Noora Kanerva. Kanerva defended her dissertation The healthy Nordic diet, obesity and obesity-related metabolic risk factors at the University of Helsinki's Public Health Department on 28 November. However, she claims, this might be hard to adopt by Nordic people, because the food culture and resources are different.<p><p>Therefore, Kanerva and her team started researching if a suitable alternative could be the Nordic Diet, based on the Baltic Sea Diet Pyramid that scientists designed in 2011 to outline the healthier choices of Nordic people. This diet consists of foods grown in the Nordic countries, such as apples and berries, roots and cabbages, rye, oats and barley, low-fat milk products, rapeseed oil and fish. It is also low in red meat, processed meat products and alcohol. Also vegetarians and vegans can abide by the Baltic Sea diet, as it includes peas for protein and milk products that can also be made of oat to replace cows' milk.<p><p>Kanerva's research was aimed at investigating whether the Baltic Sea diet could be promoted as a healthy weight diet. This was done by assessing the eating habits of 5,024 people. Their adherence to the Baltic Sea diet was studied, and it was then deduced if and how this is associated with general obesity: body mass index and abdominal obesity, which means excessive fat around the stomach and abdomen.<p><p>The study proved that people whose menu was similar to the Baltic Sea diet were less likely to be abdominally obese, although there wasn't any association between body mass index and the Baltic Sea diet, as these two features are independent. Kanerva explains that this diet might be useful for avoiding excessive abdominal fat, as it is high in fibres from rye, oats and barley and low in alcohol consumption.<p><p>The Baltic Sea Diet Pyramid<p><p>• How to adhere to the Nordic diet?<p><p>• Choose carrots, cabbages and beetroot when you shop or eat out, especially during wintertime when locally grown tomatoes and cucumbers are not available.<p><p>• Vegetarian pea soup is a very good alternative for a meat dish.<p><p>• Use barley as a side dish instead of rice. Boiled potatoes are also good, but if you want to add a hint of salt, remember to use iodized salt.<p><p>• In the summertime, eat a lot of berries and also freeze them for the winter time to be used daily, for example, on top of oatmeal in the morning.<p><p>• Always favour rye bread.<p><p>• Use rapeseed oil as salad dressing and rapeseed oil-based margarine on top of bread and in cooking.<p><p>• Choose low-fat or fat free milk with lunch or dinner.<p><p>• Eat Nordic salmon or fresh-water fishes three times per week to maintain good vitamin D status.<p><p>Recommendations given by Noora Kanerva<p><p>Finnish obesity rates have doubled<p><p>Besides abdominal obesity, scientists who researched the group of almost 12,000 people have also found the diet to be beneficial for lowering inflammation, adds Kanerva. In other studies, where researchers have compared a group who follows the Baltic Sea diet to a group with their habitual diet, the Baltic Sea diet has been also beneficial to blood cholesterol level and weight. Swedish studies have related the Nordic diet to reduced cardiovascular risk factors and Danish researches have found an association between the consumption of Nordic foods and reduced mortality.<p><p>Kanerva, who follows the Baltic Sea diet herself, concludes that this study showed that it is possible to construct a healthy-weight diet with multiple good effects from local Nordic foods. The consumption of local foods has various benefits over using foreign foods, as growing them is cheaper and better for the environment. As these products are also well-known, it is easier for people to adapt them to their diet than foreign foods.<p><p>Although it might seem that Nordic people already adhere to this diet, Kanerva argues that there is still room for improvement when following it, especially among younger people. The study showed a stronger association between the Baltic Sea diet and abdominal obesity amongst the younger test participants, which indicates that they could benefit more from following that.<p><p>It is also important to point out that people need to change their menu significantly to ensure good outcomes, not only add a few healthy foods. Kanerva explained that if people rely on one healthy food, but the overall quality of the diet is low, all unhealthy foods in the diet might compensate for the positive effect of this healthy food.<p><p>Healthy weight management is relevant in Finland, as the rates of obesity have doubled from the years of 1980 to 2000, and the National FINRISK 2012 Study has showed that around 20 per cent of Finns are obese.<p><p>Kanerva is also continuing further with this study: her team has just collected follow-up data to confirm these results in a long-term perspective by seeing if people who adhere to the Baltic Sea diet actually lost weight or waist circumference over seven years.<p><p>Nordic superfoods<p><p>Kanerva believes that as the consumption of foreign foods is already quite high here, people should be encouraged to buy local products by governmental regulation of their taxation and support of their production. \"The use of Nordic foods could also be favoured in school meals, worksite canteens and other places where food is served publicly,\" adds Kanerva<p><p>The study has various applications. \"This diet could be used in clinical practises and schools to promote healthier food habits and also to teach about our own food culture,\" explains Kanerva.<p><p>The Baltic Sea diet could be also adopted outside Nordic countries, but it is easier in places that are located at the same latitude and there will always remain some cultural differences that make it difficult for other nations to accommodate.<p><p>On a global perspective, Kanerva argues, it could be beneficial for Nordic countries to create a strong brand out of the Baltic Sea diet for attracting tourism with specialised restaurants and boosting the transport of superfoods, like rye bread or berries. According to her view, this action could be very efficient, because Finnish chefs have a good international reputation.<p><p>Greater consumption of Nordic foods could also be profitable for the Finnish economy, as people would spend their money on locally produced products. Apart from finance, encouraging consumption of, for example rapeseed oil, rye bread or low-fat milk products, Nordic countries would also promote public health. \"After all, one of the key ideas was to show to the general public that we have a variety of great food products which we should be proud of,\" says Kanerva. \"The Baltic Sea diet has the potential to be as successful as the Mediterranean diet.\"<p><p>MERLE MUST HELSINKI TIMES<p>", "time": "2014-12-11T08:55:35+02:00", "type": "science-and-technology"}
{"title": "Study: Why so few Nobel science prizes in Finland?", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12950-study-why-so-few-nobel-science-prizes-in-finland-2.html", "review": "", "content": "<p>\"I HAVE lived in Finland for nine years and I always wondered why they had so few Nobel prizes for science,\" explains Edward Dutton, an Adjunct Professor of the Anthropology of Finnish Culture at Oulu University. Wondering how Finns have a low per capita number of Nobel Prizes, although they have higher IQ and better PISA results than other European countries, he linked this with the genetic origins of the Finns and evolutionary theories of intelligence and personality and commenced the research.<p><p>This resulted in a recent paper that Dutton co-authored with psychologists Jan te Nijenhuis from the University of Amsterdam and Eka Roivainen from Verve Rehabilitation and Research Centre in Oulu. The paper, Solving the puzzle of why Finns have the highest IQ, but one of the lowest number of Nobel prizes in Europe, was published in the September issue of a science journal Intelligence.<p><p>Conservative tendencies<p><p>The study explains that Finnish students excel on PISA tests because of the high IQ and personal characteristics of conscientiousness and agreeableness. These features, on the other hand, could also reveal why Finland has only two Nobel science prizes, and one of them was granted to Finland-Swede Ragnar Granit in Psychology or Medicine, while the other to a Finnish-speaker, Artturi Virtanen in Chemistry for his research in agricultural and nutrition chemistry in 1945.<p><p>As Finland-Swedes have different genetic background than Finns, it was drawn that Finland has only one Nobel laureate. This places Finland relatively at 28th place, above only Poland and Japan in the top 30 nations in terms of per capita Nobel prizes.<p><p>Dutton explains that Nobel prizes are predicted by extreme high IQ, which is associated with a diverse genetic background, high extraversion and low psychoticism. This is a personality dimension which is characterised by a tough-mindedness, non-conformist and risk-taking attitude. The study found that Finns have the highest IQ outside Northeast Asia, but the smallest range. This means that there are few at the extremes. However, Finns are low on the extraversion scale and high on psychoticism, resulting in that despite high IQ, they have few Nobel science prizes per capita.<p><p>\"It all made sense,\" he says. \"It fits the tendency to be conservative and a lot of new things come here much later, it's like the saying vihdoinkin Suomessa (At last in Finland).\" While they can produce high results in exams, people who are conscious, tend to be conservative, and those who are agreeable avoid challenging the system with new ideas, which doesn't lead to Nobel-worth discoveries.<p><p>...<p><p>MERLE MUST HELSINKI TIMES Image: Edward Dutton<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-12-06T09:48:09+02:00", "type": "science-and-technology"}
{"title": "Tech review: Digilehtiö", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12869-tech-review-digilehtioe-2.html", "review": "", "content": "<p>Write and draw several pages of notes and designs on normal paper, connect your pad to the computer with a USB cable and continuing working on the same pages in digital form – that's what a new digital notepad Digilehtiö is all about.<p><p>The Digilehtiö writing pad is just big enough to accommodate an A4 paper block attached to it. The special pen is a normal ballpoint geared up with sensors. Grab the pen, write or draw what ever you want on the paper, connect the device to your computer via USB cable or take the SD-card out of the pad and into your card slot. It is ready to use after installing the software from a CD or Internet to the computer. The file opens up in an installed Memo Manager program where you can go on writing, typing or painting.<p><p>You can also open the file in another program such as MyScript Notes – which comes with a free 30-day-trial. MyScript can detect the handwriting and convert it into a text. This attempt was quite successful: the program managed to detect my messy handwriting almost 100 per cent, although a slight proofreading was needed. My \"paper\" was turned into \"peter\". But no worry, as the program has a learning function. You can write a designated text once and the program detects your way of scripting \"p\" or \"4\" and register them correctly next time.<p><p>The handwriting conversion doesn't support Finnish language yet, but this extension is about to come.<p><p>The final file can be saved in different formats and then sent via e-mail. The device also supports conversion to MS Word, Excel and Access. An extra Bluetooth connection for sending the files to an Android mobile device is also available.<p><p>Digilehtiö<p><p>• A digital writing pad that saves everything written and drawn on the paper to a digital version.<p><p>• Up to 1,000 pages of text and drawing can be written before it needs to be transferred to a computer.<p><p>• The device weighs 650 g, is slightly larger than A4 format and works on AAA-batteries.<p><p>• The price of Digilehtiö is about 300 euros.<p><p>• Additional info and retail: www.digilehtiö.fi<p><p>Digilehtiö can also be used for filling in paper documents. You need to scan a form, import it to the device as a background and start filling the form or editing its layout. The changes are saved to the right place on the scanned document. Then you can save the end result as a filled or new form.<p><p>The question is, do we really need yet another device in our already tech-heavy briefcases besides our smart phones, tablets and lap tops? In that sense, Digilehtiö is probably one step backwards to a compromise solution for those who still would like to have the familiarity and ease of writing and drawing on paper, but would need to have a digital final.<p><p>...<p><p>MERLE MUST HELSINKI TIMES Digilehtiö<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-11-30T10:14:00+02:00", "type": "science-and-technology"}
{"title": "Study reveals children's risks on the Internet", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12867-study-reveals-children-s-risks-on-the-internet-2.html", "review": "", "content": "<p>Children are increasingly exposed to hate messages, cyber bullying, pro-anorexia and self-harm sites but Finnish children and parents are generally more knowledgeable about online safety than those in other countries, revealed the EU Kids Online study published this November.<p><p>\"A MATE once showed me a video about an execution. It was not fun, but insane. I got scared,\" explained one 15-year-old boy from Sweden to researchers who asked what bothers him online. This was one of the questions raised in the EU Kids Online project by European researchers from 33 countries, including Finland.<p><p>They have been studying the online behaviour of children aged 9-16 since 2006 and this latest study followed up on previous findings from 2010. It appears that since that time, children are now more likely to be exposed to hate messages (13-20 per cent), pro-anorexia sites (9-13 per cent), self-harm sites (7-11 per cent) and cyber bullying (7-12 per cent). Some 17 per cent of children also answered that they have been upset by something they've seen online in 2014, with pornography and violent content being their main concerns.<p><p>Despite this, the study also had some positive outcomes, with children now being less likely to make online contact with someone they don't know face to face. However, more are willing to meet an online contact offline.<p><p>Researchers divided participating countries into four parental categories: unprotected networkers; protected by restrictions; semi-supported risky gamers; and supported risky explorers. Finland is in the last category, as Finnish parents typically support their children and talk to them about online behaviour rather than setting restrictions.<p><p>How should parents contribute to their children's online behaviour?<p><p>• Support children's exploration of the internet from an early age and inform yourself about the benefits and the risks that the internet offers.<p><p>• Focus on enhancing children's opportunities, coping skills and resilience to potential harm.<p><p>• Think less about risk and focus instead on engaging, fun activities and positive content.<p><p>• Talk regularly with children about what they may find problematic online.<p><p>• Be clear about expectations and rules relating to online behaviour.<p><p>• Treat media coverage concerning online risks critically.<p><p>Source: Finnish researchers' recommendations, brought forth by Reijo Kupiainen of Tampere University<p><p>Children aged 3 are online<p><p>Commenting on country-specific findings, researcher Annikka Suoninen said in an interview in the report that the main finding in Finland was that there were no significant findings and that children here are fairly educated on how to act online.<p><p>Although the situation is fairly good, there are still issues that need addressing in Finland. Lecturer and researcher at Tampere University, Reijo Kupiainen, explained that while the study focused on children aged 9-16, in Finland children regularly go online at the age of three. At this age, they do not have the same safety skills as older children.<p><p>These young children should go online with the help of parents or siblings, whose duty is to be aware of their internet usage and not use the internet as a \"baby-sitter\", which Kupiainen emphasises is usually the case.<p><p>The situation in Finland could be improved further by conducting better media education in schools and even at kindergartens, says Kupiainen. This would mean incorporating media education and pedagogical use of computers and other devices into the school curriculum. Kupiainen adds that media providers must also be aware of the risks on the Internet and offer young users strong safety settings.<p><p>...<p><p>MERLE MUST HELSINKI TIMES LEHTIKUVA / KIMMO MÄNTYLÄ<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-11-29T10:08:19+02:00", "type": "science-and-technology"}
{"title": "Research: brain has special cells for recognising familiar faces", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12805-research-brain-has-special-cells-for-recognising-familiar-faces.html", "review": "", "content": "<p>An international research team has looked into how the so-called Jennifer Aniston neurons work. The researchers found that these nerve cells do not respond to a visual stimulus as such but are seemingly programmed to fire only when a face is consciously recognised.<p><p>Some nerve cells in the region of the brain called the medial temporal lobe only become activated when they encounter a very specific stimulus. A cell may only fire when the person sees a picture of Hollywood actress Jennifer Aniston, while others respond selectively to images of Halle Berry, Kobe Bryant, the leaning tower of Pisa or the person's grandmother, which is why these neurons have also been dubbed grandmother cells.<p><p>The research team with members from the UK, the US and Germany studied the functioning of these cells by presenting volunteers with manipulated pictures of famous people. The images were amalgamations of the faces of two different celebrities, with the blended pictures featuring pairings such as Whoopi Goldberg/Bob Marley, Sylvester Stallone/Arnold Schwarzenegger, Uma Thurman/Nicole Kidman and Angelina Jolie/Halle Berry.<p><p>The results showed that the neuron previously identified as the person's Whoopi Goldberg cell only fired up if the person recognised the image as Whoopi Goldberg. If the person said the picture depicted Bob Marley, the Whoopi Goldberg cell remained inactive.<p><p>When neurologist Itzhak Fried discovered the Jennifer Aniston neuron in 2012, the find sparked a lot of speculation. Many scientists believed that the cell was the terminal point of a long chain of hierarchically organised cells, which all participated in the analysis of Aniston's facial features.<p><p>Under this hypothesis, neurons analyse separate features, such as the eyes, nose, chin, cheeks and smile, and only when the criteria set for recognising the face as Jennifer Aniston are met, the Jennifer Aniston cell fires up.<p><p>Fly in the face<p><p>The new study seems to fly in the face of this theory as the neurons did not respond to a visual stimulus, but only became active when the face was consciously recognised.<p><p>But does this mean that our brains contain separate cells for all objects and events we remember? This goes against our current understanding of memory formation, according to which individual memories are carried by groups of neurons and when we retrieve memories we always partly recreate them.<p><p>This could also mean that if our Jennifer Aniston cell was for some reason destroyed we would lose all our mental images of the actor.<p><p>Research team leader Professor Rodrigo Quian Quiroga from the University of Leicester proposed that these neurons are concept cells of some kind. Once the nerve cell has stored the abstract idea of Jennifer Aniston, our brain conjures up her image when we see her, regardless of the role she is playing, or even just hear or read her name.<p><p>Jani Kaaro – HS Niina Woolley – HT © HELSINGIN SANOMAT LEHTIKUVA / Kimmo Mäntylä<p>", "time": "2014-11-23T13:01:37+02:00", "type": "science-and-technology"}
{"title": "Clean slate for your phone; smarter smartphone photos", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12786-clean-slate-for-your-phone-smarter-smartphone-photos.html", "review": "", "content": "<p>It's getting to be the season for new phones, which means it's also the high season for selling old ones. Here are tips on how to wipe your phone, safely, before you resell:<p><p>1. Take out the SIM card. The SIM card in your phone is tied to your particular plan – so there's no reason why the next owner should want it, and hanging on to it ensures that messages sent to your old phone don't end up with someone else.<p><p>2. Have removable storage? Remove it. Many Android phones offer users the option of using an SD card to augment the amount of storage on their phones. Before you sell or get rid of your phone, be sure to take back any storage card you've put in, to make sure that your files stay with you. Apple users don't have expandable storage options.<p><p>3. Encrypt your data before you wipe it. Or just as a general rule. Encrypting your phone scrambles the data to make it unreadable to anyone who doesn't have the password to decrypt it. Any version of Android released in the past three years gives you the option to encrypt your data, normally through the security menu. (Different manufacturers may keep it in different spots.) This is, in fact, the method that Google recommends for folks who want to get rid of their old phones. \"If you sell or dispose of your device, we recommend you enable encryption on your device and apply a factory reset beforehand,\" the company said in a statement.<p><p>Tips for better pics<p><p>Here are three quick tips to better fall smartphone photos:<p><p>1. Learn how your phone deals with colour: phone cameras don't always like too many colours at once. In this case, remember that software is your friend. Companies have been steadily adding more sophisticated camera options – Apple, for example, added saturation and light control options to its standard camera app in iOS 8 — so that you can more easily adjust the pictures to fit what you're seeing rather than what's come through the lens. And if you can't find what you need in the standard app, consider adding a photo app such as VSCO Cam (free, for Android and iOS), that gives you more editing options.<p><p>2. Play with light: November is a great time also for light and shadow as we head toward winter. While there are some rules you'll want to follow for standard snapshots — faces you want to show up in shots, for example, should always be front-lit if you can avoid squinting — there are a lot of more artful shots you can take by playing around with shadows, or light shining through leaves. The beauty of a phone camera is that you're not limited by film exposures, only the phone's storage capacity. So snap away; just don't forget to delete the rejects.<p><p>3. If you have one, use the dedicated camera button on your phone: it may be hard to realize in a touchscreen world, but a lot of phones are programmed to recognise a shutter button, just like the cameras of old. In most cases, this is the \"volume up\" button on your phone, though a few phones do still have dedicated camera buttons. Using the button to take pictures instead of tapping is not only glove friendly, but also lets you steady your camera with your other hand for better pictures overall.<p><p>Hayley Tsukayama The Washington Post<p>", "time": "2014-11-23T10:31:46+02:00", "type": "science-and-technology"}
{"title": "A cloud made-in-Finland", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12788-a-cloud-made-in-finland-2.html", "review": "", "content": "<p>A Finnish company is challenging online giants with its cloud storage service.<p><p>DROPBOX, Google Drive, OneDrive, Amazon Cloud Drive... There's no shortage of options for anyone looking to put their files in the cloud. But while the biggest cloud storage services are created by US tech titans, there is now also a Finnish-made alternative.<p><p>Created by the computer security company F-Secure, Younited offers the same basic functions as its international counterparts: it gives you a cloud storage (5 GB for free, and paid options exist for those who require more) that allows you to back up files in the cloud as well as to synchronise them between several computers. It also has applications for smartphones and tablets, making it possible to access your files on the go.<p><p>However, Younited goes beyond the standard features, having a graphical interface that makes managing photos, videos and other media a more visual experience. In addition, it can be connected to other cloud services, so Younited can also be used to access files on Dropbox, Facebook, Picasa, and others.<p><p>F-Secure is not a newcomer when it comes to data security – indeed, the company has an over 25-year history in computer security. With this in mind, Younited is promoted as a secure location: \"We say NO to the prying eyes of governments and we don't sell your information to advertisers,\" is how Younited's About page puts it.<p><p>...<p><p>Teemu Henriksson HELSINKI TIMES<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-11-22T10:38:16+02:00", "type": "science-and-technology"}
{"title": "How long does your phone battery last?", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12738-how-long-does-your-phone-battery-last.html", "review": "", "content": "<p>Phone models come and go and trends wax and wane but one thing remains the same: people are always talking about how long their phone battery lasts.<p><p>Professionals in the technology field strive to conduct their tests in a manner that allows comparison between them but no magazine or website has got the resources to study all the phones and models on the market.<p><p>But the Carat app, developed by UC Berkeley and the University of Helsinki, is up to the task. Once downloaded and installed, it takes measurements of the handset to monitor how quickly the phone runs out of juice.<p><p>If the battery charge drops from 90 per cent to 80 over an hour, and similar information is gleaned from other users' phones, it can be deduced that the battery will run out in ten hours on average.<p><p>Carat has now collected measurements from almost 770,000 users from around the world over the last two years. This is the first study on phones' battery lives published based on this data.<p><p>This is how the test was carried out<p><p>Helsingin Sanomat was granted access to information on battery lives of 4,500 handsets gathered by Carat. The hundred most commonly used models in Finland were included in the comparison. The results with an error margin exceeding 10 per cent were excluded from the test.<p><p>At the University of Helsinki, Eemil Lagerspetz, Ella Peltonen and Professor Sasu Tarkoma from the NODES team were involved in the development of Carat.<p><p>Built to last<p><p>What do the results then reveal?<p><p>The top three are all Android phones: Samsung Galaxy S4 Zoom, Huawei Ascend G700 and Cat B15.<p><p>The batteries of these phones provide a good 16 hours of juice, and a whopping 19.5 hours in the case of the Samsung phone.<p><p>The top trio comprises some unusual devices as S4 Zoom is a cross between a smartphone and a compact camera, while Cat B15 is both water-proof and dust-proof.<p><p>Huawei Ascend G700, on the other hand, is a phablet, a smartphone with a large display, which also packs a lot of battery power.<p><p>Interestingly, the phones with the longest battery lives are not at the top end of the price spectrum nor do they figure among the latest models with the most extra features.<p><p>Of Apple's phones, iPhone 6 fared the best, delivering 9 hours and 15 minutes of battery life.<p><p>With the introduction of new models, Apple's phones are creeping up in the battery life standings as iPhone 3GS, the oldest Apple phone included in the test, ran out of juice already after 6 hours and 20 minutes.<p><p>Some models, such as iPhone 6 Plus, had to be excluded from the test as they have not been on the market long enough for a reliable comparison.<p><p>Nokia's Lumia phones are not included in the test as Carat is only compatible with Android and iPhone operating systems.<p><p>Limited range<p><p>One factor that should be kept in mind when looking at the results is that Carat measures active phone usage and the results do not tell how long the battery would last if the phone was not being used at all.<p><p>The more users of a certain phone model have downloaded Carat on their handsets, the more reliable the results. If the results for the battery life had a margin of error wider than 10 per cent, the phone was dropped from the test.<p><p>In contrast to conventional battery drain tests where a standard test programme is run for all the phones, the results given by Carat can vary slightly between models. Playing games drains battery power and as cheap Android phones are not as likely to be used for playing as models with more high-spec functions, their battery performance may be artificially inflated in drain tests.<p><p>One interesting fact that emerges from the results is the importance of updating your smartphone operating system.<p><p>The operating system is software that runs all the phone's basic functions, including calls and internet connections. Updates for operating systems become available occasionally and by downloading them the user can gain new functions on their phone but the effect on the battery life is hardly ever systematically evaluated.<p><p>Data collected by Carat shows that 14 operating system updates have been made available for Samsung Galaxy S II, taking the system's version number from 2.3.3 to 4.4.2.<p><p>Phones using the oldest version of the operating system had a battery life of 6.5 hours while the later version could run almost an hour longer. In fact, version 4.3 packed the most battery power, only running out of juice after 9.5 hours.<p><p>A similar trend could be observed for Apple's phones. For iPhone 4S, operating system 5 lasted for 7 hours, while with the later version 7.0.6, the battery was able to push through more than 8 hours of use.<p><p>Based on these results, updating your operating system is not a waste of time, at least in respect to the phone's battery life.<p><p>Olli Sulopuisto – HS Niina Woolley – HT © HELSINGIN SANOMAT HS / Kimmo Taskinen<p>", "time": "2014-11-16T09:50:27+02:00", "type": "science-and-technology"}
{"title": "Women take mental stress to heart", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12737-women-take-mental-stress-to-heart.html", "review": "", "content": "<p>The effects of mental stress may differ between men and women, with women more likely to suffer from negative emotions and heart diseases than men as a result of stress, finds a new US study.<p><p>The research team, led by Dr Zainab Samad, assistant professor of medicine at Duke University in the United States, examined the effects of stress on the heart as part of a larger research project. Participants, who were being treated for heart disease, were asked to take part in tasks that induced mental stress and an exercise test that caused physical strain. During tasks and in rest periods between tasks, their blood pressure and heart rate were monitored and blood samples were taken.<p><p>The researchers found that women exposed to stress were more likely than men to experience myocardial ischemia, which may lead to a heart attack. In women, stress also increased the risk of the formation of blood clots and induced more negative emotions than in men.<p><p>Dr Samad said that the findings should be taken into consideration when treating patients with a heart disease. The researchers stressed that further studies are required for better understanding of how stress reactions differ between the sexes.<p><p>Originally published in the Journal of the American College of Cardiology, the study was reported by the online news service Medical News Today.<p><p>Helsingin Sanomat Niina Woolley – HT Lehtikuva /Marja Airio<p>", "time": "2014-11-16T09:44:23+02:00", "type": "science-and-technology"}
{"title": "Curry may boost brain healing", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12736-curry-may-boost-brain-healing.html", "review": "", "content": "<p>Curry spice, the staple of Indian cuisine, has been found to have some surprising health effects. Turmeric, commonly found in curries, contains a compound which boosts the brain's ability to heal itself.<p><p>According to a BBC report, a German research group was the first to identify turmeric's health properties.<p><p>The German scientists found that in rats, a compound found in turmeric boosted the growth of nerve cells that help the brain repair itself. Certain parts of the rats' brain, known to be involved in nerve cell growth, became more active after they had been given turmeric.<p><p>The discovery could lead to the development of new drugs to treat patients suffering from Alzheimer's disease or stroke.<p><p>The researchers, however, emphasised that further studies are needed to confirm the beneficial effect of turmeric, also in humans.<p><p>To date, all the experiments have been carried out in a rat model, with promising results.<p><p>This is not the first time that turmeric has been found to have a beneficial effect on health. Previous studies have suggested that another compound found in turmeric, curcumin, could reduce inflammatory reactions in the body and even fight cancer cells.<p><p>Helsingin Sanomat Niina Woolley – HT Image: Rosemarie Särkkä<p>", "time": "2014-11-15T09:41:20+02:00", "type": "science-and-technology"}
{"title": "How genes largely determine students' success", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12669-how-genes-largely-determine-students-success.html", "review": "", "content": "<p>The idea that children can inherit the ability to get good results at school can spark heated debate. But, put simply, all this means is that children differ in how easy and enjoyable they find learning and that these differences are to a large extent explained by differences in their genes, rather than differences between schools or teachers.<p><p>We know from previous research that educational achievement in primary, middle school years and at the end of compulsory education is highly heritable. Heritability is a population statistic - it doesn't tell us anything about a single individual. It describes the extent to which differences between children can be put down to DNA differences, on average, in a particular population at a particular time.<p><p>Twins' exam results<p><p>Our new study, published in the journal Proceedings of the National Academy of Sciences, focused on the Great Britain standardised exam results at age 16, the General Certificate of Secondary Education (GCSE). We obtained exam grades from over 13,000 identical and non-identical twins from the Twins Early Development Study who were also assessed on nine broad psychological domains, including intelligence, educational self-belief, personality, behaviour problems and well-being.<p><p>Identical twins share 100 per cent of their genes, whereas non-identical twins, just like any siblings, share on average only half of the genes that vary between people. If overall, identical twins are more alike than non-identical twins on a particular trait, then this implies there is a genetic influence.<p><p>Our study showed that the mean results in the GCSE core subjects of English, mathematics and science is more heritable (62 per cent) than the nine other psychological domains (35-58 per cent) we looked at.<p><p>This means that differences in how well children perform at exams are to a large extent explained by the difference in their DNA. Importantly, it does not mean that genetics explain 62 per cent of a single child's school achievement.<p><p>Not just intelligence<p><p>When we analysed different traits, we found that educational achievement is correlated with many characteristics of children, not just intelligence. Our results indicate that these correlations are largely mediated by genetic factors. To the extent that children's traits predict educational achievement, they do so largely for genetic reasons.<p><p>Although intelligence accounts for more of the heritability of GCSE results than any other single domain, the joint contribution of children's self-belief, behavior problems, personality, well-being and their perceptions of school environment collectively account for about as much GCSE heritability as intelligence. Together with intelligence, these domains account for 75 per cent of the heritability of GCSE performance.<p><p>Indicator of equality<p><p>The children in this study were all taught the national curriculum, so to some extent received a similar education. As children's learning experiences become more similar, they begin to explain the similarities between them rather than the differences between them. As a result of these diminished environmental differences, the relative genetic influences increase. So in a way, high heritability is an indicator of equality.<p><p>For example, despite high heritability, with sufficient educational effort, nearly all children could reach minimal levels of literacy and numeracy. This is an explicit goal of education in Finland. Success in achieving that goal would reduce differences in children's educational achievement, which could change heritability. Hypothetically, if all environmental effects on individual differences (such as educational inequality) were to be minimalised, then the heritability estimate for educational achievement would be 100 per cent.<p><p>Personalised learning<p><p>So what to make of this? Genes are important, not just in educational achievement or intelligence, but in a whole raft of other traits which contribute to how easy and enjoyable children find learning. Education is more than what happens passively to a child. Children are active participants in selecting, modifying and creating experiences that are matched to their genetic predispositions. In genetics, this is known as \"gene-environment correlation.\"<p><p>At the practical level, our findings add support for the trend in education toward personalized learning rather than a one-size fits all model. None of this means that schools, parents or teachers aren't important. Of course they are – and each has an important role in helping children achieve the best of their potential.<p><p>Eva Krapohl is a Ph.D. student at King's College London. She received a master's degree in developmental neuroscience from University College London and Yale University.<p><p>Kaili Rimfeld is a Ph.D. student at the Institute of psychiatry, psychology and neuroscience at King's College London.<p><p>This article was originally published on The Conversation: www.theconversation.com/uk.<p><p>Eva Krapohl and Kaili Rimfeld The Washington Post LEHTIKUVA / Roni Rekomaa<p>", "time": "2014-11-09T12:40:39+02:00", "type": "science-and-technology"}
{"title": "People unwittingly give up their eldest child for free Wi-Fi – Public hotspots may hide nasty surprise", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12668-people-unwittingly-give-up-their-eldest-child-for-free-wi-fi-public-hotspots-may-hide-nasty-surprise.html", "review": "", "content": "<p>A number of Londoners unwittingly agreed to give up their first-born child in exchange for free Wi-Fi access, reported the British newspaper The Guardian recently.<p><p>The questionable terms and conditions people were asked to sign up to were part of an experiment carried out to study risks involved in the use of free Wi-Fi connections. Organised by the Cyber Security Research Institute, the experiment was sponsored by Finnish information security company F-Secure.<p><p>According to The Guardian, F-Secure were not planning to enforce the Herod clause of the term and conditions. \"While terms and conditions are legally binding, it is contrary to public policy to sell children in return for free services, so the clause would not be enforceable in a court of law,\" the company said.<p><p>European law enforcement agency Europol had given its stamp of approval to the test organised in June. When people connected to a Wi-Fi hotspot set up for the test, they were promised free internet access but only if they \"agreed to assign their first born child to us for the duration of eternity\". Six people accepted the terms and conditions.<p><p>The idea of the test was to highlight the risks involved in Wi-Fi usage and raise public awareness of them.<p><p>Hiding was easy<p><p>According to The Guardian, a mobile hotspot device built for less than 200 euros using a Raspberry Pi computer the size of a credit card, a battery pack and Wi-Fi aerial was used for the experiment. The device was so small that hiding it in a public place was easy.<p><p>After the initial Herod clause experiment, the research continued without any terms and conditions being imposed. In Westminster, where 33 devices connected to the hotspot, the researchers were astounded to realise that the commonly used POP3 email protocol revealed passwords in plain text when used over Wi-Fi.<p><p>The vulnerability of the POP3 protocol has been known for 13 years now but no measures have been taken to fix the problem. F-Secure said to The Guardian that this was just one of the many ways malicious hackers can gain access to people's private data over Wi-Fi.<p><p>F-Secure said users are suffering because the usability of Wi-Fi networks has been given priority over security. People should be much more cautious about using public networks and never use unprotected Wi-Fi.<p><p>Pekka Torvinen – HS Niina Woolley – HT LEHTIKUVA / Ville Männikkö © HELSINGIN SANOMAT <p>", "time": "2014-11-08T12:34:54+02:00", "type": "science-and-technology"}
{"title": "A live, online doctor consult on Google", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12667-a-live-online-doctor-consult-on-google.html", "review": "", "content": "<p>Just in time for flu season, Google is experimenting with a feature that provides live video-chat advice to searchers looking for information on some medical conditions.<p><p>We've all probably convinced ourselves at least once through frantic online searching, that we – or our children – have some sort of undiagnosed chronic or catastrophic disease. (Ebola, we're looking at you.) With the video-chat option, Google may be able to alleviate some of those concerns by providing a real, live doctor to tamp down that panic level at those times when you're trying to figure out whether it's worth scheduling a doctor's appointment.<p><p>Google confirmed that it's running the program in a limited trial. \"When you're searching for basic health information – from conditions like insomnia or food poisoning – our goal is provide you with the most helpful information available,\" Google said in a statement. \"We're trying this new feature to see if it's useful to people.\"<p><p>During the trial period, Google is covering all the costs of the online consultations. A Reddit user first brought attention to the feature – part of Google's general advice service, Helpouts – in a post showing Google offering a video-chat option for his search on \"knee pain.\" Not every medical query yields the option for a live chat, and in some cases searchers may be asked to set up an appointment rather than have immediate access to a medical professional.<p><p>Telehealth is an area of medicine that a lot of companies have been looking at, particularly to improve health care in rural parts of the country. But it carries its own regulatory headaches: In many cases, states don't allow for doctors to practice across state lines, which limits physicians' ability to use telemedicine technology.<p><p>Hayley Tsukyama<p><p>The Washington Post<p>", "time": "2014-11-06T12:28:55+02:00", "type": "science-and-technology"}
{"title": "Exosuit allows divers to reach new depths", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12418-exosuit-allows-divers-to-reach-new-depths.html", "review": "", "content": "<p>The ingenious diving apparatus allows divers to move and breathe freely deep under the sea.<p><p>During his ocean adventure, Tintin, the world-famous Belgian cartoon reporter, wears a deep-sea diving suit that needs to have air pumped into it continuously from the surface. The diver's life depends on the air hose attached to the suit working properly.<p><p>Modern-day ocean adventurers, including explorer Jacques Coustaeu's son Jean-Michel, can now rely on a deep-sea diving suit that is much safer to use. In many ways, it is more like a submarine.<p><p>Packed with cutting-edge technology, the Exosuit diving apparatus promises to revolutionise ocean exploration.<p><p>Its oxygen system provides life support for up to 50 hours. The suit's shell can withstand an intense pressure 30 times greater than air pressure at the surface, allowing a diver to descend down to 300 metres.<p><p>Developed by Canadian Nuytco Research, the hard metal dive suit bears a striking resemblance to the space suits astronauts wore for the moon landings in the late 1960s and the early 1970s. Originally designed for maintenance work of New York's underground drain system, the suit has undergone vast amounts of development work to become a unique atmospheric diving system.<p><p>The suit has been used by the United States Office of Ocean Exploration and Research and photographers of the renowned journal National Geographic.<p><p>The half-a-million-euro diving system has also been employed in oil exploration in the Persian Gulf. At the beginning of September, an archaeological team descended to the seafloor in the Greek archipelago in the Aegean Sea, using the suit to explore an ancient Roman shipwreck.<p><p>The wreck had been discovered by divers looking for sponges back in 1900. A number of treasure hunters have since lost their lives trying to reach the ship.<p><p>Until now, divers have only been able to explore parts of the wreck down to the depth of 60 metres, but this novel diving system allows them to go much deeper.<p><p>An ancient device, the Antikythera Mechanism, designed to predict astronomical positions and eclipses, has previously been recovered from the wreck.<p><p>Treasure trove<p><p>The wreck can turn out to be a veritable treasure trove of ancient objects, which can now be discovered with the help of the new deep-sea apparatus. After using it, diver Theotokis Theodolou sang the praises of the suit to news agencies, saying it allowed a diver to move freely deep in the ocean and carry out work requiring great precision.<p><p>The suit can be fitted with up to eight 1.6-horsepower thrusters, which the diver can operate with his feet.<p><p>\"I could grab, pick, squeeze and dig with my hands for hours,\" explains Theodolou. This is where the suit differs from a submarine, allowing the diver to get up close and personal with any object discovered.<p><p>The oxygen in the Exosuit is replenished on the basis of the diver's metabolic rate and pulse and the air matches closely the air we have at the surface.<p><p>Usually divers need to pay very close attention to the mixture of gases they use when diving at similar depths.<p><p>The pressure inside the suit is similar to the air pressure at the surface, allowing the diver to ascend more rapidly without concerns over decompression sickness.<p><p>If the diver for some reason loses consciousness, a team monitoring the dive can control the apparatus and direct it back to the surface.<p><p>Canadian origins<p><p>The suit was developed by a Canadian inventor and businessman, Phil Nuytten, who joined a diving club in Vancouver at the age of 13 and started selling diving equipment two years later. At the age of 18, Nuytten almost drowned in a diving accident, an event which led to him to starting work on improvements to breathing apparatus. With time, these ideas matured into the suit.<p><p>Nyutten was granted a patent for the joints used in the suit already in 1985 and tests on the latest version of the suit kicked off in 2009.<p><p>Nuytten has received France's prestigious Jules Verne Award for his work on deep-sea technology. And it is easy to image Nyutten in the role of a latter-day Captain Nemo.<p><p>The exploration of the worlds under the sea is just beginning and inventions by Nuytten, whose company has also developed submersibles, can contribute to the successful completion of the work.<p><p>Timo Paukku – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Neil McDaniel<p>", "time": "2014-10-19T15:15:00+03:00", "type": "science-and-technology"}
{"title": "High fruit and vegetable intake linked to mental wellbeing", "url": "http://www.helsinkitimes.fi/themes/themes/science-and-technology/12416-high-fruit-and-vegetable-intake-linked-to-mental-wellbeing.html", "review": "", "content": "<p>Medical News Today reported in late September on a recent study indicating that people who consume a minimum of five portions of fruit and vegetables a day feel mentally healthier than people who consume less fruit and vegetables.<p><p>Researchers at the University of Warwick collected information on the physical and mental wellbeing, health-related behaviours and socio-economic background of nearly 14,000 participants over 16-years-old.<p><p>The study found that 35.5 per cent of participants with high mental wellbeing consumed a minimum of five portions of fruit and vegetables a day, whereas only 6.8 per cent of them consumed no more than one portion a day. Overall, the share of participants with high mental wellbeing declined in parallel with fruit and vegetable intake.<p><p>For the purposes of the study, wellbeing was defined not only as the condition of feeling good and functioning but also as optimism, happiness and self-esteem.<p><p>The findings, the researchers estimate, are an indication that a high intake of fruit and vegetables may be a factor contributing toward the mental wellbeing of people.<p><p>Johanna Mitjonen – HS Aleksi Teivainen – HT © HELSINGIN SANOMAT Image: Esa Syväkuru / HS<p>", "time": "2014-10-18T21:08:00+03:00", "type": "science-and-technology"}
