{"title": "When does it pay off to change jobs?", "url": "http://www.helsinkitimes.fi/working-life/12744-when-does-it-pay-off-to-change-jobs.html", "review": "", "content": "<p>Statistics compiled by the Research Institute of the Finnish Economy, Etla, show that around a quarter of the workforce move in or out of a company every year. The figure includes both people retiring and those just entering working life.<p><p>The Ministry of Employment and the Economy studied career changes between 2003 and 2006 and found that around a third of the employees go straight from one job to another, while for almost 40 per cent of people the change involved a period of unemployment. Around 25 per cent of people took a break from working life for some other reason.<p><p>During the three-year period, roughly 40 per cent of the respondents had changed jobs at least once, while among under 25s, the figure was 90 per cent.<p><p>Even though changing jobs is most common among people just embarking on their careers, for the accountant Niina Hänninen (39), the period of searching only began at the age of 30.<p><p>After gaining a vocational qualification in business administration, she found a job that she stayed at for nine years. She topped up her qualification to a bachelor's degree while working and took up an overseas secondment.<p><p>After this, she tried out studies in the field of social work but decided to continue as an accountant. She accepted a short-term post in accounting, after which she worked for three years for a different company, but part of the same group.<p><p>\"It's true that once you have mustered up the courage to change jobs for the first time it's easier the next time.\"<p><p>Next, spurred by desire to make a difference, Hänninen took a job at a charitable organisation, before the English language and international atmosphere offered by a company in bag business tempted her to change jobs again. Now she has worked for a couple of years as an accountant for a record company, which allows her to be involved in the music industry, a passion of hers.<p><p>Embarrassing trend<p><p>After switching jobs so many times, Hänninen was starting to feel embarrassed about telling her friends that she had moved on to a new place yet again.<p><p>\"Even in a job interview, the interviewer wanted to know why I have changed jobs so many times. But going through it, I realised there had been a good reason for each change. Now I feel at ease: I've found the right place.\"<p><p>Marika Kivilehto (36) has also transferred to a new job every couple of years, with the desire to learn something new as the driving force behind the changes.<p><p>Last December, Kivilehto took up a post as the HR development manager for the engineering business RD Velho. By chance, she came across the job only six months after announcing her wish list to her husband while bathing in a sauna.<p><p>\"I remarked to my husband that if I changed jobs it would be to work for a Finnish company which was striving to expand and where I could be involved in developing HR right from the beginning.\"<p><p>When Kivilehto talks about her career, a clear pattern emerges: she has accepted all the jobs with great enthusiasm, given her next step some serious consideration and worked hard to achieve her goals.<p><p>After graduating from upper secondary school, she trained for her dream job as a hairdresser, but ended up running an online beauty product shop.<p><p>From there, she moved to another online retail job in the same field, working as an assistant buyer for the cosmetics department at SOK, while completing a bachelor's degree in business administration and specialising in HR.<p><p>\"I thought I should gain experience in all aspects of business in case I became a manager one day.\"<p><p>Bold decisions<p><p>Kivilehto has also made some bold decisions, such as changing a permanent post to a short-term contract. \"I've never paid any attention to the length of the contract but to what the job involved and what it could teach me.\"<p><p>She has also proposed changes to her job description. While working as a consultant at the Manpower recruitment company she said to her boss that more consultants needed to be hired to implement the company's new operating model and offered to lead the team. The boss took Kivilehto up on her offer.<p><p>In her last job as a HR Partner at Danske Bank, she ended up coaching managers for cooperation negotiations. She learnt a lot from the job, but the three more negotiations that followed the first ones in a quick succession, sparked an idea that culminated in the announcement she made to her husband while in sauna.<p><p>At some point, Kivilehto felt some bangs of worry that the rapid job changes might not do anything to improve her CV, but came to a conclusion that her range of experience was an asset.<p><p>\"My career path could have followed a dozen other routes. I've had some bold ideas, been active in realising them and then one thing has just led to another.\"<p><p>Terhi Hautamäki, Ville Männikkö – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Helsingin sanomat<p><p>Changing jobs often increases pay<p><p>People who change jobs frequently often end with a better pay than those who stick with one employer. Statistics on pay also reveal that transferring to new duties within the same company can boost pay but the benefits of changing jobs or tasks within a company vary between fields. In 2007 to 2010, the wage package in the industrial sector grew most for employees changing to a different company while in the service sector, transferring to new duties within the same company had the most positive impact on pay.<p><p>People with a high level of education benefit the most from career changes, whereas employees with a low level of education – women in particular – do not usually gain financially from changing jobs.<p><p>Rapid moves from one company to another may arouse questions in potential employees, says Hannu Solanne, managing director at Uranus, a recruitment company. He believes four to six years to be an ideal period of time in the same job, with a longer stint weakening the applicants’ appeal in the eyes of recruitment people. When remaining longer with the same employer, it is a good idea to seek new challenges within the same company.<p><p>If an applicant’s working history is meandering, a little bit of creativity can be applied to compiling the CV. The most relevant work experience can be placed first, instead of listing jobs in chronological order or jobs can be grouped according to the job description.<p><p>Sources: Antti Kauhanen &amp; Mika Maliranta: Rakennemuutosten merkitys palkkakehitykselle ja niiden mittaus (2013). (The Impact of Structural Changes on Pay and Measuring Them), Rita Asplund &amp; Merja Kauhanen (editors): Suomalainen palkkarakenne (2010). (The Finnish Pay Structure)<p>", "time": "2014-11-16T12:34:41+02:00", "type": "working-life"}
{"title": "Five tips for making the most of your performance appraisal", "url": "http://www.helsinkitimes.fi/working-life/12743-five-tips-for-making-the-most-of-your-performance-appraisal.html", "review": "", "content": "<p>Although much depends on the boss when it comes to performance appraisals, you can benefit from the process by preparing for it and taking initiative when necessary.<p><p>1. Make the most of it<p><p>In some companies, not much thought is given to what the goals of performance appraisals really are. Some bosses may have doubts over whether performance reviews really are fit for purpose and employees wonder whether the boss is actually listening to them and giving the discussion their full attention.<p><p>According to the Better Work Community survey carried out by the Finnish Institute of Occupational Health, only 28 per cent of participants considered appraisals useful. Sometimes appraisal discussions turn into meetings focused on setting goals and evaluating results, which is not their original purpose.<p><p>Appraisals should be a tool for improving employees' wellbeing and development at work. At their best, appraisals provide an important opportunity for communication and interaction at a workplace.<p><p>2. Prepare for the meeting<p><p>When carried out properly, appraisals can offer a perfect occasion for discussing past projects and planning ahead. You can make the most of the opportunity by preparing and being active at the meeting.<p><p>Prior to the discussion, you should prepare a list of aspects of your work you think you have performed well. You can also think of tasks that you have found challenging.<p><p>You can also make a wish list for your future: would you like to have more training, extra support or a mentor? Also think of any feedback you would like to give to your boss.<p><p>3. Agree on follow-up<p><p>Without proper follow-up, there is a risk that nothing concrete comes out of the appraisal, which is why you should make notes of what was agreed on at the meeting. In addition, you should agree on when a follow-up chat will be held and what changes will take place as a result of the appraisal.<p><p>4. Bear in mind that an appraisal is a two-way street<p><p>Much to do with performance appraisals rests on the boss's shoulders. The boss is responsible for reserving an appropriate place and setting aside enough time for the meeting. They should also make sure that a certain procedure is followed regarding appraisals in the work community.<p><p>Filling in a form can be part of the procedure, ensuring that the same topics are touched on with all employees. However, it is important to bear in mind that a performance appraisal should not be all about filling in a form or staring at a piece of paper but about having an open discussion.<p><p>5. Be active<p><p>Performance appraisals are meant to be discussions but for them to be beneficial, the employee should be doing most of the talking. The employee should feel free to interrupt their boss when necessary and bring up any topics they want to discuss. If you have any criticism about your work, it is essential that you let your boss know about your feelings.<p><p>However, employees sho- uld not feel that they have to save up all their complaints or concerns for the annual performance appraisal. There are no forbidden topics. You can bring up a pay raise, even though it may be better to organise a separate discussion for that. Some organisations have a rule stating that pay raise negotiations must be held separately from performance appraisals.<p><p>Sources: Anna Tienhaara, a psychologist and human resource development consultant at the Finnish Institute of Occupational Health and Merike Mehine, a human resource development consultant at the Finnish Institute of Occupational Health.<p><p>Johanna Mitjonen – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Kai Tirkkonen<p>", "time": "2014-11-15T13:28:46+02:00", "type": "working-life"}
{"title": "Getting through the day with a little help from medication", "url": "http://www.helsinkitimes.fi/working-life/12331-getting-through-the-day-with-a-little-help-from-medication.html", "review": "", "content": "<p>Many employees drag themselves to work even though they are feeling under the weather, suffer from insomnia and have aches and pains everywhere. They turn to medication for temporary relief.<p><p>Occupational health doctor and father to small children, Jani, 37, has suffered from depression, concentration problems and insomnia for several years. He has been to see a psychiatrist and tried depression medicines in various combinations to help him get through the day.<p><p>A couple of years ago he ended up misusing medicines usually prescribed for the treatment of ADHD because they were suggested to him by a private psychiatrist. Usually ADHD medication is used to manage hyperactivity and concentration problems but for people who do not suffer from these, the medicines act as pick-me-ups.<p><p>So the psychiatrist prescribed Jani ADHD medicines to help him cope with work, instead of giving him sick leave.<p><p>\"I can get through the day at work without anyone being none the wiser but when I get home I'm all done in. After every stretch of holiday I have, I think I will cut my working hours but that never happens.\"<p><p>While he is usually able to offer employees who come to his office a chance to see a psychologist or to get some other form of medication-free therapy, Jani himself feels trapped.<p><p>\"I've stopped taking medicines because they didn't help but I'm not really feeling any better.\"<p><p>When looked at over a longer period of time, working life and illnesses related to it have undergone a sea change. Employees need to have much more varied skills than in the past and their duties may be almost as demanding as those of their supervisors.<p><p>Different struggles<p><p>A specialist in occupational healthcare from themedical centre Aava, Marja-Terttu Lähteenmäki, says that while in the past people used to suffer from heart illnesses and physical strain caused by work, they now struggle with stress, mental health problems and substance abuse.<p><p>\"Substance abuse has been on the increase in recent years. People self-medicate with alcohol to cope with insomnia and work stress. Use of drugs has also increased, particularly among young people.\"<p><p>According to Lähteenmäki, many employees say they use sleeping pills daily even though in light of some recent statistics use of sleep aids is on the decline. People coming to see Lähteenmäki also often ask for sleeping pills, to her surprise as these medicines should not be taken unless absolutely necessary.<p><p>\"People come in expecting the doctor to prescribe strong medicines that work.\"<p><p>Jani has also come across this phenomenon, seeing every day at least one employee who suffers from depression, burn-out or insomnia.<p><p>\"I renew at least one prescription for these problems every day. But the work does not change with the help of pills. Changing working conditions is the route we should be taking,\" says Jani.<p><p>One reason why so many people use medicines as a crutch to help them through the day is that employees are often left alone to cope with their problems. They turn to medication as a quick fix because in many workplaces duties have been divided in a way that means there is no one who is capable of helping a person drowning under an ever-increasing work load.<p><p>People may also expect more of themselves – they want to carry out their job to perfection.<p><p>Many feel they are irreplaceable at work, making it difficult for them to take a long sick leave as the longer they are away, the more daunting the idea of going back to work becomes.<p><p>\"I often come across defensive behaviour and tendency to play down the problems when people talk to me about their duties and how demanding these duties are. They think that if they could cope in their 20s they have to cope now too,\" Jani explains.<p><p>Work and support<p><p>Jukka Vuori, a research professor at the Finnish Institute of Occupational Health, says that how well employees cope at work is directly linked to the work community and the support network it offers. Studies have shown that in the short term people are able to cope with even highly stressful situations if they get support from their work community.<p><p>Nowadays there are no informal occasions for sharing information the way there used to be as people do not have chats or talk about their jobs to a similar extent.<p><p>\"There used to be a lot more chatting in workplaces. Now work communities with active social interaction are few and far between. Problems with exhaustion are prominent among self-employed people as they've got no one to turn to when tasks start piling up,\" Vuori explains.<p><p>Other factors explaining why people continue to work even when ill are shame and fear. People self-medicate and hide their problems out of fear of being shunned in the work community or even being fired.<p><p>Leena Kaila-Kangas, an expert from the Finnish Institute of Occupational Health, who has studied the connection between depression and musculoskeletal symptoms, says that prejudices against and faulty notions about mental illnesses are still common even though, along with musculoskeletal illnesses, mental problems are the most common cause of long sick leaves.<p><p>Kaila-Kangas says that there is also a strong link between the two causes: prolonged physical discomfort causes depression and, on the other hand, people suffering from depression are more sensitive to pain, while having no resources to look for treatment or manage the physical symptoms.<p><p>\"Patients with depression or some other illness are often so tired that they have no energy left to try to make changes,\" says Kaila-Kangas.<p><p>Because of this, workplaces should foster an atmosphere that encourages people to get involved and intervene in problems instead of employees with depression being left to their own devices.<p><p>Lack of support<p><p>Riitta, who has worked in the care sector for a number of years, suffers from long-term depression. She left her previous job because of workplace bullying but feels she does not receive enough support from her supervisor in her current job.<p><p>\"I told my current boss about my depression but I think they are taking advantage of my illness. Work meetings often take place when I'm away and decisions are made without me having a chance to have a say. And I'm not given any duties with a higher level of responsibility.\"<p><p>Riitta, who feels she is being discriminated against, has tried to stop taking medication for depression several times but finds it difficult.<p><p>When her boss is around Riitta feels anxious and tense.<p><p>\"I have contacted the health and safety officer several times but they have not done much to help. We don't have a shop steward.\"<p><p>Riitta believes that the situation in her workplace would improve if the employees were offered more guidance, whereas at the moment all the stabs at improving working conditions seem to be directed at making the supervisor's work load lighter.<p><p>Jukka Vuori agrees that it is unfortunately very common for bosses to get support while employees are left to cope as best they can even though everyone is under a similar amount of pressure. The risk of burn-out skyrockets if employees feel they have been caught between demands from both clients and bosses.<p><p>Occupational health doctor Jani also feels under pressure for several reasons. Resources at his workplace do not allow the company to hire extra employees, and having high work ethics, Jani does all his work conscientiously.<p><p>\"Of course it's ironic that I treat my patients and give them advice but don't look after myself. My work is affecting my whole life but when you have a hefty mortgage and a job you like it's difficult to make changes.\"<p><p>Usually the best way to improve wellbeing at work is to make changes to the job so that it is not too taxing to allow a normal life. In some cases, working can be beneficial to recuperation as long as the tasks are not too demanding.<p><p>Work should not leave employees feeling constantly tired, causing them to be forgetful, have concentration problems and view the future in bleak light.<p><p>\"In the worst case scenario, burn-out can lead to long-term mental health problems and loss of ability to work. People often misguidedly think that an employee who needs to take long sick leaves cannot be fired,\" Jani sums up.<p><p>Jani's and Riitta's names have been changed.<p><p>Ida Roivainen – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Klaus Welp<p>", "time": "2014-10-12T17:35:00+03:00", "type": "working-life"}
{"title": "Inappropriate sanctions put strain on employees", "url": "http://www.helsinkitimes.fi/working-life/11787-inappropriate-sanctions-put-strain-on-employees.html", "review": "", "content": "<p>Last autumn, when Anna, 33, a team leader in the communications field, started showing signs of burn-out, her boss encouraged her to contact the occupational doctor, which Anna did. \"The doctor said that the problem was that our whole work community was over-worked. I wasn't the first one at our workplace to suffer from burn-out.\"<p><p>She had been doing two people's work for the last six months, as she was given all the duties of a colleague who had been laid off when the company had to downsize. \"The boss promised that the situation would not continue for more than six months, but it dragged on and I didn't put my foot down. I worked in the evenings and on weekends.\"<p><p>When Anna returned to work from a short sick leave, the boss wanted to see her face-to-face. At the one-to-one meeting, the boss told her that she was not coping with her work. \"Apparently only people who are prepared to work really hard can cope at our workplace. When I asked for some examples of the problems, the boss could not name one task I had failed to do properly.\" Instead the boss claimed that as a single mother of a small child Anna was not team leader material.<p><p>\"That seemed unfair as I had never missed work because of my child,\" she recalls. After the meeting, the boss started transferring Anna's tasks to a colleague, until in the end she found she had dropped down a rung in the company hierarchy, as she had lost all her team leader duties.<p><p>Other employees were not informed about the changes that had taken place, so they still regarded Anna as the team leader. The situation went from bad to worse in a matter of a few weeks when the boss communicated important work matters to the rest of the team via emails that were never sent to Anna.<p><p>\"There were occasions when I didn't perform a task simply because I was never told about it. Behind my back, my boss said to the other employees that I wasn't up to the job and thanks to my incompetence things were going pear-shaped,\" Anna explains.<p><p>Hazy distinction<p><p>The line between dubious sanctions and bullying at a workplace is hazy, with treatment that some people consider to be a sanction seeming like bullying to others, while a third person might shrug the whole thing off. No statistics on the frequency of inappropriate sanctions have been compiled, but data on the related phenomena is more readily available.<p><p>The 2013 Quality of Work Life survey by Statistics Finland shows that around 20 per cent of employees have witnessed discrimination at their workplace. According to the Finnish Institute of Occupational Health, around six per cent of employees feel they have been subjected to bullying. The numbers are high compared to other European countries: only Austria has a larger proportion of employees who come across discrimination, unjust treatment or bullying at work.<p><p>Sanctions and discrimination come in many guises: shutting a person out of activities, keeping information from an employee, thwarting a person's advancement opportunities and unequal treatment regarding payment and work shifts. Colleagues, underlings and a boss can also be punished by treating them with disrespect.<p><p>Even though the legislation on equality forbids discrimination on the basis of age, health status or family connections, people often feel these are the real reasons behind their inappropriate treatment. There are cases where grounds for inappropriate treatment cannot be found. According to the Quality of Life survey, 11 per cent of employees believe they have been subjected to unfair treatment because of favouritism, saying that they are not popular in the workplace or have fallen out of favour with someone.<p><p>Experience first-hand<p><p>Outi, 28, who works in customer service in the legal field, has first-hand experience in getting on the wrong side of the management. The situation at her work had been inflamed for some time and problems in the human resources management were putting a strain on Outi and her colleagues.<p><p>Last spring, Outi had discussed the atmosphere at work with a colleague in her free time but the company's HR manager became privy to the conversation and asked to see Outi the following day. \"The tone of our chat wasn't threatening, but it was made clear to me that they were disappointed in my conduct and that the company matters should not be whispered about anywhere. After that, I felt I was under constant observation and in the end I got ill,\" says Outi, who is not sure why she was singled out for the chat.<p><p>Bullying and unfair sanctions mainly occur in workplaces where other problems are also rife. \"Studies have found that inappropriate treatment and bullying are more common in workplaces that have problems in the distribution of duties and the organisation of tasks,\" says Maarit Vartia from the Finnish Institute of Occupational Health.<p><p>She says that the problems commonly seen in these workplaces also include incompetent management, uncertainty about the fields of responsibility and breakdown in information flow. To prevent problems at work from coming to a head, it is important that employees and management are able to discuss the issues and look for solutions. If a boss becomes concerned over an employee's exhaustion or absences, they should bring this up in conversation.<p><p>Vartia stresses that talking about problems and giving feedback on work performance is not the same thing as a ticking off. \"The goal of talking about issues is to find a good solution. The way employees approach their superiors when they think that there are problems within the work community or the way the management works is just as important.<p><p>In Anna's case, the situation, which involved keeping her in the dark about work matters and talking about her behind her back, lasted for three months. She only dared to tell the company's top management about her boss's behaviour after she found a new job.<p><p>\"I don't believe that acting earlier would have changed my situation in any way, and in the end, I only decided to bring up the matter to help my colleagues who remained in the company. This was a couple of months ago but as far as I know the company management has done nothing to intervene in the situation in my old team,\" she says.<p><p>Vartia emphasises that an employee not only has the right but also a responsibility to report inappropriate treatment to their employer. \"Finnish labour and occupational safety legislation states that an employer must intervene in the situation as soon as they become aware of it.\"<p><p>Support available<p><p>Employees can turn to a shop steward, occupational safety official or occupational health services for help and support in dealing with workplace problems.<p><p>If the problem concerns the terms of an employment contract and the employee is for example transferred to different duties or loses duties without proper grounds, then the shop steward is the right person to turn to, while an occupational safety official deals with cases of bullying at work. Only a small fraction of cases concerning inappropriate treatment in the workplace are reported to occupational safety authorities.<p><p>\"Last year, we received under 400 reports on inappropriate treatment or workplace harassment,\" says Tanja Välke, a lawyer at Regional State Administrative Agency of Southern Finland, adding:<p><p>\"Many workplaces already have guidelines on dealing with harassment cases in place. It can well be that a majority of conflicts are solved within companies.\"<p><p>Occasionally, a superior becomes the victim of unfair sanctions, which can include similar treatment as when an underling is at the receiving end: subjecting the person to isolation, disrespect or bullying.<p><p>Välke has also seen cases where an official complaint is used as a means of punishment.<p><p>\"We occasionally receive reports where it is obvious that for example someone whose employment contract has been terminated wants to put the employer in an awkward position by reporting them.\"<p><p>Sometimes the sanctions have valid grounds even though the person at the receiving end does not think so. Välke says that in some of the cases they have investigated the party that the report concerned had been justified to take the measures that caused the complaint.<p><p>Vartia also says that there are always two sides to a story and the superior's actions may have had valid grounds.<p><p>\"But the employee must be explained these reasons. Yet again, this highlights the importance of discussing the problems and needs for change that arise in a work community,\" Vartia explains.<p><p>Anna and Outi's names have been changed at their request. The 2012 barometer on working life by the Ministry of Employment and the Economy was also used as a source for the article.<p><p>Linda Pynnönen – HS Niina Woolley – HT © HELSINGIN SANOMAT Image: Lauri Voutilainen<p>", "time": "2014-08-31T13:05:00+03:00", "type": "working-life"}
{"title": "How does improved cultural knowledge help Finnish companies succeed?", "url": "http://www.helsinkitimes.fi/working-life/10955-how-does-improved-cultural-knowledge-help-finnish-companies-succeed.html", "review": "", "content": "<p>The first question is: is there something like a Finnish working culture? And with increasing numbers of foreigners employed in Finland, what are the effects on the so-called Finnish working culture?<p><p>With the help of Helsinki times, itim International has conducted a study of Finnish organisational cultures and to which extent these assist Finnish organisations to work with foreigners (in Finland) and/or to compete globally. A total of 21 organisations participated in the research, spread out over six business areas:<p><p>1. Public Service<p><p>2. Higher<p><p>Education Institutions<p><p>3. ICT Sector<p><p>4. Consulting<p><p>5. Professional Associations<p><p>6. Logistics<p><p>A particular challenge throughout all organisations which have participated in this research remains the degree to which leadership styles are accepted. Compared to other countries, this seems to be a particular issue in most of the Nordic cultures.<p><p>From a global perspective, typical Finnish managers are promoted based on (technical) seniority, and the usual (Nordic) expectation of a manager is that a manager should be a colleague who is supportive and consultative. The reality is that most employees coming from cultures such as Spain, Russia, etc. expect a father/mother figure who has authority, who does not act like a colleague, but provides clear instructions and checks the work done (people respect what you inspect), and does this with respect.<p><p>Promoting experts to leadership roles normally results in two things:<p><p>1. You lose an expert<p><p>2. You gain a poor manager/leader<p><p>The second part is especially relevant in today´s globalising world. More people from abroad come to Finland and more Finnish companies go international: the role of the expert leader is becoming less relevant and the role of the \"father/mother\" figure (Latin cultures, Russia) / people manager (US, UK) becomes more important.<p><p>Organisational cultures that are not focusing on what needs to get done and are not open enough (and the precise level needed depends on the type of organisation) and on top of that have poor acceptance of leadership will not be able to compete globally and will not be able to profit from the value that diversity can bring.<p><p>Accepting differences requires an open and goal-oriented oragnisational culture<p><p>Itim International was founded in 1985 by Geert Hofstede, a pioneer in the field of culture and management and the founder of comparative intercultural research who is listed in the Wall Street Journal as one of the Top 20 most influential management thinkers in the world, and Bob Waisfisz, a highly experienced and successful management trainer and consultant.<p><p>Since itim's inception, more than 5000 organisations have been assisted in, first of all, becoming aware of national cultural differences and measuring to which extent their organisational (sub)cultures support their strategy. Secondly, we have enabled companies to change their organisational cultures to better accommodate people from different cultures, to use cultural differences as an advantage and, therefore, to become more successful globally. With this knowledge we have learned that for organisations to really excel globally they need to build internal space for people to become aware and accept differences. To learn to ask the question \"you think differently, how can we use that?\" instead of being afraid of the differences.<p><p>In the consultancy lingo we talk about two dimensions which play a role, based on Hofstede's organisational cultural model (which differs from the national cultural model).<p><p>Level of effectiveness<p><p>Focusing on how you do your work (means-oriented) vs. focusing on what is being done (goal-oriented): If you can agree on what you are doing, instead of how it gets done, you already have established something that you share (the goal).<p><p>Approachability<p><p>Having an open environment, where it is easy to talk to people (e.g.) give feedback to your boss and you don't need to be afraid to make mistakes vs. a closed environment where people prefer to stay silent when in trouble, where there is a lot of gossiping, but also a high need for secrecy.<p><p>With this knowledge we can say that based on this research, the Finnish ICT sector is doing a good job, as are the higher education institutions. The organisational cultures of the public service organisations and the logistic companies, which in Finland include the hospitals and postal services respectively, which are currently recruiting a lot of foreign staff, do not have organisational cultures which very easily support the integration of those who think differently.<p><p>Link to the results<p><p>Egbert Schram Bob Waisfisz<p>", "time": "2014-06-19T11:12:05+03:00", "type": "working-life"}
{"title": "An incompetent boss turns a deaf ear to employees' views", "url": "http://www.helsinkitimes.fi/working-life/10401-an-incompetent-boss-turns-a-deaf-ear-to-employees-views.html", "review": "", "content": "<p>An incompetent boss thinks the whole organisation revolves around him and can also get away with his behaviour as the top management is not aware of it, or only cares about the company's performance figures.<p><p>After taking up a managerial position in an expert organisation, Kai soon realised the firm was led by an incompetent boss, whose behaviour and management style were unpredictable and whimsical.<p><p>\"He wasn't clear about what the goals were and would often give several tasks to be carried out simultaneously, some of them contradictory.\"<p><p>Sometimes, having changed his mind about what should be done next, the boss would behave as if an earlier conversation had not taken place at all.<p><p>Kai also learnt quickly not to disagree with the managing director as this only resulted in revenge. Employees who dared to express an opinion that did not go down well with the boss would find themselves at the receiving end of the silent treatment.<p><p>On occasions when disagreements cropped up, the boss overrode all objections, without justifying his views in any way. \"His attitude was that as he was the boss, his was the only opinion that counted.\"<p><p>Satu has also worked for a company where the managing director did not trust his employees to do their job.<p><p>\"The boss wanted to know every last little detail. He'd get worked up if something was decided without consulting him first.\"<p><p>\"He wanted to keep tabs on what employees were up to any given minute, not trusting them to prioritise their tasks.\"<p><p>Leading by poor example<p><p>Ari Rämö, a business leader and an author of a book on leadership, says that the experiences of Satu and Kai illustrate what leadership is at its worst.<p><p>With plenty of experience in managing organisations of various sizes, Rämö currently heads Sick Oy, a company providing sensors and sensor solutions, which has been elected among the top three workplaces in Finland several years running.<p><p>\"A bad boss thinks that others are there for him. He doesn't realise that it's his job to motivate people and ensure good working conditions, not keep employees in their place.\"<p><p>A common problem in workplaces is a boss who does not allow subordinates to make decisions and ignores their opinions and ideas.<p><p>Janne Tienari, professor of business management at Aalto University, says that the list of management blunders also includes continual organisational reorganisations and bosses covering up for their own mistakes and over-emphasising their position and all the trappings that come with it.<p><p>Griping about bosses may be a popular coffee-break pastime, but dissatisfaction with business management's leadership skills is a topic that also regularly crops up in studies.<p><p>In a survey of more than a thousand 18-to-74-year olds carried out by the insurance company If in 2012, up to 39 per cent of people mentioned poor management as one of the problems plaguing their workplace.<p><p>Trade Union Pro found in its survey conducted in 2013 that 43 per cent of employees did not feel that the managers of the company they worked for were knowledgeable or showed great judgement. Roughly 10,000 professionals participated in the study.<p><p>Baffling rise<p><p>Employees are often baffled by how unsuitable people can rise to top positions and manage to hold on to their jobs.<p><p>One explanation is that bad leaders appoint other incompetent managers.<p><p>\"People tend to pick younger versions of themselves as their successors. It's fun to work with people who are similar to you,\" explains Tienari.<p><p>The company's top management is often blind to the situation as people are good at sweeping problems under the carpet.<p><p>Tienari also points out that, as in other things, beauty is in the eye of the beholder also in matters to do with business management.<p><p>\"Subordinates may regard leaders as incompetent but from some other perspective the management style can seem successful.\"<p><p>Bad people management can also deliver good results.<p><p>\"If the company's market position boosts business and increases its turnover, the upward trend can help mask employees' lack of motivation,\" says Rämö.<p><p>Satu assumes the top management of her company was none the wiser about her superior's behaviour.<p><p>\"His own bosses were abroad and weren't aware of how unhappy people were. As long as figures look good, they are pleased with the way things are.\"<p><p>Kai believes that one reason behind poor leadership skills is that power is intoxicating and makes people blind to their own failings.<p><p>He thinks his managing director's rapid rise to high-powered positions is partly to blame for his narcissistic behaviour as it meant he had never been in a junior position himself. He had always surrounded himself by an inner circle that was at hand to carry out his orders and to fawn on him.<p><p>\"I'm sure that people with such megalomaniac characteristics can be found in top-tier positions in all organisations. Then you get a boss who thinks he's the centre of the universe.\"<p><p>Manage the consequences<p><p>What are then the consequences of bad management?<p><p>According to Tienari, there may not be any consequences. \"Others get used to covering up for management mistakes,\" he explains.<p><p>\"People don't care and don't strive to improve things,\" Rämö remarks. \"They just get through the days and do the bare minimum.\"<p><p>In Kai's company, the boss created an atmosphere of fear, pushing many to look for new work. Employees' work performance was evaluated solely on the basis of figures.<p><p>\"People came up with tricks to make figures look pretty.\"<p><p>In the end, scared of garnering the boss's wrath, employees also manipulated the performance figures.<p><p>\"You are given what you ask for. In an expert organisation, measuring quality is not easy but quantity can be measured and targets met also with bad quality.\"<p><p>Tienari is not as pessimistic about the quality of the Finnish business management as could be expected on the basis of surveys and coffee-break conversations, saying it is all too easy to point the finger at company managers when things do not go according to plan.<p><p>He stresses that leading a business is a demanding job, with teamwork required for good results.<p><p>He says that the level of leadership skills is generally high in Finland, with Finnish leaders being highly esteemed internationally and mentions a democratic approach to management as one of the positive features.<p><p>\"Here, bosses can be criticised and challenged, which I think is a healthy characteristic. Finnish bosses are interested in what employees are doing and achieving in their work, rather than focussing on titles and family background.\"<p><p>Managing to improve<p><p>Over the last decade, there has also been a clear improvement in management skills as education on the topic has become more common. \"Business management is more professional these days, with people placing more emphasis on it, wanting to get better.\"<p><p>Even though in some studies, bosses get lambasted for their lack of leadership skills, there are also surveys that paint a different picture. The annual working condition barometer by the Ministry of Employment and the Economy reveals that transparent information flow and equal treatment of employees have improved in workplaces in the 2000s.<p><p>In the 2013 barometer, more than 80 per cent of employees said that their boss treated employees in a fair manner and asked for employees' views on matters that were relevant to their working conditions.<p><p>Almost three quarters of the respondents said that their boss was supportive when they wanted to improve their professional skills and also gave feedback on their work performance.<p><p>As nothing changed in Kai's company, he decided to resign after a few years.<p><p>\"I decided against staying and putting up with the situation through gritted teeth.\"<p><p>And what happened to the boss?<p><p>\"He's still there.\"<p><p>Kai and Satu's names have been changed.<p><p>Maria Mustranta – HS Niina Woolley – HT ©HELSINGIN SANOMAT Graphic: Aiju Salminen<p>", "time": "2014-05-05T08:30:00+03:00", "type": "working-life"}
{"title": "How to make an open-plan office a quiet place to work in?  ", "url": "http://www.helsinkitimes.fi/working-life/10337-how-to-make-an-open-plan-office-a-quiet-place-to-work-in.html", "review": "", "content": "<p>We work in an open-plan office, where some of the employees find the noise level distracting. Carrying out routine duties is not a problem but tasks that require more concentration and thinking often prove difficult. There are people in the office who do not see why they should restrict their conversation or control the sound level. One of the culprits is the boss. Any request to turn down the volume is interpreted as nagging. How to resolve this conflict?<p><p>The problem is by no means rare, and research data is available on the topic, showing that noise and interruptions have a detrimental effect on work. Companies have embraced the idea of open-plan offices en masse but this may have a negative impact on employees’ wellbeing.<p><p>The common notion is that an open-plan office increases the sharing of ideas and camaraderie, but these plus sides are far outweighed by the downsides.<p><p>Earphones with a noise-cancellation feature may work as a quick fix if it is not possible to find a conventional office space for the employee or working from home is not a viable option. Some people find that listening to music helps. If lyrics are a distraction, classical music may be a better option.<p><p>You have to find the solution that works best for you through trial and error.<p><p>The main cause of friction in the office seems to be that no proper ground rules have been set. If the work community has regular weekly meetings, it might be a good idea to agree to bring up the topic at one of these gatherings.<p><p>You should try to come up with solutions together as a community. Any idea that has been agreed on together and suits the nature of the work is a workable solution. The office should have a designated space for negotiations. One idea that is worth considering is quiet periods when talking is restricted.<p><p>When the boss is one of the causes of noise pollution, it is essential to get them to understand that chatting can be a distraction to other people. For this to work out, the topic should be discussed in a constructive manner, instead of only commenting on the distracting behaviour when it occurs.<p><p>It should, however, be acceptable to mention a noise level that is a source of distraction without the comment being labelled as nagging.<p><p>If a solution for the problem cannot be worked out, this failure may be a sign of other, underlying problems causing tension in the office. Perhaps some changes have taken place in the working conditions, leading to increased stress levels, which are proving a strain on communication.<p><p>If this is the case, it might be helpful to get an outside consultant to assess and defuse the situation.<p><p>The ability to solve conflicts together is a sign of a healthy work community.<p><p>Lilli Sundvik is a managing director and consultant on organisational psychology at Cresco Oy, psychological consultants.<p><p> HS Niina Woolley – HT ©HELSINGIN SANOMAT Image: Antti Aimo-Koivisto / Lehtikuva<p>", "time": "2014-04-27T15:04:59+03:00", "type": "working-life"}
{"title": "Many await summer vacations, but how are annual holidays determined?", "url": "http://www.helsinkitimes.fi/working-life/9873-many-await-summer-vacations-but-how-are-annual-holidays-determined.html", "review": "", "content": "<p>Why are we paid holiday bonuses? Why do Saturdays take up vacation days? The origins of the annual holidays act date back to the 1930s.<p><p>Vacation is mentioned in the fourth clause of the first section of the annual holidays act. Law, labour market policies and social policy – these are what our yearly break is built upon.<p><p>For most, the upcoming vacation involves mornings filled with light and summer vacation plans.<p><p>It is worth remembering, though, that the right to a paid statutory annual leave is not self-evident. In Finland it was established in 1922; the United States still does not have it.<p><p>In an agrarian society, clauses on vacations were not necessary in the same way as they currently are. The yearly cycle determined when to work and when to rest. Statutory vacations developed along with industrialisation and the labour movement.<p><p>The Annual Holidays Act of 1973 marked an important change, as it established the minimum duration of annual leave at 24 days for those who have worked for their employer for less than a year, and 30 days for those with a working relationship spanning longer than a year.<p><p>Longer leaves have also been agreed on in some collective agreements. For example, state officials who have worked for over 15 years earn 36 vacation days annually.<p><p>The duration of the vacations is only part of the holidays act.<p><p>The most recent annual holidays act of 2005 allowed for more flexibility on holiday agreements. It also improved the position of part-time workers: previously, they did not necessarily earn vacation days during temporary layoffs or sick leave.<p><p>The origins of the current annual holidays act date back to clauses from the 1930s and 1940s. It is no wonder, then, that some vacation policies seem outdated.<p><p>Take, for example, including Saturdays as vacation days, i.e. that an annual leave of 30 days denotes five instead of six vacation weeks. This dates back to when Saturdays were still working days.<p><p>One would assume that the system could easily be modernised so that the number of vacation days would remain the same, but would be easier to count.<p><p>\"All other counting methods are problematic. This is why the acknowledged standard has been chosen,\" says legal officer Mikko Nyyssölä from the Confederation of Finnish Industries (EK).<p><p>What about bonus holiday pay? It has not been decreed, but it was introduced in the collective labour agreement of the metal industry in the early 1970s to prevent workers from going to Volvo's factories in Sweden for better pay.<p><p>Times changed, but holiday pay was established as a national habit. Do you believe that we would receive holiday pay if it were invented today?<p><p>In many companies, holiday bonuses are equal to returning to work. If the employment relationship ends with the holiday, the bonus may not be paid.<p><p>A good act<p><p>According to experts, vacationing has not been simpler elsewhere either. Finland's annual holidays act is, in fact, a good one, experts in Hakaniemi and Eteläranta assure.<p><p>\"The structure of agreements is very sensible in Finland. The statutory annual holiday guarantees a reasonable minimum holiday for everyone, and annual holidays can be tailored in collective labour agreements according to the needs of each industry,\" says development manager Juha Antila from the Central Organisation of Finnish Trade Unions (SAK).<p><p>The possibilities for the employer and employee on the holiday's timing have increased. Annual holidays may be postponed or be divided into parts. Part of the holiday may be used up as shorter working hours.<p><p>EK believes that this could be improved still. When preparing the current legislation, employers from the committee, as well as officials, proposed that the employer and employee could agree on paying the fifth holiday week as pay.<p><p>The representative from SAK was willing to bend on the matter, but representatives from the Finnish Confederation of Salaried Employees (STTK) and the Trade Union Confederation Akava did not agree on the selling of holidays.<p><p>\"I believe that people are able to decide for themselves without the guidance of trade unions, whether they wish to sell one holiday week to the employer,\" Nyyssölä from EK states.<p><p>SAK would not even negotiate on the matter anymore, Antila says.<p><p>History of the annual holiday in Finland<p><p>• 1865. Workers in an annual employment relationship are guaranteed one week of vacation in a year. It is mostly aimed at maids and servants finding a new job.<p><p>• 1922. The Employment Contracts Act guarantees annual leave of 4-7 days.<p><p>• 1939. The 1st Annual Holidays Act: employees of over one year’s employment relationship receive 5 days, after a year 9 days and, after 5 years, 12 days of paid holiday.<p><p>• 1960. If the employment relationship has continued without interruption for over ten years, 2 vacation days are earned per month. Shorter employments yield 1.5 vacation days per month.<p><p>• 1973. 2 or 2.5 vacation days can be earned per month.<p><p>• 1986. Those who work 35 hours a month also begin to earn vacation. Previously 14 days per calendar month of work was required for earning vacation. Many part-time workers did not receive holidays at all.<p><p>• 2005. The most recent annual holidays act improves the position of part-time workers: they earn vacation days during sickness leave in the same way as full-time employees.<p><p>Source: Anu-Hanna Anttila: Loma tehtaan varjossa (2005)<p><p>Significant flaw<p><p>Antila from SAK considers the largest flaw of the act to be the fact that those who have held their current employment relationship for less than a year only receive two vacation days per employment month, yet the colleague who has held their position for over a year collects two and a half days of vacation. \"This is obvious discrimination,\" he says.<p><p>\"It makes no sense to punish those in short employment relationships with legislative measures too.\"<p><p>EK's Nyyssölä believes that it is not so much a question of punishing anyone, but rewarding committed workers.<p><p>\"Of course one may question if it is fair. I believe it is. It is a curious situation if nothing can be rewarded.\"<p><p>Antila believes that the boundary mark of one year is also exploited. \"Some employers crop employment relationships so that the temporary worker cannot reach the holiday accrual of two-and-a-half days.<p><p>Few Finns are unaffected by holiday issues. \"Many people are left outside this discussion, who may not have been able to have paid holidays for years, even if they have been continuously working,\" docent of sociology Anu-Hanna Anttila reminds.<p><p>Holiday rights of loggers were pondered as early as the 1930s in Finland. Currently, people who are left outside certain rights include entrepreneurs working alone, freelancers, researchers working on grants and artists whose salaries derive in bits and pieces. Commissions do not result in holiday.<p><p>Also, short and temporary working relationships are tricky. Earned vacations should be kept during the employment relationship, but this may not always be possible due to a heavy workload. In these cases holidays are received in pay. In practice, the shortest working relationships that last less than 15 days or 35 hours do not produce vacation days at all. Instead they are paid as wages.<p><p>Even so, money does not replace holidays.<p><p>Tuomo Tamminen – HS Annika Rautakoura – HT ©HELSINGIN SANOMAT Images: Heikki Saukkomaa / Lehtikuva, Kimmo Taskinen / HS<p>", "time": "2014-03-25T15:00:00+02:00", "type": "working-life"}
{"title": "Many continue to work at retirement age", "url": "http://www.helsinkitimes.fi/working-life/9074-many-continue-to-work-at-retirement-age.html", "review": "", "content": "<p>This spring, on 31 May at 16:00, Leif Åberg, Professor of Communications at the University of Helsinki, will end his 41-year-long academic working career. Officially, at least. This is when Åberg retires at the age of 66.<p><p>“The university provides a good framework for the kind of work I enjoy. One may develop and brainstorm things, increasingly with younger researchers,” Åberg ponders.<p><p>“It is very rewarding to be able to work with young and intelligent people and witness their development. Many disappointments from previous years have quickly been forgotten, once it has been possible to attempt something new.”<p><p>The feeling of responsibility has also kept him working. He has almost a dozen doctoral thesis students, whose work should be developed as much as possible before summer.<p><p>The decision to retire next spring was influenced by the fact that Åberg’s wife retired about five years ago. In recent months it seemed that reaching the age of 66 while still in the workforce would increase one’s amount of pension.<p><p>After May Åberg plans to spend more time at his cabin and on his sailboat in Virolahti.<p><p>He does not plan to quit working, either. Åberg will make a so-called professor agreement with the university. He may take students as he pleases, teach courses and finish ongoing instructions. He will have the same workspace and e-mail.<p><p>Åberg considers the arrangement ideal. What he holds of particular value is the way the university treats retirees as resources that can be utilised instead of decrepits.<p><p>“Of course, younger people consider me somewhat ‘over the hill’. It is also a part this working community; competition is tough.”<p><p>MARIA MUSTARANTA – HS ANNIKA RAUTAKOURA – HT Image: LIISA TAKALA<p>", "time": "2014-01-25T04:28:09+02:00", "type": "working-life"}
{"title": "Turn work stress into your friend", "url": "http://www.helsinkitimes.fi/working-life/9073-turn-work-stress-into-your-friend-2.html", "review": "", "content": "<p>Recent studies reveal that perception of stress plays an important role in its effect.<p><p>TIME pressure, tight schedules and the increase of pace at work might not be the only causes of stress-related diseases. New research suggests that stress can also have a negative effect just because people believe it does.<p><p>According to the Institute of Behavioural Sciences at the University of Helsinki, stress has been misunderstood. “Stress is a positive state, meaning that it’s an adaptive mechanism which prevents us from getting into danger and prepares us to cope with challenges,” claims Dr. Laura Pulkki-Råback, docent.<p><p>Contrary to popular belief, stress does not inevitably lead us into sickness, and our negative perception of it might, in fact, turn it against our health. Recent studies by Harvard University reveal that participants who took stress as a positive sign had a more confident reaction to it. Biologically speaking, their anxiety did not increase, and so their risk of an eventual heart attack did not rise either.<p><p>When do people interpret stress as harmful? The interpretation of stress depends on the perceptions that people have towards the resources available to cope with daily and work demands, as Pulkki-Råback clarifies.<p><p>“Perception doesn’t necessarily depend on objective features of the situation. Perception can be distorted, although in normal individuals it is quite realistic. In mental disorders, perceptions can be distorted,” she adds.<p><p>Other findings by the University of Wisconsin indicate that a strong negative perception of stress could also play a role in generating an unfavourable effect. The research found that participants who were convinced of stress as harmful for their health had a 43 per cent higher risk of death during the eight-year study period than those who did not have the same conviction.<p><p>The generally accepted view among researchers is that prolonged stress can have a negative impact on health.<p><p>“No-one knows exactly how long stress exposure has to be to have an adverse impact on health. It’d be safe to say that a couple of hours of stress or a few days is probably not too harmful, whereas stress that goes on for months or even years is,” states Katriina Heikkilä, Specialist Research Scientist at the Finnish Institute of Occupational Health (FIOH)<p><p>In addition, people’s vulnerability to anxiety needs to be taken into account: “People differ in their vulnerability to stress. That is why some people get sick from stress (e.g., develop a mental disorder), while others can handle even severe stress. Under similar stress-exposures, people react differently,” Pulkki-Råback says. “Different vulnerability depends on individual dispositions, like temperament, our genetic hardiness, and our prior experiences”<p><p>...<p><p>LIA LEZAMA RUIZ HELSINKI TIMES LEHTIKUVA / HEIKKI SAUKKOMAA<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2014-01-25T04:22:00+02:00", "type": "working-life"}
{"title": "Wages and education, in comparison", "url": "http://www.helsinkitimes.fi/working-life/9083-wages-and-education-in-comparison.html", "review": "", "content": "<p>How relevant is the amount of time spent on your education to the wages you will receive?<p><p>A long training period should result in a good salary, at least if you are training to be a doctor. Still, a blue-collar worker may earn more than a woman with a university degree. That is worth thinking about when making decisions about your future career.<p><p>Education is not cheap, but who foots the bill?<p><p>There is a lot of discussion about whether society should support further study and to what extent it should do so. The other option is that young people use student loans to finance their studies and pay an even larger portion of their studies themselves.<p><p>This makes you wonder whether studying is really worth it. The student loans add up and you might end up in a lot of debt. Paying off your student loan might be hard, especially if the salary you end up with does not compensate for the length of your studies.<p><p>High pay, short education (up to 3 years) €3500 – Flight attendant €3034 – Building electrician €2866 – Metal worker<p><p>High pay, longer education (at least 6 years) €8368 – City Mayor €6068 – Professor €4046 – Economist<p><p>Low pay, short education (up to 3 years) €2641 – Bus driver €2165 – Cook €1866 – Hairdresser<p><p>Low pay, longer education (at least 6 years) €3520 – Veterinarian €2721 – Library assistant €2460 – Children’s teacher<p><p>Expert opinion<p><p>To find out whether studying is worth your while, money-wise, we turn to the experts.<p><p>According to ministerial advisor Ville Heinonen from the Ministry of Education and Culture and special researcher Matti Sarvimäki from the Government Institute for Economic Research, it is worth it.<p><p>“As a general rule, a long training period is reflected in your future salary, your position in the job market and in job security,” Heinonen says.<p><p>“On an individual level, a good income is attainable even without qualifications, for instance for an entrepreneur.”<p><p>According to Sarvimäki, a university degree is worth the trouble – especially in Finland, as further study is more affordable here than in many other countries.<p><p>“For most Finns, their education is the most important investment decision of their lives. It affects your income, your likelihood of being unemployed and where there are vacancies in you field globally.”<p><p>“Education is a good investment, but you should choose your field carefully,” Sarvimäki points out.<p><p>From a financial perspective, training as a doctor is worth your while, so long as you are keen to study and have the talent for it, he suggests.<p><p>“Also people with degrees in economics, law and engineering usually have high income jobs and are rarely unemployed.”<p><p>Even a short training course at a vocational school can lead to high earnings. Dockers, workers at a paper mill and train drivers are all among well paid blue-collar workers.<p><p>Salaries may become high in small key fields where a small group of workers is responsible for operating expensive machinery. Keeping those machines idle is costly. This gives the workers an edge in salary negotiations,” Sarvimäki explains.<p><p>Highly educated, lower paid<p><p>The lowest paid jobs that require an academic degree include childcare workers, social workers, librarians, translators and some artists. These are typically female fields.<p><p>“These careers are chosen by people who do not consider income to be the most important reason for deciding on a career. But this does not mean that these differences in income are fair,” head of research Reija Lilja from the Labour Institute for Economic Research says.<p><p>“If women enter traditionally male fields of work, they tend to also earn better. If these industries are at all appealing, they are worth going into, if the aim is to earn well.”<p><p>A woman’s salary is 82.4 per cent of a man’s salary, on average. However, there is one surprise in the statistics: if she is part of the top tier of executives and officials, a woman’s euro is 111 cents of a man’s euro.<p><p>The smaller incomes of people with university degrees cannot be explained simply by the fact that these jobs are typically done by women, Lilja notes.<p><p>“In the public sector, it is difficult to calculate what is profitable. How do you measure the value of saving a human life or teaching children how to read? It is also a question of values: is it more valuable to mend machinery or to treat people?”<p><p>Keep an eye on stability<p><p>Even if the average salary for your dream job does not take your breath away, it is worth looking at the salary for your entire career and the stability of your future job, Reija Lilja advises.<p><p>“If you are highly qualified, it is less likely that you will become unemployed. Even if your salary seems small, your job may be more secure than those in the industry sector, as they are affected by economic fluctuations more and the likelihood of becoming unemployed is greater.”<p><p>According to Lilja, the care industry is worth at least thinking about. The salaries in the field may increase, because the demand for care workers will rise in future.<p><p>Jaana Laitinen – HS Minna Helminen – HT<p>", "time": "2014-01-24T08:57:59+02:00", "type": "working-life"}
{"title": "How did you start out?", "url": "http://www.helsinkitimes.fi/working-life/8377-how-did-you-start-out.html", "review": "", "content": "<p>Helsinki Times gets four experienced professionals from different fields to share their story on how they entered the labour market.<p><p>Whether related to our academic background or not, first jobs always provide us with a sense of how ‘real life’ works. One of the most difficult challenges is learning how to tolerate others, and of course making ourselves tolerable to them.<p><p>Although these early work opportunities can constitute the beginning of a long and successful career performed in the same area of business, most of the time they are more like a transfer zone in which we seek shelter while figuring out what we are good at and where we want to go next. The following poll illustrates both cases.<p><p>Jessica Wawoe, Global Network Director at an international Digital &amp; Direct Marketing Agency.<p><p>What was your first job? My first college summer job was in Telemarketing. I think I was 19 or 20 and studying International Marketing. I never thought I had ‘sales’ in me, but I managed to sell a local newspaper subscription to a foreigner who didn’t yet speak the language. Not only did it teach me to always first understand who you are talking to, and listen for clues, but also that when telemarketers or helpdesk people ‘bother’ me now, I am not as rude because I know there’s a person behind that phone line who is just doing their job.<p><p>Did it match your expectations? I had little expectations from that job. I chose it because it was related to my studies and it was in Amsterdam.<p><p>What were the most important lessons you learned from the experience? Often concluding that something is not for you can be a good thing in your journey of finding out what you do want to do. That job made me realise that sales is not my thing, and that I needed a dynamic environment with constant change. I am now in a company with that kind of dynamic, and a role where I often need to use that same cultural sensitivity which sold the regional Dutch newspaper to a non-Dutch person.<p><p>What do you think of the current situation of getting a first job? The situation is definitely different from when I started in the dotcom boom in 1998 where I had five solid job offers after having worked less than a year at an Internet start-up (which I had applied to as an intern, but got hired as a Client/Project Manager). I do believe internships are a good entry point, but you need to understand your chances for advancement within that company, even as an intern. And even though the working world might seem daunting, I think you should go with your gut and pursue a job in an area you enjoy and are passionate about. Then success will come naturally.<p><p>•••<p><p>Vivikka Richt, Head of Communications at City of Vantaa.<p><p>What was your first job? My first one was a summer job working in the cafeteria of a psychiatric hospital. Kind of an unusual place to start, I have to say. I was a good match there, though, as most of the patients who came to the cafeteria thought I was one of them! Yet, my first “real” job was around the start of my university studies in journalism: a paid internship for the university radio station. It was just great. I got to do everything from news programmes to feature stories, from radio documentaries to hosting live radio shows.<p><p>Did it match your expectations? It was more than I ever could have imagined. I learned every trick of the trade by doing it, while being mentored by experienced teachers.<p><p>What were the most important things you learned from the experience? The job made me realise how awfully great it is to work for the media. You can always use your medium to make a difference in the world. It also gave me valuable connections, which are still of very much use to me.<p><p>What do you think of the current situation of getting a first job? Internships can still be obtained, but nowadays they’re not usually paid ones. It is not easy to find a job that really can give you an instant boost in your “dream career”. You can always find some work though. Be it cleaning, or selling strawberries at the outdoor market, it always says something about you: that you have energy, and drive to move forward. It is always better to have something in your resume, than to have a completely blank work history. Having done nothing speaks loudly, too, but not of good things.<p><p>Some interesting data on youth employment in Finland:<p><p>• Young people are most often employed by the trade market. About 40,000 people under the age of 28 were employed as salespersons in 2010.<p><p>• Typical work places for young people are cafeterias, bars and shops (also office work and construction work are popular).<p><p>• 39 per cent of the employed under the age of 28 have worked part-time.<p><p>• Medium age for entering into the labour market (the age at which over 50 per cent of the age group are employed) is 24 years for men, and 35 years for women with no education after the comprehensive school. For people with higher education the medium age is between 19 and 22.<p><p>SOURCE: Statistics Finland.<p><p>•••<p><p>Maari Fabritius, Interactive Media Designer at Kide Concept Inc.<p><p>What was your first job? My first ever job was as a summer telephone central operator / receptionist in a mid-sized electronics company. I think I was about 14 or 15.<p><p>Did it match your expectations? My parents worked there, so I had been to the place and knew the people already. Many had given me the conference room cookies when I visited there as a kid. Working at that post was challenging and hectic, with multiple calls coming in as well as people from the door. I don’t think I really had any expectations, but was excited to have my first summer job ever.<p><p>What were the most important things you learned from the experience? I learned that in stressful situations the right attitude toward others can make all the difference, especially when things are not going as planned. People are willing to support you, if you are sincere and positive, even when the situation is not ideal. I learned that communication skills are essential. These are things that have been crucial for my career ever since becoming an entrepreneur.<p><p>What do you think of the current situation of getting a first job? I was lucky to have people around who trusted me for this very first job. Having worked from this early age, I gained confidence and I’ve never had trouble getting work – both when freelancing as student and later on with my own design company. I think having self confidence helps a lot when competing for a position. I do believe the competition is getting harder though.<p><p>•••<p><p>Sini Castrén, Crisis Management Consultant, team leader/ Peace Support at SaferGlobe Finland<p><p>What was your first job? My first job was at the Botanical Gardens (Kaisaniemi, Helsinki). I was 15 and still at school doing official “Preparation for work life practice”. I worked as a laboratory and general assistant for the research team. My tasks included sorting out and cleaning glass tubes in strange machines, organising collections or anything else given to me, wearing a white coat and not breaking anything valuable.<p><p>Did it match your expectations? It fully matched my expectations: an atmospheric, romantic building with forgotten well-preserved plant collections and an amazing world of science. However, it was a bit dull as it was about plants, not about people.<p><p>What were the most important things you gained from the experience? I learned to respect systematic, slow and dedicated work, something happening behind the scenes, like salvage and research work.<p><p>What do you think of the current situation of getting a first job? I consider the first job today as a combination of luck, good school background and networking. In other words, it is about many other qualifications than sheer ‘suitability’ to a particular position. I believe the situation has not changed since the early to mid-1980s (which I was describing above), but only there are maybe even fewer jobs. I also think workers’ rights, such as minimum pay and other ‘good practices’ have not necessarily gotten much better in the past 30 years. State and city councils may have better codes of conduct and follow the labour laws and rules better, but I think in the private market the situation may leave much to desire. Young people tend to be the ones whose rights are not primarily protected by the (elder) rights lobbyists at labour unions.<p><p>EVA BLANCO HELSINKI TIMES LEHTIKUVA / MAKKU ULANDER<p>", "time": "2013-11-14T11:29:42+02:00", "type": "working-life"}
{"title": "High-tech, low-focus life?", "url": "http://www.helsinkitimes.fi/working-life/7563-high-tech-low-focus-life-2.html", "review": "", "content": "<p>Innovations and challenges brought about by technology.<p><p>TECHNOLOGY has brought about numerous changes in the way people seek and share information, communicate and work. However, some experts have warned about the negative effects of technology on the quality of both professional and private life.<p><p>The creation of Web 2.0 has had a huge impact on the way people stay connected, find information and live. It seems as if technology has been nothing but a good thing, especially in professional life. New tools, decreasing prices and the ability to perform several tasks at the same time are just a few of the improvements that technology has brought about.<p><p>Professional life<p><p>It has become easy to look for information online, write an email, connect with a friend across the world and read a company memo simultaneously. The habit known as “multitasking” has allowed people to get much more done.<p><p>However, according to some experts, multitasking is not such a good thing, as it decreases workers’ efficiency. In an interview with The Huffington Post, author Tony Schwartz explained how the digital overload generated by multitasking “makes for a superficial experience.” In other words, the amount of work done and information processed can indeed be greater, but at the expense of quality.<p><p>Tips for being in control of technology:<p><p>• Prioritise: start your day by doing the most important things first.<p><p>• Be selective: choose your information sources wisely and budget the time you spend on them.<p><p>• Take breaks: whenever you feel your mind tiring, stop for a while and stretch a little or take a walk.<p><p>• Be careful with multitasking: doing many things at the time may not be the best solution for you.<p><p>• Have the will to unplug and to keep technological distractions away.<p><p>Social media is another innovation that has been the target of criticism in professional life. Even though they represent new ways to communicate and share information, creating new jobs and reshaping the structure of some organisations, they have been a nightmare for many employers.<p><p>Employees visit Facebook, Twitter and similar platforms while at work. This has resulted in a lack of concentration and decrease of efficiency and productivity in several offices across the world.<p><p>In order to tackle the problem, several companies have banned these services, sometimes even by blocking access to the sites from corporate computers. It appeared the problem had been solved, until the smartphone came.<p><p>...<p><p>YANNICK ILUNGA HELSINKI TIMES LEHTIKUVA / MIKKO STIG <p><p> <p><p> <p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-09-05T10:57:09+03:00", "type": "working-life"}
{"title": "Professor proposes grants for unemployed to boost internationalisation", "url": "http://www.helsinkitimes.fi/working-life/7561-professor-proposes-grants-for-unemployed-to-boost-internationalisation.html", "review": "", "content": "<p>A good knowledge of local customs works as a launching pad for international business.<p><p>Young people out of work should be offered an opportunity to live abroad for a while to gain knowledge of the local language and culture, claims Arto Lahti, Professor of Entrepreneurship from Aalto University. Lahti proposes that the unemployed could receive travel grants in exchange for getting to know a foreign country and writing a report on their stay.<p><p>”If there was a simple model that made it possible to send youngsters abroad, the internationalisation process would speed up. The model may not require any additional funding as the unemployed receive benefits anyway while living in Finland. For example Asia and South America have a lot of potential that we are not aware of,” Lahti explains.<p><p>He stresses that the only road to internationalisation is to live abroad.<p><p>”The best way to learn the customs of the business world is to live in the culture where the business takes place. And you must have real interest in the local customs and culture, otherwise business relationships will not work.”<p><p>Saying that Finnish companies have already set up successful internationalisation programmes, Lahti praises the KONE Corporation’s policy of sending new graduates on secondment to the company’s overseas units.<p><p>”You should get to know places while you are still young.”<p><p>Business only on second day<p><p>Eija-Riitta Huovinen, Communications Manager from Nokia, who has worked both in China and Singapore, does not believe cultural differences are a major factor in workplaces.<p><p>“I think cultural differences are more noticeable outside work. The best teachers of a foreign culture are the locals, who in my experience are usually happy to help.”<p><p>Huovinen explains that all Nokia employees who take a foreign posting visit the country before their stint there so that they know what to expect.<p><p>Lahti claims that there are thousands of Finnish companies with potential to expand abroad. Electronic communications having made it easy to gather information on a business partner, face-to-face meetings can these days be used to forge personal relationships.<p><p>“Finns still tend to go straight to business on the first day of negotiations even though this is when you should be gaining trust and focusing on personal matters. Only the second day is for hard business.”<p><p>MINNA NYRHINEN – STT NIINA WOOLLEY – TH LEHTIKUVA / MARKKU ULANDER <p>", "time": "2013-09-05T10:51:26+03:00", "type": "working-life"}
{"title": "Highly educated women edging their way into male-dominated fields", "url": "http://www.helsinkitimes.fi/working-life/7560-highly-educated-women-edging-their-way-into-male-dominated-fields-2.html", "review": "", "content": "<p>Researcher: Tempting men into taking up careers in traditionally female occupations has proved a forlorn hope.<p><p>AT THE beginning of the 1990s, when Pauliina Tenhunen started working as a lawyer in Castrén &amp; Snellman, she was the only female lawyer at the oldest law firm in Finland. Now nearly half of the firm’s more than hundred lawyers are women.<p><p>“The change has taken place step by step, with the number of women increasing over time,” says Tenhunen, who has risen to the position of managing partner during her twenty years with the firm.<p><p>The growing female presence in the law field reflects the changes that have taken place in highly educated professions at large in Finland over the past two decades. The records of Akava, the Confederation of Unions for Professional and Managerial Staff, attest to this, with women comprising 52 per cent of their membership.<p><p>While women have edged their way into male-dominated professions requiring a high level of education, it has proved impossible to get men to enter education and health fields in large enough numbers. Besides female lawyers, the number of women training as engineers has more than doubled since the early 1990s.<p><p>On the other hand, twenty years ago, one in three teachers was male; now the corresponding figure is one in four, with education being one of the fields that are quickly becoming more female-dominated. Tenhunen believes that maintaining a balance between sexes in every field is beneficial.<p><p>“It also improves the workplace atmosphere,” the managing partner comments.<p><p>Money talks<p><p>Tarja Arkio, senior adviser at Akava, explains that a lot of work has been done over the years to lure women into areas once thought to be the exclusive domain of men, and while this has been to some extent successful it has turned out to be extremely difficult to get men to enter female-dominated occupations. The main reason for this is that men are used to earning high wages and those are hard to come by in what have traditionally been thought of as a woman’s jobs.<p><p>The “competitive fields” are not without pay inequality either. With more than half of their members being women, for a number of years the Finnish Association of Business School Graduates (SEFE), has been active in drawing attention to pay issues. Female economists earn on average 10 per cent less than their male colleagues. Arkio states that the principles of equality are planted early on.<p><p>“We have to think about these matters already at schools. Now, many practices in schools are based on gender roles and the work the teaching staff are doing to abolish these roles is not easy,” says Arkio.<p><p>These traditional practices manifest themselves, for example, in boys playing football while girls dance.<p><p>Gender roles behind their times<p><p>According to Hanna Ylöstalo, researcher at the Work Research Centre, the Finnish views on what men and women are like and what are suitable occupations for each are still rigid. She states that, for example, leadership skills are still often connected with qualities that are thought to be more typically male than female.<p><p>“One factor explaining the gender division on the job market is the long tradition of the Nordic welfare state. In Finland, care work has become paid work for women unlike in many other countries,” Ylöstalo explains.<p><p>Ylöstalo believes that gender roles in work life are harmful, leaving individuals’ talents untapped and making the job market more rigid.<p><p>“Amidst all the turmoil and changes in work life, gender roles have come to stand for permanence. Even though women are more educated than men these days, the work life inequalities have not disappeared,” the researcher states, referring to pay differences.<p><p>A woman’s euro has now been 80 cents for years.<p><p>MIKKO NIEMELÄ – STT NIINA WOOLLEY – TH LEHTIKUVA / KIMMO MÄNTYLÄ <p>", "time": "2013-09-05T10:45:40+03:00", "type": "working-life"}
{"title": "Fun with colleagues", "url": "http://www.helsinkitimes.fi/working-life/7558-fun-with-colleagues-2.html", "review": "", "content": "<p>Spending free time with work buddies can help you bond.<p><p>IN MANY countries, it is common for colleagues to hang out over after-work beers, go on group holidays or attend cultural events together. In the UK and Ireland, for example, going to the pub round the corner for a pint with your workmates is a normal way to end a hard working day.<p><p>However, spending leisure time with colleagues is unusual in Finland. The separation of work and private life is greater here than in many other European countries. Based on theories of team building, companies are seeking to encourage their employees to engage in activities together. Not only can they strengthen bonds between colleagues, they are often great fun as well – even more when trying out new things.<p><p>Company-internal tournaments allow employees to play while adding competitive and teambuilding elements. Whether competing outdoors at football, basketball or frisbee golf, or indoors at table football or bowling, there is a broad range of activities that can improve morale and fitness.<p><p>Back to nature<p><p>Sports and outdoor activities offer many ways to have a great time together. Geocaching – a modern way of treasure hunting, using GPS to find hidden boxes with items left by others – has been around for some years now and is still growing in popularity. Teams usually have to solve a riddle in order to get the right coordinates for the treasure and thus, geocaching encourages colleagues to work as a team. The tasks can be found on the official website and are often linked to sights or events that happened on the treasure spot.<p><p>Finland’s natural environment is a treasure for outdoor fans. Outdoor bouldering is a nice way to test one’s limits, although people suffering from vertigo had better stick to other activities. The lakes are perfect for canoeing. Together with your colleagues, it’s even more fun.<p><p>Laser tag has experienced a revival after the success of TV series “How I Met Your Mother” – with good reason. Participants get together in teams and try to “tag” opponents with laser guns in a dimly-lit, maze-like setting. Coordinating with each other and using good tactics is vital to winning this fast-paced game.<p><p>Garden fun for everyone<p><p>Industrial psychologists have found that a company garden, which can serve as a relaxing spot for lunch breaks as well as for after-work barbecues or even for welcoming business partners, is a good way to help strengthen social bonds, especially in smaller enterprises. It helps people relax during the stressful workday, and even brings the joy of harvesting fruit and vegetables that the team has planted together.<p><p>Classic Finnish ways to spend time together include barbecues and sauna, karaoke nights and ice-skating on frozen lakes in the winter. Or how about an action-filled afternoon spent in Linnanmäki, Helsinki’s fun park located just north of the city centre?<p><p>However, the core element of shared free time with work buddies is that it should be completely voluntary. Different people have different approaches on how much they want to socialise with their colleagues. This should always be respected – compulsory participation might have the reverse effect to the originally intended goal.<p><p>FABIAN UNGER HT CHRIS SANSENBACH / CC<p>", "time": "2013-09-05T10:40:08+03:00", "type": "working-life"}
{"title": "Getting work done", "url": "http://www.helsinkitimes.fi/working-life/6221-getting-work-done-2.html", "review": "", "content": "<p>Time management techniques can help us increase our productivity and prioritise tasks.<p><p>WE OFTEN find ourselves struggling with deadlines or unable to carry out our daily tasks. We experience a continuous time pressure and a feeling of not being able to meet the expectations demanded from us.<p><p>Adding to these external pressures, our distractions have grown exponentially over the years with Facebook, Twitter, Whatsapp and other social media. Luckily there are a number of time management techniques to increase the efficiency of our work hours and help us have everything done by the end of day.<p><p>Dr. Alec Mackenzie, author of The Time Trap, a bestselling book on time management, states, “A daily plan, in writing, is the single most effective time management strategy.” According to Mackenzie, the absence of a plan is likely to result in unproductive time use and mentally wandering around all our tasks. Mackenzie recommends writing a daily plan to guide you, prioritising your tasks and having a backup in case of interruptions. Even though time management might seem like common sense at work, it still requires self-discipline and practice.<p><p>25 min. of pure work<p><p>A technique to efficiently manage time while studying or working is Francesco Cirillo’s Pomodoro Technique. During his first year in university Cirillo found himself struggling with exam deadlines and distractions while studying. He got a kitchen timer in a shape of a pomodoro (Italian for tomato) and bet himself to study non-stop for 10 minutes, and that is how he came up with his technique. It later evolved into setting the kitchen timer for 25 minutes of pure work (a Pomodoro), with no interruptions or splitting of time allowed. After the first Pomodoro we take a 3-5 minute break and after four Pomodoros Carillo recommends taking a 15-30 minute break to reorganise our minds. This technique enhances concentration by cutting down interruptions and improves the work and study process.<p><p>...<p><p>ALVARO SOTOMAYOR HELSINKI TIMES PHOTOS: ALVARO SOTOMAYOR<p>", "time": "2013-05-03T14:46:21+03:00", "type": "working-life"}
{"title": "Teleworking is only half Greek to us", "url": "http://www.helsinkitimes.fi/working-life/6219-teleworking-is-only-half-greek-to-us-2.html", "review": "", "content": "<p>Employees love it, the environment likes it, powers-that-be support it, so get to it.<p><p>“WE regretfully decline comment – our policy is not to participate in this – unfortunately we cannot comply at this time.” This was the strand of the commentary from a good handful of Finnish companies when approached about teleworking. Perhaps it is the recession and the layoffs that make companies cautious. But forward-looking openness is exactly what is needed in these times, so let’s talk about teleworking – taking work to the people, not vice versa.<p><p>“Work is not a place but a series of tasks.”<p><p>When it comes to big business, Microsoft is among the biggest, and they are fully supportive of teleworking, as exemplified by their statement that “Work is not a place but a series of tasks,” and also in view of the fact that they are not brushing the teleworking concept under the carpet, away from staff eyes.<p><p>“Our company supports flexible workplace arrangements; the place does not matter, as long as the work gets done. Some of the people based in our Espoo office live in different Finnish cities, and this is no problem. Most of them telework on 1-2 days per week, depending on the situation,” says Pertti Kokko, Sales Manager for Microsoft Finland.<p><p>Microsoft Finland introduced teleworking to provide their staff with freedom and flexibility in work arrangements and explore the possibilities of technology; they were also able to avoid relocating or renting another floor in the building.<p><p>How does Microsoft ensure that work gets done when out of the office? “Well, if you have employees present at the office, how can the boss tell that they are working efficiently or just fooling around? Control is not the answer; it is more a question of leadership and self-management. With our people, the more probable issue is how they can avoid working too much. We do have targets and clear indicators to measure them, both at employee and team level and on the level of the Finnish subsidiary, to make sure that the company can meet its financial goals.”<p><p>...<p><p>Mika Oksanen Helsinki Times LEHTIKUVA / SARI GUSTAFSSON<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-05-03T14:38:34+03:00", "type": "working-life"}
{"title": "Becoming your own boss in Finland", "url": "http://www.helsinkitimes.fi/working-life/6217-becoming-your-own-boss-in-finland-2.html", "review": "", "content": "<p>Motivations, challenges and formal matters for the regular citizen starting a business.<p><p>WHAT comes to your mind when you think of Finnish start-ups? Maybe Rovio and Angry Birds. Or maybe a couple of guys in their twenties becoming millionaires overnight by inventing a ground-breaking mobile phone game. Or the avalanche of IT initiatives developed by former Nokia employees.<p><p>Becoming an entrepreneur is not about reinventing the wheel, but, like any other job, putting your talents to work.<p><p>Look in the mirror<p><p>Are you suitable entrepreneur material? The Finnish Association of Enterprise Agencies (Suomen uusyrityskeskukset ry) lists some qualities an entrepreneur should have: “hard working, creative, bold, works on own initiative, strives for good results, determined, knows how to sell his/her product, prepared to take risks, and can cope with uncertainty.”<p><p>Links of interest<p><p>All the following links contain information in English,<p><p>Finnish and Swedish, except where indicated.<p><p>• Enterprise Finland<p><p>www.yrityssuomi.fi: Service coordinated by the Ministry of Employment and the Economy to help aspiring entrepreneurs and businesses that are already running.<p><p>• Finnish Trade Register<p><p>www.prh.fi: Public register that contains official information of businesses all over Finland. Detailed information for the registration of new businesses, associations and foundations.<p><p>• Finnish Business Information System<p><p>www.ytj.fi: Information on the currently valid Trade Register and Tax Administration entries for any company. You can also change your company’s address and contact details online in the BIS Service (this latter service is available only in Finnish and Swedish).<p><p>• Perustayritys<p><p>www.perustayritys.fi: Free, easy, fast and reliable online service for setting up the basic documents, bank accounts and insurance policies needed to start a business.<p><p>• Startup Sauna<p><p>www.tartupsauna.com: Founded in 2010, it is a non-profit organisation for startups and aspiring entrepreneurs in Northern and Eastern Europe and Russia, with the aim of implementing a blooming startup ecosystem and a pay-it-forward culture in the region in order to make it the best place to be a startup. Information available only in English.<p><p>Provided that you have or are willing to nurture the attributes listed before, you should now choose what kind of business you will establish. Depending on the magnitude of your operations, the capital you require to start and how many partners you will have, among other things, these are the main forms of enterprise allowed by the Finnish authorities: sole trader; general partnership; limited partnership; limited company; co-operative; and branch of a foreign enterprise. In Finland, limited liability company and sole trader name are the most common types for new businesses, followed by general partnership and limited partnership.<p><p>Why start your own business<p><p>Small businesses have been regarded by many, including US President Barack Obama, as “the backbone” of a country’s economy. The case is no different in Finland, as a study by the University of Turku states. The research shows that 55 per cent of Finnish adults, particularly the highly educated, perceive good opportunities for entrepreneurship in the country. Not surprisingly, out of the 300,000 businesses that exist in the country, roughly 98 per cent are small and medium-sized enterprises, according to Harri Jyrkiäinen, Chairman of the Finnish Association of Small Businesses.<p><p>Nani Härkonen is the owner of one of these small initiatives, Nani Annette Photography. “I became a private trader already in early 2011. At that time I had a full time job in an NGO, but when my business grew quite a bit in the last quarter of 2011, I knew I had to choose”, says Härkonen. “I decided to jump.” Her talent hasn’t gone unnoticed: she was recently awarded with The Best Photograph of Animals prize at the Baltic Photo Contest 2013.<p><p>...<p><p>HECTOR MONTES HELSINKI TIMES<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-05-03T14:33:21+03:00", "type": "working-life"}
{"title": "The end of the contract?", "url": "http://www.helsinkitimes.fi/working-life/6215-the-end-of-the-contract-2.html", "review": "", "content": "<p>Within the tumultuous labour market, Finland’s foreign workers face difficult times.<p><p>MOVING to Finland with a job to walk into is an opportunity not to be sniffed at, especially if the salary enables you to enjoy the trappings of a comfortable lifestyle. However, without longer-term employment opportunities, working life in Finland will become more unpredictable, as evidenced by statistics on foreigners and experiences of members from the smaller expat community.<p><p>According to the official statistics, in 2010 the proportion of foreigners living in Finland was 2.9 per cent, much lower than in other Nordic countries and the EU-27 average of 6.5 per cent. At present, these statistics remain largely unchanged. It is not uncommon for foreigners to find themselves struggling within the tumultuous world of unemployment and tearing their hair out over cumbersome Finnish bureaucracy. According to the Employment Service Statistics of the Ministry of Employment and the Economy, at the end of November 2011 the total number of foreign citizens among unemployed jobseekers in Finland was 17,500, up 500 from November a year ago. Of these foreign unemployed jobseekers, EU/EEA citizens accounted for 4,200 at the end of November, up 200 from the year before. These increases are disproportionate when compared with total unemployment in Finland: jobseekers registered at Employment and Economic Development Offices totalled 230,000, down 13,000 from the previous year.<p><p>Expats or foreigners?<p><p>Expats are a smaller group (there are currently no official statistics) who see themselves as distinct from Finland’s larger foreign population that includes immigrants, precarious workers and asylum seekers. Expats are more likely to have been recruited to Finland, many on fixed-term contracts, to work for established corporations like Nokia and Kone, smaller IT companies, and the academic sector.<p><p>This marks another key difference: it is common for the organisations that employ expats to help with bureaucracy and other matters, such as relocation, health care and social networks, whereas for immigrants it is largely up to families to fend for themselves.<p><p>Expats also tend to be more globally mobile and thus more likely to up sticks and move to new employment wherever opportunities arise. However, those expats who choose to remain in Finland after their initial fixed-term contracts have expired, face similar challenges to the foreign population, the main one being securing another job, let alone getting help finding one.<p><p>...<p><p>GARETH RICE HELSINKI TIMES LEHTIKUVA / MIKKO STIG / MATTI KAINULAINEN<p><p>Only a fraction of the articles are available to public, please subscribe to be able to read whole article on the digital paper.<p><p>Please check our subscription periods and prices from here.<p><p>Read Helsinki Times with a subscriber code Helsinki Times's digital paper has moved to our partner's website, LEHTILUUKKU.FI<p><p>Helsinki Times can be read with a subscriber code provided by the publisher or subscription office.<p><p>If you have received a subscriber code from the Helsinki Times, you may attach it to your Lehtiluukku user account to gain free access to Helsinki Times. The same subscriber code is valid for iPad and iPhone Helsinki Times' application.<p><p>Also the Android App is downloadable from Google play.<p>", "time": "2013-05-03T14:27:41+03:00", "type": "working-life"}
