{"title": "Best Bank To Open An Account For Immigrant", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=95687&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi there, I would like to get some advice about which bank has the most lenient regulations for foreigners to open a bank account. Currently I will sign my work contract on 12.9, and I have my passport with me. My employee need me to get verokortti and finnish bank account. I have heard that opening bank account with passport only is a little bit difficult. I live in Helsinki. Thanks for all the suggestions.<p><p>rob360 wrote:Currently I will sign my work contract on 12.9, and I have my passport with me. My employee need me to get verokortti and finnish bank account. I have heard that opening bank account with passport only is a little bit difficult. I live in Helsinki. With a residence permit or registration of right of residence, the banks are legally required to open an account for you. If they give you a hard time, demand that you get \"peruspankkipalvelut\". http://www.finanssivalvonta.fi/en/Finan ... fault.aspx<p><p>While betelgeuse is correct from a legal point of view, there are things you need to keep in your mind from the practical point of view. If don't want to bother fighting the usually ignorant bank customer service intern about your rights, I suggest you avoid Nordea completely. Almost all other banks make things easier for immigrants. Anecdotally, OP bank is one of the easiest banks for getting your online banking and online identity access from.<p><p>Beep_Boop wrote:While betelgeuse is correct from a legal point of view, there are things you need to keep in your mind from the practical point of view. If don't want to bother fighting the usually ignorant bank customer service intern about your rights, I suggest you avoid Nordea completely. Almost all other banks make things easier for immigrants. Anecdotally, OP bank is one of the easiest banks for getting your online banking and online identity access from. I couldn't agree more. My experience is from few years back. I was turned down at Nordea (Myyrmäki branch in Vantaa) just because my ethnic looks, whereas OP (Osuuspankki) treated me as any customer and there was no problem whatsoever to open an account. My vote goes to OP. As it happens, my husband at that time moved all his accounts and savings from Nordea to OP at the same time.<p><p>Thank you for the suggestions. Does anyone has experience with S Pankki ? I just had a chat with their customer service via their website, she said that I could come and bring my passport to the bank office.<p><p>Eveningstar wrote:I couldn't agree more. My experience is from few years back. I was turned down at Nordea (Myyrmäki branch in Vantaa) just because my ethnic looks, whereas OP (Osuuspankki) treated me as any customer and there was no problem whatsoever to open an account. My vote goes to OP. As it happens, my husband at that time moved all his accounts and savings from Nordea to OP at the same time. In the last couple years the law has changed and the government officials have issued some interpretations on what constitutes discrimination. This means all old experiences should be taken with a grain of salt. Of course it's valid to use old back experiences to select even if the experience nowadays has no problems.<p><p>rob360 wrote:Thank you for the suggestions. Does anyone has experience with S Pankki ? I just had a chat with their customer service via their website, she said that I could come and bring my passport to the bank office. They don't offer documents or net banking in English which can be an issue to foreigners.<p><p>betelgeuse wrote:rob360 wrote:Thank you for the suggestions. Does anyone has experience with S Pankki ? I just had a chat with their customer service via their website, she said that I could come and bring my passport to the bank office. They don't offer documents or net banking in English which can be an issue to foreigners. Especially if one needs to understand what it reads in papers to be signed and without understanding there can't be binding contract... iirc that was the reason Nordea gave while back?<p><p>Eveningstar wrote:My experience is from few years back. I was turned down at Nordea (Myyrmäki branch in Vantaa) just because my ethnic looks, whereas OP (Osuuspankki) treated me as any customer and there was no problem whatsoever to open an account. Are you really sure that it was due to your ethnic look and not due to their policies? I don't know now but back then, Nordea had different policies regarding the bank accounts for people with no Finnish ID and passport (alien's passport wasn't accepted). On the other hand, OP did accept alient's passport as valid ID document. As I understood, they had such policies to tackle money laundering etc. I used to work for refugees, so my exp comes from helping them open bank accounts.<p><p>007 wrote:Eveningstar wrote:My experience is from few years back. I was turned down at Nordea (Myyrmäki branch in Vantaa) just because my ethnic looks, whereas OP (Osuuspankki) treated me as any customer and there was no problem whatsoever to open an account. Are you really sure that it was due to your ethnic look and not due to their policies? I don't know now but back then, Nordea had different policies regarding the bank accounts for people with no Finnish ID and passport (alien's passport wasn't accepted). On the other hand, OP did accept alient's passport as valid ID document. As I understood, they had such policies to tackle money laundering etc. I used to work for refugees, so my exp comes from helping them open bank accounts. Well you will be the judge: Altough I am African originated I am Swedish citizen since 18 years by now. I got married with a Finn and by the time we went to open an account for me I already had both Finnish person number and Finnish person ID card. I was dressed business casual however my husband was wearing just jeans and jacket as they were going to have a team building day at work with outdoors activities. We were entering Nordea office and got stopped by a young YUP looking guy; we were in good mood and said good Morning with smile in our face; he promptly asked what was the reason we are there and my husband responded we are here to open an account for me, his wife. We were asked how much money would be deposited to my account each month; a question we certainly did not expect to hear before our turn comes and we could be seated in front of Customer Service officer. We were surprised because of this ackward situation and asked this person are we now being served already, as there apparently is a queue here. At that point we were told by this young man they cannot help us with the account. We left the place, obviously my husband was mad due to impolite treatment and wanted to complain, but I just told him to forget it. We went to OP nearby and there were no problem whatsoever. No staring from head to toe, people talked to us as any customer, I had my documents with me and boom; I had a bank account. Few days later my husband became customer of OP too and terminated all contracts with Nordea. He was asked why - afterwards he told me he had replied \"because you should not judge the book by its' cover\" followed by a good look at me through glass wall while I was waiting outside, so the Customer Service rep had to see it (no way I would dare to enter their premises again).<p><p>Eveningstar wrote:007 wrote:Eveningstar wrote:My experience is from few years back. I was turned down at Nordea (Myyrmäki branch in Vantaa) just because my ethnic looks, whereas OP (Osuuspankki) treated me as any customer and there was no problem whatsoever to open an account. Are you really sure that it was due to your ethnic look and not due to their policies? I don't know now but back then, Nordea had different policies regarding the bank accounts for people with no Finnish ID and passport (alien's passport wasn't accepted). On the other hand, OP did accept alient's passport as valid ID document. As I understood, they had such policies to tackle money laundering etc. I used to work for refugees, so my exp comes from helping them open bank accounts. Well you will be the judge: Altough I am African originated I am Swedish citizen since 18 years by now. I got married with a Finn and by the time we went to open an account for me I already had both Finnish person number and Finnish person ID card. I was dressed business casual however my husband was wearing just jeans and jacket as they were going to have a team building day at work with outdoors activities. We were entering Nordea office and got stopped by a young YUP looking guy; we were in good mood and said good Morning with smile in our face; he promptly asked what was the reason we are there and my husband responded we are here to open an account for me, his wife. We were asked how much money would be deposited to my account each month; a question we certainly did not expect to hear before our turn comes and we could be seated in front of Customer Service officer. We were surprised because of this ackward situation and asked this person are we now being served already, as there apparently is a queue here. At that point we were told by this young man they cannot help us with the account. We left the place, obviously my husband was mad due to impolite treatment and wanted to complain, but I just told him to forget it. We went to OP nearby and there were no problem whatsoever. No staring from head to toe, people talked to us as any customer, I had my documents with me and boom; I had a bank account. Few days later my husband became customer of OP too and terminated all contracts with Nordea. He was asked why - afterwards he told me he had replied \"because you should not judge the book by its' cover\" followed by a good look at me through glass wall while I was waiting outside, so the Customer Service rep had to see it (no way I would dare to enter their premises again). Nordea provides services in English and it was the only bank as far as I know, which served foreigners in English in the past. So, people of your color and mine (I am a South Asian) is not something new to them. Since according to you, an employee at Nordea didn't serve you and it wasn't obviously due to the lack of necessary documents, I don't know... what else to say. I certainly won't judge you or Nordea.<p><p>Hmmmm....I am not fully following you. I never said anything about not getting service in English language. The whole discussion at Nordea office was taking place in English. I don't agree on Nordea being the only bank either, OP customer service was fluent in English....it was not a century ago, but year 2012.... Someone was asking for guidance, I am just agreeing with someone else on this thread how people can be treated, this was my experience and it is 100% true. Anyone can select any bank they like, I have decided which way to go a long time ago.<p><p>Hmmmm....I am not fully following you. I never said anything about not getting service in English language. The whole discussion at Nordea office was taking place in English. I don't agree on Nordea being the only bank either, OP customer service was fluent in English....it was not a century ago, but year 2012.... Well, my point was services in English including contracts and online banking* that Nordea provide are targeted towards foreigners (black, white, brown, yellow etc). So, since Nordea has been dealing with people of your look and mine for decades and my own experience with Nordea regarding my clients, I wondered whether your problem stemmed from the lack of documents as demanded by Nordea. Nordea really stuck out like a sore thumb on this as other banks presumably didn't have such policies in place. Since you said you had Finnish ID and all, I have nothing more to say on this. *correct me if I am wrong but I am sure only Nordea had such services in English up until OP came along.<p><p>I'm not sure how far in the past you are referring to, but I got my omline banking services in English. cannot remember how it was with the contracts. Anyway, I have been talking about next to horrible customer experience at Nordea. If they had their policy in place when others did not, in our case they nevertheless failed while another bank (with or without policy) treated us well. This is all I have to say about my case.<p><p>007 wrote:*correct me if I am wrong but I am sure only Nordea had such services in English up until OP came along. I have vague recollection that at one point Nordea was the only bank offering netbank in English. But that is ancient history. like a decade ago. I found a review of netbanks from 2010 that lists Nordea, OP, Sampopankki and Ålandsbaken having English as option.<p>", "content": "Hi there, I would like to get some advice about which bank has the most lenient regulations for foreigners to open a bank account. Currently I will sign my work contract on 12.9, and I have my passport with me. My employee need me to get verokortti and finnish bank account. I have heard that opening bank account with passport only is a little bit difficult. I live in Helsinki. Thanks for all the suggestions.", "time": "Sat Sep 09, 2017 10:50 am", "type": "forum"}
{"title": "Local British idiot seeks advice", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96620&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Edit Aug 2018: Found employment, thank you all! I will continue updating if people are interested with anything I learn about the integration process, paperwork etc. Edit Dec 2018: Confirmed my temporary residence of a year, and now waiting on Migri to process me to apply for permanent residency. More information about this process is in the update posts in the thread --------- Hello guys! I'm new to the forum, it's great to meet you all. I'm not sure how much activity we see around here since I have been nudged to ask questions in the Facebook page, but I thought starting off here would be nice. I'm a sucker for forums. I'm looking at moving to Finland in the next year or so. I'm a British citizen currently employed in the games industry full-time. I managed to get my position through some hard work and (I assume) showing a lot of enthusiasm, since I do not have any further education past high school. The reason I mention that is that I have seen a lot of work requiring at least some sort of university certification, and I was wondering how difficult people would think it is to become employed in Finland without one? The plan currently is for me to find work over there, ideally within the same industry since that's where I feel I can apply the most experience and skill. Like a lot of people, my plans are inspired by having a Finnish girlfriend, but I've loved my time in the country when I have visited and I really do want this to work out. Any advice or insight welcome. Thank you for reading!<p><p>Work experience of a few years in the same field/a similar job trumps formal education (without the same experience), having proof that you can actually perform in the job, that's what ultimately matters for the hiring employer.<p><p>Thanks so much, that puts me a bit at rest. A lot of the positions I have seen online require a degree and experience, but these are for senior positions much higher than the ones I'd be aiming for. I have heard that Finland is very \"word of mouth\"/network-y, even more so than other countries, so I am keeping my fingers crossed that in reality what I see online isn't all there is. Cheers for the answer and I'll be digging into this subject more <p><p>AllieBee wrote: ↑Mon Apr 23, 2018 11:15 am Thanks so much, that puts me a bit at rest. A lot of the positions I have seen online require a degree and experience, but these are for senior positions much higher than the ones I'd be aiming for. I have heard that Finland is very \"word of mouth\"/network-y, even more so than other countries, so I am keeping my fingers crossed that in reality what I see online isn't all there is. Cheers for the answer and I'll be digging into this subject more Normal. Companies want teen double doctorate with 10 years relevant work experience.. but yeah, Finland likes their degrees, but games industry is young and the degrees are new thing. Before degrees there were the demo scene.<p><p>Upphew wrote: ↑Mon Apr 23, 2018 3:00 pm Normal. Companies want teen double doctorate with 10 years relevant work experience.. but yeah, Finland likes their degrees, but games industry is young and the degrees are new thing. Before degrees there were the demo scene. Oh yes, definitely normal even outside of Finland... I've just never seen such a lack of jobs advertised online before, and this is both in Finnish and English searches. That said, it would have been a miracle to find an answer simply through online applications anyway! Thanks for the answer - it is a new scene, so there should be opportunities out there. I'll keep on looking until I find them. (:<p><p>There are loads of jobs e.g. in LinkedIn, at least for IT in general. One has to remember that Finland has some 5+ million inhabitants, the job or any other market cannot be compared to countries with multiple times that. Also, it is not uncommon that a foreigner thinks that the capital area (Helsinki, Espoo, Vantaa) = Finland. It is the most populated area, sure, but e.g. Tampere and Oulu, even Jyväskylä and Kuopio have their share of IT companies.<p><p>I meant no insult to Finland in my answers, apologies if it came across that way! I acknowledge that my industry and my skillset are more specific than just \"IT\" and that I am only searching in the Helsinki area due to personal circumstances, so such difficulties are ones that I expected. I created this thread to get an idea of education expectations in general. I did vent a bit in my last reply here but as I also said, it would have been surprising to find something through purely online channels.<p><p>Since it's gaming industry that you're interested in, I'd directly check their websites, see what they are currently offering, and contact them even if there are no openings posted. Don't know how up-to-date the list is, but at least a starting point: https://www.neogames.fi/en/industry-info/operators/<p><p>I'm not sure if people usually update, but I wanted to say thank you for the advice (and to those who reached out via PM). I've found a job in the Helsinki area and I'll be moving around October to get set-up and start full time. I can't wait!<p><p>Reading this just now, congrats! And I think most here value the updates, especially if they've answered or helped out. I was going to say, looking for gaming jobs you'll be even better of in Helsinki than elsewhere, as a lot of game companies have their offices there. But then saw you already got a job, wow, awesome luck. Hope it all goes smoothly for you guys! -- Needless to say perhaps, but just remember to do all the paperwork locally asap you get here, to start processes going (like for getting Kela card later for healthcare etc.). Would be nice to see an update how it's going in a new Finnish environment in that new job too, after a while. I'm also a sucker for forums, hate fb. And had to reply also because Picard.<p><p>Definitely! I'll keep updating if it will help people. The company I am now with has said they will help with the paperwork as they have processed expats before, but I'll be looking into it myself as well so I have some understanding before moving. I'm due to start in October so I have time to wrap up loose ends with my current employer and prepare for the cross-country jump, but I'll be back eventually (and hopefully with more good news) (:<p><p>Hey, it's now October and I am 3 weeks into my move to Finland and 2 weeks into the new job. I have an appointment with the Migri office this week which will hopefully approve my work visa. I'm wondering if anyone knows if this is when I will be allocated a social security number, or is this later when they have made a decision? It has been lovely settling in, although the public transport costs are hurting! I can't wait to be able to get a travel card at citizen rates. Because Kössi K was interested in particular, the workplace I am in is made up of both Finnish and foreign employees and it has been very welcoming so far. No real update for this part yet as it has only been 2 weeks, but it is looking like a promising new venture I will update this thread after my work visa is sorted to make sure I have wrapped up this thread properly. Wish me luck!<p><p>What work visa? You don't need a work residence permit (or in British terms, a work-based temporary leave to remain). You're an EU citizen. Just follow the instructions here https://migri.fi/en/eu-citizen . They'll ask you to come and show your passport, and you'll be given the approval immediately with a personal identity number.<p><p>AllieBee wrote: ↑Sun Oct 28, 2018 9:29 pm Hey, it's now October and I am 3 weeks into my move to Finland and 2 weeks into the new job. I have an appointment with the Migri office this week which will hopefully approve my work visa. I'm wondering if anyone knows if this is when I will be allocated a social security number, or is this later when they have made a decision? There are no social security numbers. There are personal identity codes and they imply nothing about social security. It's easiest to get the personal identity code from the Tax Administration at the same time when you get a tax card for withholding. https://www.vero.fi/en/individuals/tax- ... n-finland/<p><p>Beep_Boop wrote: ↑Mon Oct 29, 2018 9:36 am What work visa? You don't need a work residence permit (or in British terms, a work-based temporary leave to remain). You're an EU citizen. Just follow the instructions here https://migri.fi/en/eu-citizen . They'll ask you to come and show your passport, and you'll be given the approval immediately with a personal identity number. I can stay for 3 months to do that, but I need to register with a work contract to get a personal ID. From your link: \"An EU citizen must have grounds for residing in Finland and/or sufficient funds to live in Finland. An EU citizen may not cause an unreasonable burden to the Finnish social security system.\" By saying work residence permit, I mean that I will be staying on grounds of long-term employment here. Apologies for any confusion betelgeuse wrote: ↑Mon Oct 29, 2018 10:35 pm There are no social security numbers. There are personal identity codes and they imply nothing about social security. It's easiest to get the personal identity code from the Tax Administration at the same time when you get a tax card for withholding. https://www.vero.fi/en/individuals/tax- ... n-finland/ Maybe all the people around me just used \"social security number\" so I'd understand? I was told I needed one to sign up for a travel card, do taxes, etc. Sorry for using the wrong term if that's the case. What I have been told to do is go to Migri and sign up online with my work contract. I have met them now with my passport and a copy of the work contract, and I'm now pending their final approval of my registration here to stay longer than 3 months. After that, they said they will give me a social security (or, personal ID it seems) number. That's the update for now! Migri was a straightforward process and it is all done online after the first meeting, at least in my case.<p>", "content": "Edit Aug 2018: Found employment, thank you all! I will continue updating if people are interested with anything I learn about the integration process, paperwork etc. Edit Dec 2018: Confirmed my temporary residence of a year, and now waiting on Migri to process me to apply for permanent residency. More information about this process is in the update posts in the thread --------- Hello guys! I'm new to the forum, it's great to meet you all. I'm not sure how much activity we see around here since I have been nudged to ask questions in the Facebook page, but I thought starting off here would be nice. I'm a sucker for forums. I'm looking at moving to Finland in the next year or so. I'm a British citizen currently employed in the games industry full-time. I managed to get my position through some hard work and (I assume) showing a lot of enthusiasm, since I do not have any further education past high school. The reason I mention that is that I have seen a lot of work requiring at least some sort of university certification, and I was wondering how difficult people would think it is to become employed in Finland without one? The plan currently is for me to find work over there, ideally within the same industry since that's where I feel I can apply the most experience and skill. Like a lot of people, my plans are inspired by having a Finnish girlfriend, but I've loved my time in the country when I have visited and I really do want this to work out. Any advice or insight welcome. Thank you for reading!", "time": "Fri Apr 20, 2018 10:36 am", "type": "forum"}
{"title": "Residence permit questions", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97831&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello everyone. I'm trying to move to finland soon as my girlfriend is pregnant. Since it is very exspensive to apply without considering the time and cost of going to the right consulate location I am trying to double check that i am doing things correctly. Of course anybody I try calling is unable to help and just seems to want to move me along to someone else. Best i can figure is that I should apply for the permit on other grounds. It says the process will take 3+ months compared to 4+ months if i apply for the regular working/residence permit. This is important as we want to be together as soon as we can for the end of her pregnancy. But maybe more important, and this is the main thing I am confused about, is I believe that if I apply for a permit based on pregnancy grounds then I will still have a right to work but do not have to find a job before i start my application. Meaning I could start my application now rather than in a month or two when, or really if, I find a job. Ideally I want to apply and work here in the U.S. while waiting for the permit then once i get it I could move to finland and while i am there start looking for a job. But ive read and talked to people who say different things about this. Can anyone give me some more solid information or just some advice in general? There really doesnt seem to be much information out there for pregnancy situations. And as i mentioned making phone calls only seems to waste time and hear repeated useless information. Thabk you so much!<p><p>Hi! I'm new (still moving) but you can find all the information on their immigration website, no need to call. I think in your situation you're naturally trying to apply on the ground of Intimate relationship, if not married. But there you will find the right to work under such permit is limited (same as specialists below), and the first permit would take 4-8 months. If you're married or have lived 2 years at least you could apply the normal type, with unrestricted right to work. What industry do you work at and at what level? The fastest permit is one month for specialists or management. You'd need to secure a job first. It took me 3 months to pass all the interviews and tests (typically 4-5) so this might not be faster. Application fee is only 350-420€. It should be the least of your concern as you'd also need to prove your income/saving without a binding job contract in Finland.<p><p>Ok thank you. It does seem that the permit for an intimate relationship is what i need. I was putting that in the other catagory. Which if that is the case then it would also seem that I do not need to have a job before applying but that once accepted I do have a restricted right to work. Is this correct in your opinion? I am a floor installer at journeyman level in the state of Washington. Other than that I have basic skills in janitorial and clerking and hospitality. It would be nice to get into flooring as i could make the most money but right now our priority is getting me over there so we can all be together. Which brings me to my next question. If the application takes 4-8 months and I have to accept their decision in the country from which i applied then I am considering to fly to finland and apply there and then fly back to the U.S. to work until they say if they have accepted me which is when i can return to finland to get my card and not have to leave again. That way I can work and still hopefully be in finland toward the end of the pregnancy. Whereas if i apply in the U.S. I could visit finland and be unable to work and might have to return to accept their decision at critical timing during the pregnancy. Does anyone have tips or advice in if it is better to apply in the U.S. or in finland?<p><p>Note the intimate relationship residence permit requires you to have an income of 1000€ / month, your girlfriend income or money are not considered your income. Also the right to work is restricted to these: * in the top or middle management of a company or in a specialist position requiring special skills * as a professional athlete, coach or trainer, or sports judge or referee * in the service of a religious or non-profit organisation * professionally in the field of science, culture, or arts, with the exception of musicians playing in restaurants * in an international organisation or in a position related to official co-operation between states Does your floor installer fit job into this?<p><p>Bring her to the USA for a visit and get married while she is there. Then a residence permit will be MUCH easier to get approved.<p><p>Do you know if that has to be income every month or can I have that as saved money? For example if I have 6000e saved they could see I could last for 6 months. Or maybe i need to have 1000e per month for the entire duration of the permit. So if i get a year long permit I would need to have 12000e to apply? Because if I don't get a job until after I move there then all I will have is what I am able to save by working here the next few months while waiting for the application process. As for if my flooring skills would fit into one of those categories that's not up to me is it? It seems that someone would need to define what specialist position and special skills mean. Also if I get a job what determines if it is middle management? Those restrictions seem very arbitrary to me so how am I to know if my trade fits into one of them? These are the kind of things it would be nice to talk to someone who actually works in the embassy about. But nobody I've called seems to know or want to talk and help me.<p><p>I didn't apply for that but the website looks clear: For married, \"Income requirement\" in https://migri.fi/en/spouse-in-finland-w ... nce-permit which will lead you to https://migri.fi/en/income-requirement- ... in-finland so the two of you should have to prove yourself being able to support you, your wife and your child, which could mean +1000 +700 +500 = 2200 EUR per month, after tax and pension. no mention of current deposit, but perhaps showing them your past bank statements/contract together with a deposit for a few months can convince them? The embassy is probably not the right place to ask, as their role in the application process is to fingerprint you and collect the fee, while the rest is handled by the immigration in Finland. Have you tried to contact https://migri.fi directly by email? ------------------------------------------------------------------ As for specialist, on https://migri.fi/en/specialist/en Specialists for example include: - IT experts - experts in some field of specialisation who have a higher education degree - other persons with a higher education degree whose work requires expert knowledge the higher education means a Master's degree not Bachelor's I was told (need confirmation). And the salary must be 3000 EUR minimum. but most importantly, I guess, is that companies looking for specialists actually want those from outside of EU because of shortage. That means experienced - I didn't see any company looking for juniors on the job board of my industry. ------------------------------------------------------------------ top and middle management looks even more difficult, https://migri.fi/en/top-and-middle-management - Your employer’s number of employees and turnover must be high enough so that it qualifies as a large enterprise. The company must have a clear division into top and middle management. - You have subordinates and you belong to top or middle management. ------------------------------------------------------------------ Getting a non-specialist job is probably difficult, as the unemployment rate has been high comparing to neighboring countries, and you're not Finnish. I understand you want to move by the time baby is born, but the timing is probably impractical. Have you considered other options? Moving first and trying to get a job later is suicide from what I gathered elsewhere... It's not too easy to get a job even for foreign students graduated in Finland.<p><p>pigdoesasapigdo wrote: ↑Tue Jan 15, 2019 4:21 pm As for if my flooring skills would fit into one of those categories that's not up to me is it? It seems that someone would need to define what specialist position and special skills mean. Also if I get a job what determines if it is middle management? Those restrictions seem very arbitrary to me so how am I to know if my trade fits into one of them? Do you speak Finnish? If you don't, I think it would be almost impossible to find a job in your field, or at least very difficult. It's possible to live in Finland only with english, but for some works you would need Finnish.<p><p>For married, \"Income requirement\" in https://migri.fi/en/spouse-in-finland-w ... nce-permit For married with a Finnish citizen there is no income requirement.<p><p>tavastia wrote: ↑Tue Jan 15, 2019 9:13 pm For married with a Finnish citizen there is no income requirement. Thanks for correction! So the actual link for OP is https://migri.fi/en/spouse-is-a-finnish-citizen Processing time 5-9 months Income requirement You do not need to have secure means of support. Right to work You have an unrestricted right to work. You cannot start working before you get a residence permit. That should address most of his problems. The only one remaining is how he will find a job.<p>", "content": "Hello everyone. I'm trying to move to finland soon as my girlfriend is pregnant. Since it is very exspensive to apply without considering the time and cost of going to the right consulate location I am trying to double check that i am doing things correctly. Of course anybody I try calling is unable to help and just seems to want to move me along to someone else. Best i can figure is that I should apply for the permit on other grounds. It says the process will take 3+ months compared to 4+ months if i apply for the regular working/residence permit. This is important as we want to be together as soon as we can for the end of her pregnancy. But maybe more important, and this is the main thing I am confused about, is I believe that if I apply for a permit based on pregnancy grounds then I will still have a right to work but do not have to find a job before i start my application. Meaning I could start my application now rather than in a month or two when, or really if, I find a job. Ideally I want to apply and work here in the U.S. while waiting for the permit then once i get it I could move to finland and while i am there start looking for a job. But ive read and talked to people who say different things about this. Can anyone give me some more solid information or just some advice in general? There really doesnt seem to be much information out there for pregnancy situations. And as i mentioned making phone calls only seems to waste time and hear repeated useless information. Thabk you so much!", "time": " Mon Jan 14, 2019 8:29 pm", "type": "forum"}
{"title": "Finnish residence permit processing 2017-2018-2019", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97834&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hey guys. I just applied for Finnish residence permit for days ago base on family tie, i am married to a finnish citizen. I have residence permit from another EU country, so i am not in Finland with visa. Can you guys share your experience, the process time and what ground you got your residence permit with me? I am a bit nervous it will take several months before migri make the decision. Is it possible for someone to get decision earlier? I will be grateful to know your experience.<p>", "content": "Hey guys. I just applied for Finnish residence permit for days ago base on family tie, i am married to a finnish citizen. I have residence permit from another EU country, so i am not in Finland with visa. Can you guys share your experience, the process time and what ground you got your residence permit with me? I am a bit nervous it will take several months before migri make the decision. Is it possible for someone to get decision earlier? I will be grateful to know your experience.", "time": " Tue Jan 15, 2019 5:14 pm", "type": "forum"}
{"title": "Entrepreneur Visa for Online Work", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97802&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello, Does anyone know what's considered as enough profit per week on Entrepreneur visa? Immigration site doesn't say. I earn 340 Euros per week. I know this is little but I only currently work for a few hours (not full time), planning to get more clients online though. Also, I will be staying with my boyfriend in Finland so I won't need much for rent costs. Everything with my work is done online. Also, how long does the first permit last? It doesn't say on the site. Thank you!!<p><p>quillcentaur wrote: ↑Sun Jan 06, 2019 8:09 am Hello, Does anyone know what's considered as enough profit per week on Entrepreneur visa? Immigration site doesn't say. I earn 340 Euros per week. I know this is little but I only currently work for a few hours (not full time), planning to get more clients online though. Also, I will be staying with my boyfriend in Finland so I won't need much for rent costs. Everything with my work is done online. Also, how long does the first permit last? It doesn't say on the site. Thank you!! Visa is for visiting (up to three months), Residence Permit is for residing. Residence permits are usually, afaik, first for one year and then for four. After that you'll get permanent permit.<p><p>@Upphew. Thanks. I am aware about the Visit Visa. I actually just got approved with Visitor Visa. But planning to apply for Residency Permit under Entrepreneur. Anyone who has an idea how much is considered \"sufficient income\" in this case?<p><p>The TE office looks at each entrepreneur and their business individually. There is no one set number. You could use the family member income requirements as a rough guideline but the income of the entrepreneur is only one factor. Another thing they will probably want to know is why does online work require you to be in Finland. If you cannot give a good reason for that, you are unlikely to be approved.<p><p>Hi How can i join your company online work? Im interested <p>", "content": "Hello, Does anyone know what's considered as enough profit per week on Entrepreneur visa? Immigration site doesn't say. I earn 340 Euros per week. I know this is little but I only currently work for a few hours (not full time), planning to get more clients online though. Also, I will be staying with my boyfriend in Finland so I won't need much for rent costs. Everything with my work is done online. Also, how long does the first permit last? It doesn't say on the site. Thank you!!", "time": " Sun Jan 06, 2019 8:09 am", "type": "forum"}
{"title": "Permanent RP decision is not visible in Enter Finland", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97712&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi guys, perhaps someone can advise. Enter Finland states that decision has been made already 5 days ago, but it is not in any way specified what decision it is- negative or positive. Is it always the case that the positive decisions are visible straight away in Enter Finland? Or should one wait for post? Many thanks in advance.<p><p>Julche wrote: ↑Tue Dec 11, 2018 11:22 pm Hi guys, perhaps someone can advise. Enter Finland states that decision has been made already 5 days ago, but it is not in any way specified what decision it is- negative or positive. Is it always the case that the positive decisions are visible straight away in Enter Finland? Or should one wait for post? Many thanks in advance. When the decision is made you can see your applications under the section \"previous applications\", have you checked there?<p><p>I have the same situation as well now it's been 6days.my decision is empty but there's appeal attachments those are showing.but at first when I open the application there was orange notification saying you will receive your RP after two weeks.in so confused<p><p>Masters wrote: ↑Sun Jan 13, 2019 11:39 am I have the same situation as well now it's been 6days.my decision is empty but there's appeal attachments those are showing.but at first when I open the application there was orange notification saying you will receive your RP after two weeks.in so confused You have the right to appeal a positive decision. The default rule is that appeal instructions must be included with administrative decisions.<p><p>0kay thanx for the info.I thought always on enterfinland if they put appeal attachment then the decision is negative.<p><p>Mine also i got neagtive decisions i send to appeal to administrative court i hope they make positive decisions for my permanent residents.. <p>", "content": "Hi guys, perhaps someone can advise. Enter Finland states that decision has been made already 5 days ago, but it is not in any way specified what decision it is- negative or positive. Is it always the case that the positive decisions are visible straight away in Enter Finland? Or should one wait for post? Many thanks in advance.", "time": "Tue Dec 11, 2018 11:22 pm", "type": "forum"}
{"title": "RP processing time in step2 (in progress)", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97665&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Dear all, Could you share your information about RP processing time specially in the step2 (in progress) on EnterFinland? I applied my RP in June 2018. After staying in the step1(waiting for the process) for almost six months, finally it moved on to step2(in progress) two weeks ago. But no updates since then. According to the past article, seems there was a people who stayed \"in progress\" for a week or even a few days. There was also a people, on the other hand, who stayed more than a month in the same status step2. I know I just need to wait with patience, but still would like to know the latest situation and more examples in similar condition. So kindly share your case. Would it takes even a few more months for the final decision? This is my first RP apply for the spouse of a Finnish citizen (my husband is native finnish). I have once stayed in Finland in 2011 as an exchange student. At that time it took about 8 weeks to get RP for studies. Best,<p><p>24 .04.2018 i still wait<p><p>Thank you for sharing your info. Have you been staying in the step2 or just staying in the step1 since April? No inquire or contact from migri at all?<p><p>Student permits are processed much more quickly than others. Do not compare to that. Family ones can take 9 months or even more. The fact that it has moved to stage 2 means that you are at the top of the queue. However, after that it is so individualized that it is hard to say how long. Every document you submitted will be thoroughly checked and verified. If something is unclear or difficult to verify, that can slow the process. Hope your wait will be over soon.<p><p>number 2 .We also had an interview<p><p>Nina Sanna wrote: ↑Sat Dec 01, 2018 7:35 pm number 2 .We also had an interview Hello, we applied on May and our application moved to phase 2 \" in progress \" just a week ago followed with questions I have answered and questions that were sent to my spouse in Finland as well. And I have no idea about the next step so back to waiting I thought of sharing our experience !<p><p>We are in the same situation<p><p>heretostay wrote: ↑Sat Dec 01, 2018 1:38 pm Student permits are processed much more quickly than others. Do not compare to that. Family ones can take 9 months or even more. The fact that it has moved to stage 2 means that you are at the top of the queue. However, after that it is so individualized that it is hard to say how long. Every document you submitted will be thoroughly checked and verified. If something is unclear or difficult to verify, that can slow the process. Hope your wait will be over soon. Appreciate your reply. I made up my mind to wait as much as it needs.. Just hope the decision will be ready without a problem.<p><p>Hi, I applied March 23rd, it moved to processing in September and I'm still waiting for their reply since then..It's really becoming frustrating to wait..Can't they just get it done already<p><p>Nina Sanna, ranou12 and Hakima01, Oh... all of you waiting so long even after went to step2.. I imagine how you feel. I applied June 4th, moved on to step2 November 15th. No question or interview has been required yet. Seems it will probably takes more than I expected. Thank you for telling your situation. It helps to be shared.<p><p>For some people in this blog I cannot send anyone my personal privacy for those who send me message asking me to give them my own personal questions what my wife get from migri this belong to me and my wife (is my own privacy) so I hope those can understand in this blog and every case is so different (age sex nationality and love story relationship ) My application take 6 months to start processing and after it started processing only after 2 days they sent already questions to my wife on 8 of November 2018. 23 questions and asking me to contact embassy for interview and embassy give me interview which it will be in 16 January 2019 and I'm so fine with that date eveb is so long,because embassy say we have already many applicants before you so we give you right time for you , I'm so fine with everything and wish everyone here the best and no need to be rude in this blog you will only get information from people who have same situation like you,you will not get your resident permit here so be patient and wish everyone luck Thank you <p><p>Hello everyone!I applied for first RP enter Finland 5 September but give fingers 1 october.my wife is Finnish citizen.my question is how long my application stay waiting for process and second question is migri take all couple interview or its depend on cause.third question is if apply outside Finland and enter Finland migri take same time or different.thanks<p><p>Hi, I am also in Progressing and now still waiting. My history: 26 May 2018: Apply online 04 Jun 2018: Visit the Embassy 04 Jul 2018: Have identity and history number 27 Nov 2018: In Progressing and Suplement Request within 3 weeks 01 Dec 2018: Reply to the request of suplement That has been too long time to wait for reunion with my husband, not easy. And now continue waiting. Hoping we all will get the positive results. Good luck to you all!<p><p>Hi! I have been same situtation had interview on august 3rd reply to supplement on 27 august , still havenot got Decision<p><p>Achrafakil wrote: ↑Tue Dec 04, 2018 11:23 pm For some people in this blog I cannot send anyone my personal privacy for those who send me message asking me to give them my own personal questions what my wife get from migri this belong to me and my wife (is my own privacy) so I hope those can understand in this blog and every case is so different (age sex nationality and love story relationship ) My application take 6 months to start processing and after it started processing only after 2 days they sent already questions to my wife on 8 of November 2018. 23 questions and asking me to contact embassy for interview and embassy give me interview which it will be in 16 January 2019 and I'm so fine with that date eveb is so long,because embassy say we have already many applicants before you so we give you right time for you , I'm so fine with everything and wish everyone here the best and no need to be rude in this blog you will only get information from people who have same situation like you,you will not get your resident permit here so be patient and wish everyone luck Thank you Best wishes for your coming interview and hope will get decision soon after that. Thank you for message.<p>", "content": "Dear all, Could you share your information about RP processing time specially in the step2 (in progress) on EnterFinland? I applied my RP in June 2018. After staying in the step1(waiting for the process) for almost six months, finally it moved on to step2(in progress) two weeks ago. But no updates since then. According to the past article, seems there was a people who stayed \"in progress\" for a week or even a few days. There was also a people, on the other hand, who stayed more than a month in the same status step2. I know I just need to wait with patience, but still would like to know the latest situation and more examples in similar condition. So kindly share your case. Would it takes even a few more months for the final decision? This is my first RP apply for the spouse of a Finnish citizen (my husband is native finnish). I have once stayed in Finland in 2011 as an exchange student. At that time it took about 8 weeks to get RP for studies. Best,", "time": " Fri Nov 30, 2018 2:49 pm", "type": "forum"}
{"title": "Citizenship Application", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97774&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi all, i moved to Finland in August 2014. i had a B permit for two years and i have had my A permit for almost three years. Can I go ahead and apply for the citizenship? Thanks and look forward for your reply<p><p>Beny80 wrote: ↑Fri Dec 28, 2018 8:45 pm Hi all, i moved to Finland in August 2014. i had a B permit for two years and i have had my A permit for almost three years. Can I go ahead and apply for the citizenship? Thanks and look forward for your reply As the minimum amount of uninterrupted residence time in Finland is 5 years: not yet. Wait till you fulfill all of the requirements and only then apply: https://migri.fi/en/citizenship-application<p><p>Here some information too: https://www.foreigner.fi/articulo/movin ... 01038.html<p><p>wolf80 wrote: ↑Sat Dec 29, 2018 7:26 pm Beny80 wrote: ↑Fri Dec 28, 2018 8:45 pm Hi all, i moved to Finland in August 2014. i had a B permit for two years and i have had my A permit for almost three years. Can I go ahead and apply for the citizenship? Thanks and look forward for your reply As the minimum amount of uninterrupted residence time in Finland is 5 years: not yet. Wait till you fulfill all of the requirements and only then apply: https://migri.fi/en/citizenship-application Also depends on what ground your A permit is right now. If you are on Working permit or anything other than family ties, the residence time required is 5 years; but if you have a Finnish spouse (‘Spouse’ refers to your husband or wife, your cohabiting partner or your registered same-sex partner.) then 4 uninterrupted years is enough.<p>", "content": "Hi all, i moved to Finland in August 2014. i had a B permit for two years and i have had my A permit for almost three years. Can I go ahead and apply for the citizenship? Thanks and look forward for your reply", "time": " Fri Dec 28, 2018 8:45 pm", "type": "forum"}
{"title": "Urgent: Consultant Visa App Within Finland", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97811&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi, So my bf owns a company and he wants to hire me as a consultant (not specialist, as that seems like a headache). I will be in Finland this Saturday for a week and after that I need to leave as my 90 days in Schengen are over. I have to make a decision right now whether to apply for the visa when I'm here or wait until I'm back in my home country which is gonna be months from now. I think I got the gist of things but I have a few questions. Yes, I have searched this forum, but still not getting a clear answer. So this is what I'm following: https://migri.fi/en/visiting-consultant-or-instructor Wtf are \"Application-specific\" attachments - are they mandatory or optional? BF's company's lawyer said that an application and job contract is all thats necessary. Like what's the point of having terms and conditions, and then job description and then fringe benefits (what if there aren't any?) - wouldn't that be stated in the job contract? Now, I understand I can apply within Finland and get an extension while they make a decision, but will I be able to apply and book an appt right away (I see hey have appts available next week, but everyone is always like you have to apply and then they contact you for an appt weeks after - or is that just for applications outside Finland? Also, the lawyer said that these consultant visas get processed quickly, while other people on this forum are like it could take months? I know it depends but whats everyone's experience? I'm also applying as a consultant for like art director/web designer whatever, which is related to my previous jobs but not my original degree. Should I attach a resume or reference letter to help? So... Anyone have experience with a consultant/specialist visa? I'm really stressed and overwhelmed and would appreciate anything that could help. Thank you!!!<p>", "content": "Hi, So my bf owns a company and he wants to hire me as a consultant (not specialist, as that seems like a headache). I will be in Finland this Saturday for a week and after that I need to leave as my 90 days in Schengen are over. I have to make a decision right now whether to apply for the visa when I'm here or wait until I'm back in my home country which is gonna be months from now. I think I got the gist of things but I have a few questions. Yes, I have searched this forum, but still not getting a clear answer. So this is what I'm following: https://migri.fi/en/visiting-consultant-or-instructor Wtf are \"Application-specific\" attachments - are they mandatory or optional? BF's company's lawyer said that an application and job contract is all thats necessary. Like what's the point of having terms and conditions, and then job description and then fringe benefits (what if there aren't any?) - wouldn't that be stated in the job contract? Now, I understand I can apply within Finland and get an extension while they make a decision, but will I be able to apply and book an appt right away (I see hey have appts available next week, but everyone is always like you have to apply and then they contact you for an appt weeks after - or is that just for applications outside Finland? Also, the lawyer said that these consultant visas get processed quickly, while other people on this forum are like it could take months? I know it depends but whats everyone's experience? I'm also applying as a consultant for like art director/web designer whatever, which is related to my previous jobs but not my original degree. Should I attach a resume or reference letter to help? So... Anyone have experience with a consultant/specialist visa? I'm really stressed and overwhelmed and would appreciate anything that could help. Thank you!!!", "time": "Wed Jan 09, 2019 12:06 pm", "type": "forum"}
{"title": "Getting married on a tourist visa", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97778&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello, I am a Finnish residence but I am thinking of getting married to my fiancee here in Finland when she comes with a tourist visa. Is it a possibility to get married to her here in Finland while she's one tourist visa?<p><p>agksam wrote: ↑Sat Dec 29, 2018 11:19 pm I am a Finnish residence but I am thinking of getting married to my fiancee here in Finland when she comes with a tourist visa. Is it a possibility to get married to her here in Finland while she's one tourist visa? Yes.<p><p>yup, I have done that this year and in the same time I applied for residence permit and I received it within a week <p><p>Wow thank you very much for your kind answers. I really appreciate.<p><p>Hi, Yes you can but doesn't mean she will receive her residence permit in 1 week it can take up to 9 months or more. Until the RP decision she will be classed as a tourist so can't work claim benefits etc, and she will need health insurance. RP applications are treated individually and not always straight forward. To get married here she will need a Certificate from her country to prove she is single and as far as I remember this must be in Finnish or English. You can find info about marriage at https://www.maistraatti.fi/yhteystiedot. Good Luck!<p><p>bm50 wrote: ↑Wed Jan 02, 2019 5:10 pm To get married here she will need a Certificate from her country to prove she is single and as far as I remember this must be in Finnish or English. You can find info about marriage at https://www.maistraatti.fi/yhteystiedot. Good Luck! And to get married ie. with Thai girl, that paper have to be approved at finnish embassy at Bangkok. And after that, it is very hard to get visitor visa nowadays...<p>", "content": "Hello, I am a Finnish residence but I am thinking of getting married to my fiancee here in Finland when she comes with a tourist visa. Is it a possibility to get married to her here in Finland while she's one tourist visa?", "time": "Sat Dec 29, 2018 11:19 pm", "type": "forum"}
{"title": "Applying RP simultaneously with family member.. Processing time", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96677&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi All. I am new here. I have obtained a job offer in Finland. Thus, I am applying special expert visa . I have submitted the fingerprint etc at the embassy together with my wife and my kid at the embassy (who are applying simultaneously for their respective RP too). My question is, will we gt the RP the same time? Or different time? Because I've read somewhere (could not remember) that they will process it so that we can go there the whole family at the same time. Anyone with the same experience? If yes, how long was your processing time (and your family's) previously? Thanks in advanced.<p><p>Hi, I had a similar situation when we were applying for our first permits. Of course everyone's application is unique but generally special expert RPs are processed quickly. It is not %100 guaranteed but if you apply together with your family, migri will try to process your applications together. At least that's what they told me when submitting the application. We applied and got the results at the same time with my wife in 2016.<p><p>Ozmotix wrote: ↑Mon May 07, 2018 1:06 pm Hi, I had a similar situation when we were applying for our first permits. Of course everyone's application is unique but generally special expert RPs are processed quickly. It is not %100 guaranteed but if you apply together with your family, migri will try to process your applications together. At least that's what they told me when submitting the application. We applied and got the results at the same time with my wife in 2016. Thanks for the reply. How long was the process for your application and your wife taking place ?<p><p>Hi All. Quick update. Thought it would be helpful if I post it here. We (my family and I) have finally received the decision. Total of 42 days were taken from the date we submitted our fingerprint/documents at the embassy. From what I have read previously, for specialist/special expert, the period is 30 days. However, I believe, my application process was delayed because they simultaneously checked /processed my family's applications too. Quite fast actually. Waiting for the physical card now. Good luck for all of you who're still waiting.<p><p>Hi billyk, my family and I have the same application as yours and we're still waiting for the result. Until now, the status in EnterFindland is still waiting for processing. We had our personal appearance in the embassy mid November. Can you still remember when your status changed from Waiting for processing to In progress? Thanks. Your reply is much appreciated.<p><p>Hi I receive my negetive answer to my RP 6 month ago My wife is finland citizen and she is 16 years elder than me . We got married 2 years ago and waiting for RP decision all the time . The immigration office answer was 1. We have different aged people 2.we have not live toghether 3. The marriage is fake . We could meet each other 2times after the negetive answer in Turkey Also I request for Finland visa and it was rejected How long should we wait for apeal reply ? What can we do to make the court answer positive ?<p><p><p><p>Alikind1 wrote: ↑Fri Jan 04, 2019 9:28 pm Hi I receive my negetive answer to my RP 6 month ago My wife is finland citizen and she is 16 years elder than me . We got married 2 years ago and waiting for RP decision all the time . The immigration office answer was 1. We have different aged people 2.we have not live toghether 3. The marriage is fake . We could meet each other 2times after the negetive answer in Turkey Also I request for Finland visa and it was rejected How long should we wait for apeal reply ? What can we do to make the court answer positive ? Hello Did you went for interview before?<p><p>Alikind1 wrote: ↑Fri Jan 04, 2019 9:28 pm What can we do to make the court answer positive ? - Getting a child together. - Live together for two years in Turkey.<p><p>We don’t have child toghether but My wife has already a disable child from ex. Husband And that’s why she can not travel abroad She have to stay to keep this child No we have to travel to Turkey to meet each other We have been together 4 times totally for 45 days We have been together 2 times totally 3 weeks after our RP replayment<p>", "content": "Hi All. I am new here. I have obtained a job offer in Finland. Thus, I am applying special expert visa . I have submitted the fingerprint etc at the embassy together with my wife and my kid at the embassy (who are applying simultaneously for their respective RP too). My question is, will we gt the RP the same time? Or different time? Because I've read somewhere (could not remember) that they will process it so that we can go there the whole family at the same time. Anyone with the same experience? If yes, how long was your processing time (and your family's) previously? Thanks in advanced.", "time": " Thu May 03, 2018 6:13 pm", "type": "forum"}
{"title": "Potential move to Finland", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97746&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi there, This is my first post here - I've just been offered the opportunity to take a decent job up in Helsinki and I have a few questions regarding moving over. I'm from UK, and my wife is from Kazakhstan. We've been living in the Middle East for last few years. We have two toddlers as well. Our main concern/query is about what is the best way to get a residence visa for my wife, and how long would it take? Is it a case of her having to wait a long while to get paperwork approved and stamped, or can she come as a visitor in the interim and stay whilst it is being worked out? My biggest concern is that if she has to wait overseas is that I won't get to see the kids much for an extended period. Can anyone advise of best course of action? Any advice would be appreciated, as my acceptance of this opportunity is based on how.soon my wife can join me. Thank you for your support!<p><p>BritKaz wrote: ↑Thu Dec 20, 2018 6:16 pm Hi there, This is my first post here - I've just been offered the opportunity to take a decent job up in Helsinki and I have a few questions regarding moving over. I'm from UK, and my wife is from Kazakhstan. We've been living in the Middle East for last few years. We have two toddlers as well. Our main concern/query is about what is the best way to get a residence visa for my wife, and how long would it take? A wife of an EU citizen does not need a residence permit. She will register right of residence like EU citizens. BritKaz wrote: ↑Thu Dec 20, 2018 6:16 pm Is it a case of her having to wait a long while to get paperwork approved and stamped, or can she come as a visitor in the interim and stay whilst it is being worked out? My biggest concern is that if she has to wait overseas is that I won't get to see the kids much for an extended period. Can anyone advise of best course of action? No waiting abroad is required.<p><p> A wife of an EU citizen does not need a residence permit. She will register right of residence like EU citizens. As the situation stands now, it looks like he will not be an EU citizen for long. So he will need an RP too.<p><p>betelgeuse wrote: ↑Fri Dec 21, 2018 3:34 am BritKaz wrote: ↑Thu Dec 20, 2018 6:16 pm Hi there, This is my first post here - I've just been offered the opportunity to take a decent job up in Helsinki and I have a few questions regarding moving over. I'm from UK, and my wife is from Kazakhstan. We've been living in the Middle East for last few years. We have two toddlers as well. Our main concern/query is about what is the best way to get a residence visa for my wife, and how long would it take? A wife of an EU citizen does not need a residence permit. She will register right of residence like EU citizens. BritKaz wrote: ↑Thu Dec 20, 2018 6:16 pm Is it a case of her having to wait a long while to get paperwork approved and stamped, or can she come as a visitor in the interim and stay whilst it is being worked out? My biggest concern is that if she has to wait overseas is that I won't get to see the kids much for an extended period. Can anyone advise of best course of action? No waiting abroad is required. Wait a sec... so it's simpler for the spouse of a non-Finnish EU citizen than for the spouse of a Finn? And we spouses of Finns still have to go through the RP process?<p><p>I think you need to apply the RP like the spouses of finns. It is not automatic, of course. If you are not finn, you have to registrate yourself as well. Look at this link, there are some answers: https://www.foreigner.fi/articulo/movin ... 00998.html<p>", "content": "Hi there, This is my first post here - I've just been offered the opportunity to take a decent job up in Helsinki and I have a few questions regarding moving over. I'm from UK, and my wife is from Kazakhstan. We've been living in the Middle East for last few years. We have two toddlers as well. Our main concern/query is about what is the best way to get a residence visa for my wife, and how long would it take? Is it a case of her having to wait a long while to get paperwork approved and stamped, or can she come as a visitor in the interim and stay whilst it is being worked out? My biggest concern is that if she has to wait overseas is that I won't get to see the kids much for an extended period. Can anyone advise of best course of action? Any advice would be appreciated, as my acceptance of this opportunity is based on how.soon my wife can join me. Thank you for your support!", "time": " Thu Dec 20, 2018 6:16 pm", "type": "forum"}
{"title": "Tourist visa for parents", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97783&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>I'm holding a residence permit type A and come to Finland for less than a year. I want to invite my parents to visit me in Finland. I am concern if they could get a tourist visa if I am the one who sponsor them from here because I am unemployed and I moved here less than a year but I miss them and I want them to see where I live.... Have anyone done this recently? any tips? FYI - I am from southeast asia<p><p>hiworld wrote: ↑Sun Dec 30, 2018 10:20 pm I'm holding a residence permit type A and come to Finland for less than a year. I want to invite my parents to visit me in Finland. I am concern if they could get a tourist visa if I am the one who sponsor them from here because I am unemployed and I moved here less than a year but I miss them and I want them to see where I live.... Have anyone done this recently? any tips? FYI - I am from southeast asia You have to prove that you can provide the incoming request for them both. How can you do that if you don’t have a job? On what grounds have you got your permit?<p><p>Hi Vla, I'm married to a finnish citizen, however he is a freelancer so no stable income. My parents will stay at our place so basically there will be no much expense for them, just flight ticket so I just hope that the embassy who issue on visa can see that.<p><p>Your parents may have to prove strong ties to their home country. In other words assurances that they will return home and not overstay their visa.<p><p>hiworld wrote: ↑Mon Dec 31, 2018 1:26 pm Hi Vla, I'm married to a finnish citizen, however he is a freelancer so no stable income. My parents will stay at our place so basically there will be no much expense for them, just flight ticket so I just hope that the embassy who issue on visa can see that. There is a requirement anyway of how much money they need on a daily basis. I think it’s 30€ per day per person. They still need to eat and everything so to have a place to stay it’s not enough. And if they’re entering with a tourist visa they would supposed be doing tourism so they will need money for transportation and maybe some activities. The authorities will definitively ask for this and also the return tickets.<p><p>Why tourist visa?? Why not visiting family/friends visa.<p>", "content": "I'm holding a residence permit type A and come to Finland for less than a year. I want to invite my parents to visit me in Finland. I am concern if they could get a tourist visa if I am the one who sponsor them from here because I am unemployed and I moved here less than a year but I miss them and I want them to see where I live.... Have anyone done this recently? any tips? FYI - I am from southeast asia", "time": "Sun Dec 30, 2018 10:20 pm", "type": "forum"}
{"title": "Car shipping from Uk", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97781&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>This is a car that is to be restored. Anyone with experience of car shipping?<p><p>Rofa1 wrote: ↑Sun Dec 30, 2018 3:19 pm This is a car that is to be restored. Anyone with experience of car shipping? Donkey's years ago (>15), Hanko-Tilbury, you need the other direction https://www.transfennica.com/offices/uk-tilbury Not 100% sure, but I think it needs to be drivable so they can drive it on and off.<p>", "content": "This is a car that is to be restored. Anyone with experience of car shipping?", "time": " Sun Dec 30, 2018 3:19 pm", "type": "forum"}
{"title": "RP", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97193&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Okwuru wrote: ↑Wed Aug 08, 2018 5:19 pm I applied in February 2018, as guardian using my sons birth certificate, even though an married but never applied based on spouse. I hope this isn't an issue, although my wife suggested this to see if the processing time will be quicker. But it's been 5 months plus now and nothing yet. I only saw online yesterday night that my application status is showing 'in progress ' but I got email earlier on that same yesterday that my application is still waiting to be processed. Any advice from anyone what's going on.? HI how did it go with your application, can u give some updates?<p>", "content": "Okwuru wrote: ↑Wed Aug 08, 2018 5:19 pm I applied in February 2018, as guardian using my sons birth certificate, even though an married but never applied based on spouse. I hope this isn't an issue, although my wife suggested this to see if the processing time will be quicker. But it's been 5 months plus now and nothing yet. I only saw online yesterday night that my application status is showing 'in progress ' but I got email earlier on that same yesterday that my application is still waiting to be processed. Any advice from anyone what's going on.? HI how did it go with your application, can u give some updates?", "time": " Tue Jan 01, 2019 2:54 pm", "type": "forum"}
{"title": "Working in Finland", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97693&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello! I have been in Finland couple of weeks now and I would like to work here during the winter. Do you have any ideas how to get a job here? I was thinking about Lappland, but I have been reading that there is no snow...<p><p>Do you have the right to work? What kind of permit do you have?<p><p>I am from EU, so there is no problem. I would like to stay here, I just need to find a job. This forum is great, lots of information. I also found another web with information in English, foreigner.fi. The other pages are all in Finnish, obviously I don´t understand anything . Have you been taking some lessons of Finnish? I just speak some English and Spanish, do you think I can find a job without speaking Finnish?<p><p>Nobody has any ideas about finding a work in Finland?? Maybe I could find something related to tourism? Has anybody been in Lappland? Is it easy to find a job there? I guess there is lots of tourists there... Lappland looks like a great place: https://www.foreigner.fi/articulo/touri ... 00721.html Anybody with some experience??<p><p>I speak spanish too, and english of course. I came here to work, and I don't know or need any finnish in my job, so it's possible, but it depends on the kind of job you pretend to do. In my case I looked for jobs in LinkedIn.<p><p>https://paikat.te-palvelut.fi/tpt/<p><p>google seasonal work Lapland Finland<p><p>Thank you guys . I´ll check out those web-pages. Where is all the snow?? This weather is like North-Spain!! I want to see snow and reindeers . I guess I have to go to Lappland for that. Is there any other place where the foreigners in Finland chat? This forum is not very active...<p><p>Reina wrote: ↑Tue Dec 11, 2018 10:11 am Is there any other place where the foreigners in Finland chat? This forum is not very active... The regular foreigners are all turning Finnish and not talking. <p><p>Secret Code, that may explain everything .<p><p>this is a past event but might provide leads to potential employers for instance. https://www.europeanjobdays.eu/en/event ... me-finland<p><p>From my experience cleaners are in constant demand. Try ISS Palvelut, L&T or SOL Palvelut. I have seen lots of cleaners who don't speak Finnish and only little English. May not be the most glamorous job, but also not so bad that it sounds.<p>", "content": "Hello! I have been in Finland couple of weeks now and I would like to work here during the winter. Do you have any ideas how to get a job here? I was thinking about Lappland, but I have been reading that there is no snow...", "time": " Wed Dec 05, 2018 8:24 pm", "type": "forum"}
{"title": "about the student dependent visa", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97784&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello. I am from Nepal, My husband is in Helsinki Finland for a study purpose. Can anyone tell me the procedure to apply and please tell me about the visa rate from Nepal.<p>", "content": "Hello. I am from Nepal, My husband is in Helsinki Finland for a study purpose. Can anyone tell me the procedure to apply and please tell me about the visa rate from Nepal.", "time": "Mon Dec 31, 2018 12:21 pm", "type": "forum"}
{"title": "Benefits on Type B Permit", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97769&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>I'm planning to move from India to Helsinki. I work in an IT company and they will be sending me there for long term on type B permit. I've few questions around that: 1. Will free healthcare benefits available for me and my family on Type B permit? 2. If yes, then how long does it take to get them started, I suppose we need to register with Social Security and it could takes few months? 3. Can one get Permanent Residence Permit if you live in Finland for more than 4 years on Type B permit? 4. Any idea how Type B permit can get changed to Type A permit without joining any local job in Finland?<p><p>gupta wrote: ↑Thu Dec 27, 2018 9:17 am I'm planning to move from India to Helsinki. I work in an IT company and they will be sending me there for long term on type B permit. B is temporary. gupta wrote: ↑Thu Dec 27, 2018 9:17 am 1. Will free healthcare benefits available for me and my family on Type B permit?' If your work contract is for at least two years. gupta wrote: ↑Thu Dec 27, 2018 9:17 am 3. Can one get Permanent Residence Permit if you live in Finland for more than 4 years on Type B permit? One can not. https://migri.fi/en/permanent-residence-permit gupta wrote: ↑Thu Dec 27, 2018 9:17 am 4. Any idea how Type B permit can get changed to Type A permit without joining any local job in Finland? By satisfying the conditions for an A permit.<p>", "content": "I'm planning to move from India to Helsinki. I work in an IT company and they will be sending me there for long term on type B permit. I've few questions around that: 1. Will free healthcare benefits available for me and my family on Type B permit? 2. If yes, then how long does it take to get them started, I suppose we need to register with Social Security and it could takes few months? 3. Can one get Permanent Residence Permit if you live in Finland for more than 4 years on Type B permit? 4. Any idea how Type B permit can get changed to Type A permit without joining any local job in Finland?", "time": " Thu Dec 27, 2018 9:17 am", "type": "forum"}
{"title": "Residence permit and unemployment", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97738&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello! I have a complicated situation as regards residence permit. I have been living in Finland since 2002 but always with a student visa until four years ago I got a residence permit for work. Now my permit is expiring, and I could be entitled to the permanent residence permit. But in the meanwhile I lost my job, and now I am unemployed. My current income is benefits from Kela. It seems that I have no grounds to apply for the permanent residence permit, as well as for other residence permits, loosing all my efforts of many years. I also completed my PhD degree in Finland two years ago, but cannot find an employment based on my studies as well. Any advice? Thank you!<p><p> but cannot find an employment based on my studies as well Since it seems that work is critical for the new RP, you should look for any kind of work. Restricting yourself to your field of study is to much of a handicap.<p><p>You can apply for citizenship. You won't need any job for that.<p><p>I see... Citizenship is out of question, since I do not speak Finnish. I have been working in an international environment all time.<p><p>rinso wrote: ↑Wed Dec 19, 2018 4:25 pm but cannot find an employment based on my studies as well Since it seems that work is critical for the new RP, you should look for any kind of work. Restricting yourself to your field of study is to much of a handicap. Would \"any kind of work\" be sufficient? I have read that in order to apply for a permanent permit I need to keep the same work as before or a similar one/in the same field. On the other hand, as someone graduated in Finland, as I know, I can stay only if I am employed as an expert in the field of my studies.<p><p>Would \"any kind of work\" be sufficient?Yep, as you've completed your education in Finland, so I believe there shouldn't be any restrictions.. Unless you have some restrictions on your current permit. If there isn't any, than do whatever you like. And still \"working in international environment\" is not an excuse to not to learn Finnish.. It is always a good idea to keep your options open.<p><p>If you have been living here for more than 15 years surely you have picked up some Finnish. I would think with a quick course or 2 you should be ready for the citizenship test (YKI). It isn’t that difficult and you don’t have to be perfect or fluent at all. You only need to pass 2 specific combinations of sections even.<p><p>biryvih wrote: ↑Wed Dec 19, 2018 10:37 pm Would \"any kind of work\" be sufficient?Yep, as you've completed your education in Finland, so I believe there shouldn't be any restrictions.. Unless you have some restrictions on your current permit. If there isn't any, than do whatever you like. My current work permit is made for work in one field (although it is not bound by an exact employer): is this a restriction? My education is completed in another field.<p><p>heretostay wrote: ↑Wed Dec 19, 2018 10:58 pm If you have been living here for more than 15 years surely you have picked up some Finnish. I would think with a quick course or 2 you should be ready for the citizenship test (YKI). It isn’t that difficult and you don’t have to be perfect or fluent at all. You only need to pass 2 specific combinations of sections even. Thank you: I surely picked up some Finnish, but it is not a matter of one-two courses to improve it to the state of the YKI.and the visa question should be solved urgently.<p><p>I must say that I am a bit shocked to see that the OP has lived here for 16 years, did a PhD, wants to keep living here but has not learnt enough Finnish to pass even the YKI test.<p><p>browndude wrote: ↑Fri Dec 21, 2018 9:20 pm I must say that I am a bit shocked to see that the OP has lived here for 16 years, did a PhD, wants to keep living here but has not learnt enough Finnish to pass even the YKI test. I think we all are.<p>", "content": "Hello! I have a complicated situation as regards residence permit. I have been living in Finland since 2002 but always with a student visa until four years ago I got a residence permit for work. Now my permit is expiring, and I could be entitled to the permanent residence permit. But in the meanwhile I lost my job, and now I am unemployed. My current income is benefits from Kela. It seems that I have no grounds to apply for the permanent residence permit, as well as for other residence permits, loosing all my efforts of many years. I also completed my PhD degree in Finland two years ago, but cannot find an employment based on my studies as well. Any advice? Thank you!", "time": " Wed Dec 19, 2018 3:00 pm", "type": "forum"}
{"title": "NEED HELP IN APPLYING FOR A RESIDENCE PERMIT!!", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97727&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello everyone... I need help on this. I am a non EU with an expired residence permit from another EU country and a valid receipt showing I reapplied and haven't gotten a decision yet, I am a guardian of a Finnish citizen and my fiancee is a Finnish citizen (the mother), my fiancee got pregnant when I visited Finland for the second time and my residence permit was almost expired and I traveled back to Italy. I came back with the expired residence card and a receipt when she was 8months pregnant, , now we have done all the paper works like custody and paternity. MY QUESTION HERE IS. CAN I STILL apply for a residence permit based on a guardian of a Finnish citizen while in still in Finland? What are my chances? Or do I need to go and apply and wait for the residence permit in Italy? The mother won't let me go and apply in Italy even if I want because it will take at least 9months and she and I want to be in the child's life from young age.. I am applying next week. Please I need positive advices only. Thanks.<p><p>Hi, Most easy way is to get married.<p><p>Thanks and yes I know many people apply for residence permit based on spouse of a Finnish citizen but at this moment I just want to apply for a guardian and get married next year 2019 after I get my first residence permit<p><p>https://migri.fi/en/my-child-is-a-finnish-citizen As long as you have all the right documents and whatnot and they accept your application, you should be able to wait in Finland for as long as it takes Migri to make a decision. Check the link and make sure you have all your !\"#¤% together before you go.<p><p>undertakerfreak wrote: ↑Sun Dec 23, 2018 6:28 pm https://migri.fi/en/my-child-is-a-finnish-citizen As long as you have all the right documents and whatnot and they accept your application, you should be able to wait in Finland for as long as it takes Migri to make a decision. Check the link and make sure you have all your !\"#¤% together before you go. Thanks so much and I have all the documents ex: custody, paternity and birth certificate for the child.. But the one problem I don't have my residence permit from Italy but just the recipe from Italy and the expired residence card with me but the border control searched me when I entered into Finland from Italy and they knew I had an expired residence card but they let me when I explained my situation... Do you think I will be accepted to stay here and have a residence permit ? I can't afford to be taken out of Finland when I have a litlle boy of just 2months old and I have a joint custody with the mother who is a finnish citizen.. I am sending my application tomorrow on enterfinland.fi<p>", "content": "Hello everyone... I need help on this. I am a non EU with an expired residence permit from another EU country and a valid receipt showing I reapplied and haven't gotten a decision yet, I am a guardian of a Finnish citizen and my fiancee is a Finnish citizen (the mother), my fiancee got pregnant when I visited Finland for the second time and my residence permit was almost expired and I traveled back to Italy. I came back with the expired residence card and a receipt when she was 8months pregnant, , now we have done all the paper works like custody and paternity. MY QUESTION HERE IS. CAN I STILL apply for a residence permit based on a guardian of a Finnish citizen while in still in Finland? What are my chances? Or do I need to go and apply and wait for the residence permit in Italy? The mother won't let me go and apply in Italy even if I want because it will take at least 9months and she and I want to be in the child's life from young age.. I am applying next week. Please I need positive advices only. Thanks.", "time": " Mon Dec 17, 2018 9:30 am", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi I want to create a thread for Residence permit application on the basis of family ties in 2017-2018. Please update your status here. My spouse has applied for residence permit on October 16th 2017 and Its still in 1st step. Could you update your status here. Is there still someone waiting from 2017? Thank you!<p><p>My case: 19.12.2017 You have proved your identity and a diary number has been created for your application. You can see the diary number at the top of the page. Your application has been placed in the processing queue. We will contact you if we need more information from you. Our processing times can be found on our website at www.migri.fi <p><p>our aplication identification made 27.09.17 stupid addition guestion answer send 06.03.18 desision made 11.06.18 now waiting residence permit card<p><p>Hi y'all! We're starting our process in October after we get married. I'm a Finnish national and citizen and my husband to be is American. I was curious, how long had you guys been together and / or married before applying? What kind of questions did Migri ask and whar additional information have they requested? My friend, not talking from her own experience but rather based on hearsay, said Migri has asked to interview friends, see text messages and phone records etc. That won't be a problem, but seems a bit like an invasion of privacy..? Appreciate your replies and sorry for hogging the thread!<p><p>They can ask anything in case something looks suspect, pictures together, phone calls list, times you see, etc. they can interview you separately and compare the answers.<p><p>OMG... That's not a problem at all, just not all our whatsapps are very SFW... Should they want to see them, they'll certainly get an eyeful! Love will conquer even the Finnish government! Has anybody added any extra information (ie. savings account statements, the Finnish spouse's work contract / payslips) or would this be foolish? We're more than capable of providing for ourselves, even though that's not a requirement for a spouse applying for RP.<p><p>Submitted my application in December 2017 My wife received a letter 2 days ago containing questions to be answered, also saying that I have to contact the embassy for an interview that should be done within a month The interview date is unknown according to the embassy -- they don't know yet when it will be possible for me to be interviewed. :>>>>>>>>>>>>>>> Is it true though that they might read our WhatsApp conversation ... I'd feel terrible about that knowing that my privacy with my wife is destroyed, and neither me nor my wife would like that. Good luck everyone. <p><p>ynginvstr wrote: ↑Sat Jun 23, 2018 4:18 am Submitted my application in December 2017 My wife received a letter 2 days ago containing questions to be answered, also saying that I have to contact the embassy for an interview that should be done within a month The interview date is unknown according to the embassy -- they don't know yet when it will be possible for me to be interviewed. :>>>>>>>>>>>>>>> Is it true though that they might read our WhatsApp conversation ... I'd feel terrible about that knowing that my privacy with my wife is destroyed, and neither me nor my wife would like that. Good luck everyone. On which date in December 2017 that you submited your application?<p><p>Pppts wrote: ↑Sat Jun 23, 2018 10:49 pm On which date in December 2017 that you submited your application? Mid-December. <p><p>ynginvstr wrote: ↑Sun Jun 24, 2018 12:22 am Pppts wrote: ↑Sat Jun 23, 2018 10:49 pm On which date in December 2017 that you submited your application? Mid-December. That's like one week before us at the same embassy <p><p>Bluesky12 wrote: ↑Sun Jun 24, 2018 10:23 am ynginvstr wrote: ↑Sun Jun 24, 2018 12:22 am Pppts wrote: ↑Sat Jun 23, 2018 10:49 pm On which date in December 2017 that you submited your application? Mid-December. That's like one week before us at the same embassy How is your situation friend?<p><p>Pppts wrote: ↑Sun Jun 24, 2018 12:42 pm Bluesky12 wrote: ↑Sun Jun 24, 2018 10:23 am ynginvstr wrote: ↑Sun Jun 24, 2018 12:22 am Mid-December. That's like one week before us at the same embassy How is your situation friend? It's still the same, haven't heard from them. right now I'll try to enjoy my holiday the most, and see then....how is your situation?<p><p>Bluesky12 wrote: ↑Sun Jun 24, 2018 2:19 pm Pppts wrote: ↑Sun Jun 24, 2018 12:42 pm Bluesky12 wrote: ↑Sun Jun 24, 2018 10:23 am That's like one week before us at the same embassy How is your situation friend? It's still the same, haven't heard from them. right now I'll try to enjoy my holiday the most, and see then....how is your situation? My husband's application has just started processing. I hope us and everyone the best. <p><p>Pppts wrote: ↑Sun Jun 24, 2018 2:35 pm Bluesky12 wrote: ↑Sun Jun 24, 2018 2:19 pm Pppts wrote: ↑Sun Jun 24, 2018 12:42 pm How is your situation friend? It's still the same, haven't heard from them. right now I'll try to enjoy my holiday the most, and see then....how is your situation? My husband's application has just started processing. I hope us and everyone the best. Congratulations! That's a good news wish you the best. Witch date in December you applied?<p><p>Bluesky12 wrote: ↑Sun Jun 24, 2018 5:11 pm Pppts wrote: ↑Sun Jun 24, 2018 2:35 pm Bluesky12 wrote: ↑Sun Jun 24, 2018 2:19 pm It's still the same, haven't heard from them. right now I'll try to enjoy my holiday the most, and see then....how is your situation? My husband's application has just started processing. I hope us and everyone the best. Congratulations! That's a good news wish you the best. Witch date in December you applied? Also in the mid December <p>", "content": "Hi I want to create a thread for Residence permit application on the basis of family ties in 2017-2018. Please update your status here. My spouse has applied for residence permit on October 16th 2017 and Its still in 1st step. Could you update your status here. Is there still someone waiting from 2017? Thank you!", "time": " Mon Jun 18, 2018 8:12 pm", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018 - Page 2", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=6db7e42f437a76f7758e1eea57c0649b&start=15", "review": "<p>Pppts wrote: ↑Sun Jun 24, 2018 5:35 pm Bluesky12 wrote: ↑Sun Jun 24, 2018 5:11 pm Pppts wrote: ↑Sun Jun 24, 2018 2:35 pm My husband's application has just started processing. I hope us and everyone the best. Congratulations! That's a good news wish you the best. Witch date in December you applied? Also in the mid December Mid-December family. <p><p>ynginvstr wrote: ↑Sun Jun 24, 2018 6:31 pm Pppts wrote: ↑Sun Jun 24, 2018 5:35 pm Bluesky12 wrote: ↑Sun Jun 24, 2018 5:11 pm Congratulations! That's a good news wish you the best. Witch date in December you applied? Also in the mid December Mid-December family. <p><p>Finally something is happening they started processing.<p><p>Applied 7th may 2018(paper), finnish spouse. No news yet.<p><p>More then six months... >19.12.2017 You have proved your identity. >19.06.2018 The processing of your application has started. >27.06.2018 You have sent additional information for the application. >09.07.2018 A decision has been made on your application.<p><p>ihalainen wrote: ↑Mon Jul 09, 2018 1:21 pm More then six months... >19.12.2017 You have proved your identity. >19.06.2018 The processing of your application has started. >27.06.2018 You have sent additional information for the application. >09.07.2018 A decision has been made on your application. Which embassy and your nationality?<p><p>bangalimahbub wrote: ↑Tue Jul 10, 2018 1:28 am Which embassy and your nationality? Russia, russian.<p><p>Bluesky12 wrote: ↑Tue Jun 26, 2018 6:15 pm Finally something is happening they started processing. How is your application going?<p><p>ynginvstr wrote: ↑Sat Jun 23, 2018 4:18 am Submitted my application in December 2017 My wife received a letter 2 days ago containing questions to be answered, also saying that I have to contact the embassy for an interview that should be done within a month The interview date is unknown according to the embassy -- they don't know yet when it will be possible for me to be interviewed. :>>>>>>>>>>>>>>> Is it true though that they might read our WhatsApp conversation ... I'd feel terrible about that knowing that my privacy with my wife is destroyed, and neither me nor my wife would like that. Good luck everyone. Have you gotten decision?<p><p>Pppts wrote: ↑Tue Jul 17, 2018 4:08 pm Bluesky12 wrote: ↑Tue Jun 26, 2018 6:15 pm Finally something is happening they started processing. How is your application going? Hi! Sorry for late response I just come back from my holiday, I did get about 20 questions to answer, and my spouse waiting for a call from ambassy for interview.<p><p>ynginvstr wrote: ↑Sat Jun 23, 2018 4:18 am Submitted my application in December 2017 My wife received a letter 2 days ago containing questions to be answered, also saying that I have to contact the embassy for an interview that should be done within a month The interview date is unknown according to the embassy -- they don't know yet when it will be possible for me to be interviewed. :>>>>>>>>>>>>>>> Is it true though that they might read our WhatsApp conversation ... I'd feel terrible about that knowing that my privacy with my wife is destroyed, and neither me nor my wife would like that. Good luck everyone. Hi! Did you get any mail from me! I tried to answer you earlier but apparently you didn't get it<p><p>Pppts wrote: ↑Tue Jul 17, 2018 4:08 pm Bluesky12 wrote: ↑Tue Jun 26, 2018 6:15 pm Finally something is happening they started processing. How is your application going? I just come back from my holiday, I did get about 20 questions to answer, and my spouse waiting for a call from ambassy for interview<p><p>Bluesky12 wrote: ↑Fri Jul 20, 2018 9:56 pm Pppts wrote: ↑Tue Jul 17, 2018 4:08 pm Bluesky12 wrote: ↑Tue Jun 26, 2018 6:15 pm Finally something is happening they started processing. How is your application going? I just come back from my holiday, I did get about 20 questions to answer, and my spouse waiting for a call from ambassy for interview Thank you for sharing I also answered about 20 questions, my spouse has already been interviewed in the embassy. We are still waiting for the decision.<p><p>Pppts wrote: ↑Sat Jul 21, 2018 5:20 am Bluesky12 wrote: ↑Fri Jul 20, 2018 9:56 pm Pppts wrote: ↑Tue Jul 17, 2018 4:08 pm How is your application going? I just come back from my holiday, I did get about 20 questions to answer, and my spouse waiting for a call from ambassy for interview Thank you for sharing I also answered about 20 questions, my spouse has already been interviewed in the embassy. We are still waiting for the decision. Good luck to you <p><p>Bluesky12 wrote: ↑Mon Jul 23, 2018 11:11 am Pppts wrote: ↑Sat Jul 21, 2018 5:20 am Bluesky12 wrote: ↑Fri Jul 20, 2018 9:56 pm I just come back from my holiday, I did get about 20 questions to answer, and my spouse waiting for a call from ambassy for interview Thank you for sharing I also answered about 20 questions, my spouse has already been interviewed in the embassy. We are still waiting for the decision. Good luck to you Good luck to you too <p>", "content": "", "time": " Sun Jun 24, 2018 6:31 pm", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018 - Page 3", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=6db7e42f437a76f7758e1eea57c0649b&start=30", "review": "<p>I wonder.... My spouse applied for residence permit on 9.7.2018. It goes within week to \"On progress\" stage, 13.7.2018... I'll try to find somekind of apprx. time information, how long it could stay on that \"On progress\" stage before decision made... Everyone tells that whole process will take x-month time, but how about that step only? Yes I know.... WAIT!!! Yep... easy to say but not so easy to follow. Any idea, even coarse, about processing time on this situation (all papers ok, done by enterfinland, married 12.6.2018. Engaged 1.1.2018, visited 3 times at Thailand 2-2-4 weeks. Every time lived same hotel / rented apartment). Marriage registered to finnish city magistrate too. Anyone had similar conditions?<p><p>Hello all! I am a citizen of the USA and around two months ago I took a huge risk and dropped everything (including my job, car, family, and friends) to move cross-country to the land of the Finns to meet and marry my Finnish fiancée here in Espoo. My fiancée (now husband) and I met in January of this year on an online chat site and immediately knew we were meant for each other. He works a good paying construction job here in Finland, while I worked a not so well paying receptionist job in the states; therefor he paid for MOST of my travel expenses. We met at the Helsinki airport on the 27th of May around 6pm and despite what all of my family, friends, and co-workers warned me about (catfishing, human trafficking, murder) he WAS who I had been chatting/camming with since January, lol. And so we got married at the civil register in Espoo last month on the 27th, after visiting the US Embassy in Helsinki and receiving a statement of non-impediment to marriage which we had to submit along with other paperwork to the civil register beforehand. Anyway, fast forward a few weeks and we have finally got enough money to apply for my first residence permit (basis of family ties when spouse is a Finn). We would have had money sooner but some unexpected financial circumstances prevented us from applying earlier. However, we have hit a bump in the road and I have some questions that (hopefully) some of you may be able to answer. I was previously married in the USA (obviously now divorced and remarried) and so I brought with me my divorce documents from the state I lived in (Kentucky) because I knew they would be needed in order for us to get married and apply for the permit and so forth. The one thing I failed to realize is that the document is not technically legal? Or at least in the eyes of the Finnish government. It has been signed by the judge who issued our divorce as well as notarized by the notary republic in my county. When my husband and I went to the civil register to submit our paperwork for marriage, they did not ask to see my divorce papers, however some of the paperwork that I filled out asked me if I had been previously married and the name of my ex, which I provided. So my questions are: 1. How do I legalize my US divorce papers when I am already in Finland? 2. Can I go ahead and pay for/submit my application for the residence permit, and add the divorce paper later after it has been legalized? 3. Will I be allowed to stay here after submitting the residence permit application, while I wait for the divorce papers to be legalized and sent back to me? I have spoke to migri, US embassy, and the civil register office and all of them want to direct me to online links or emails, which I understand, but I am pressed for time as my 90 days expires in late August. It would be nice to have a direct answer, lol. I spoke with a migri woman a few minutes ago and she said that I would most likely have to send my documents back to USA to be legalized, and then submit the legalized divorce papers to the immigration service point. I asked her if I could go ahead and apply for the residence permit and would be allowed to stay here while I waited for the divorce papers to be legalized and she said YES. She actually advised me NOT to travel back to USA or any other country before I have the residence permit as I may face complications when trying to come back to Finland. So, if anyone has had a similar experience or any advice feel free to help me out, lol. It would be much appreciated. <p><p>1) No glue... Asked if US embassy at Finland can help with that? 2) Yes. You can upload copy of it, and they maid ask you to visit and show the original one. 3) Yes<p><p>M00nbean wrote: ↑Tue Jul 24, 2018 11:08 am Hello all! So, if anyone has had a similar experience or any advice feel free to help me out, lol. It would be much appreciated. Hi. What you need for it to be legalised is an Apostille. In the USA, each state has their own process. The embassy cannot help. It is fairly simple and cheap though and walk ins are handled typically in a few minutes. Do you have family or friends that can help? It is faster to go in person than to mail it in. Here is a website for Kentucky. https://www.sos.ky.gov/bus/businessreco ... tions.aspx<p><p>Hi again! Thanks to those who have replied! (I feel a bit better now, lol) Before I left the USA to come to Finland, I called my local county clerk's office (the ones who issued the divorce papers) and asked them if they knew where I could get documents stamped with an apostille and they had absolutely no clue what an apostille even was! Said they had never heard of it, lol. So I assumed my divorce papers would be alright. (guess I was wrong ) My hubby came home from work yesterday and we completed the application together and added a ton of attachments (including pictures of my divorce papers which I haven't sent to be legalized yet). We figured they would contact us and inform us that it needs to be legalized anyway, or would tell us at the immigration service point when we visit on Aug. 3rd. So we will then tell them that we will send them to USA to be stamped with the apostille and mailed back, and we will submit either in person or online (not sure which they will want). Hopefully everything else goes okay and I will be granted the permit (relatively soon). One thing I am nervous about is the fact that I wasn't legally divorced from my ex until 3 months into our relationship. I mentioned this in the application as it asked my previous marriage date and duration, as well as the fact that my ex and I had been separated since Dec. 2017. (My husband is aware of all this, btw) Because of all these factors I'm almost absolutely certain that they will interview both of us at some point, and probably want to see some of our conversations from FB and Discord which.... which is definitely not suitable for all viewers. Anyways, I'm going to try and de-stress this weekend, forget about the permit for a minute, and take a mini vacation to my in-laws house in the country with the hubs. (Maybe if I could stand being in the sauna for more than 5 minutes it would help with the stress, sadly I cannot) <p><p>Hei everyone Sorry im new here and dont queit know where to post but this topic suits my situation. Im a finnish citizen, My husband is in pakistan applying for his residence permit . He has an interview in Dubai in a month time and after days of search i found out there is an online application he has to fill. Kindly if someone can clarify if its online that he needs to complete and attack documents or paper based ? The website is called “enterfinland” so he has to make a user name and all complete the form and attach documents ? if anyone has done this step kindly let me Know so we can complete it soon. Also there is a form that i have to fill to as his spouse , can i do it online and uplod it in his account in”enterfinland “ or do i make my own account ? Also do we have to upload pictures of us ? Wedding pictures and all? Any response would be appreciated , Thanks in advance Nadia<p><p>Yes. Your spouse SHOULD create user account for enterfinland. After that, you send your form (you can get in pdf format) to your spouse. Your spouse upload it then to enterfinland. (or if he give login details for you, then you upload it to enterfinland). Use enterfinland, because: 1) You see status of residence permit 2) You can answer faster to possible extra questions by migri. 3) You can see online what is the decision... When your spouse have filled & paid online application, he should print the form (pdf, about 4 pages) and take it with him to interview. -Suomeksi sama- Kyllä. Siippasi TULEE tehdä tunnukset enterfinlandiin. Sen jälkeen voit lähettää itse täyttämäsi documentin (sen saa pdf muodossa) hänelle ja hän lisää sen enterfinlandiin. (Tai sitten sinä, jos saat häneltä käyttäjätunnukset myös sinne). Käytä onlineä, koska: 1) Näet hakemuksen tilan ilman puhelinsoittoja 2) Pystytte vastaamaan nopeasti mahdollisiin lisäkysymyksiin sen kautta 3) Näette onlinenä, jotta mikä oli päätös. Kun siippasi on täyttänyt online hakemuksen JA maksanut sen, hänen tulee printata sama hakemus online sivuilta haastatteluunsa mukaan (pdf, Noin 4 sivua).<p><p>Thank you so much for the reply, That makes it easy for me now . Also for the payment would it be okey if my husband uses my Finnish bank card? We have not completed the application online yet so not fully sure. Also does my husband need to get a police clearance certificate for himsef ? Or they would check themselves? . And s we scan the documents such as passport photo and ID photo or taking a picture with our phones will be fine ? Since we are taking the original documents anyway. As we complete the form i might come accross more questions so might be posting more questions. Thank you for your help<p><p>Nadiasafi wrote: ↑Thu Jul 26, 2018 5:06 pm That makes it easy for me now . Also for the payment would it be okey if my husband uses my Finnish bank card? We have not completed the application online yet so not fully sure. Also does my husband need to get a police clearance certificate for himsef ? Or they would check themselves? . And s we scan the documents such as passport photo and ID photo or taking a picture with our phones will be fine ? Since we are taking the original documents anyway. He can use any valid credit card... Don't need to get criminal clearance. But maid be easier for process, if already uploaded & showed. Migri will do that anyway. Passport photo should go to take by professional company. Finland have a strict rules about passport photo quality etc... Oh... And that paper, what you have to fill. He have to print that for interview too. -ja suomeksi- Hän voi käyttää mitä tahansa laillista korttia maksuun. Ei tarvita rikosrekisteriotetta. Voi toki nopeuttaa prosessia, jos sen on etukäteen liittänyt mukaan. Migri tarkistaa kuitenkin. Passikuva tulee käydä otattamassa osaavassa putiikissa. Suomen passikuvasäännöt ovat hyvinkin tiukat kännykkäkuvia ajatellen. Aijuu ja se sinun täyttämäsi paperi. Hänen tulee printata myös se mukaan haastatteluun. Nadiasafi wrote: ↑Thu Jul 26, 2018 5:06 pm As we complete the form i might come accross more questions so might be posting more questions. Thank you for your help I will help always if I ever can... This is a jungle, resident permit jungle...<p><p>Hei There is a question in PK2 form, When does your spouse intend to move to Finland?” It requires us to give them a date , but isnt that whenever he gets granted he will come so why ask such a question?<p><p>This is another question that kinds of make me wonder, “Could you live together as a family elsewhere than in Finalnd? I can live in pakistan with him but for short time as i have my work and studies in finland . And obviously finalnd a better place to live . What would be a best reply for this?<p><p>Nadiasafi wrote: ↑Sat Jul 28, 2018 4:29 pm Hei There is a question in PK2 form, When does your spouse intend to move to Finland?” It requires us to give them a date , but isnt that whenever he gets granted he will come so why ask such a question? I wonder that too. So I just write 1.8 to there... Just write something to it .... Oh, if you put 1.2019. Then redicence permit card will have that \"start\" day when valid, even get much earlier... Carefull <p><p>Nadiasafi wrote: ↑Sat Jul 28, 2018 5:51 pm This is another question that kinds of make me wonder, “Could you live together as a family elsewhere than in Finalnd? I can live in pakistan with him but for short time as i have my work and studies in finland . And obviously finalnd a better place to live . What would be a best reply for this? We answered that \"no\". Because I'm working at finland and can't do my job and get money for living aboard...<p><p>Finland doesn't like it when people wanna get/apply for resident permits but wanna live somewhere out of Finland, or work out of Finland, or even study out of Finland.<p><p>M00nbean wrote: ↑Tue Jul 24, 2018 11:08 am I spoke with a migri woman a few minutes ago and she said that I would most likely have to send my documents back to USA to be legalized, and then submit the legalized divorce papers to the immigration service point. I asked her if I could go ahead and apply for the residence permit and would be allowed to stay here while I waited for the divorce papers to be legalized and she said YES. She actually advised me NOT to travel back to USA or any other country before I have the residence permit as I may face complications when trying to come back to Finland. This is EXTREMELY odd. My fiancé is from the States and we did the whole notarization - apostille -process for getting our impediments check, he actually had to wait in LA Secretary of State's office ALL DAY (literally from 9am to 5pm) to get the apostille as the lines there are unbearable. And you can get an apostille through mail at least in Sacramento, but even expedited delivery takes about 9 days and costs approximately 60 USD back and forth, so it's not exactly cheap. Cheaper than flying though! So, back to the bit I thought was weird. My fiancé is coming over on the 15th of August and we're getting married on the 17th. In the beginning of September he'll be going back to California to sort out exporting our car and his personal belongings. I specifically contacted Migri and asked whether this would be a problem and they said NO, as after the application has been made and he has gone to Migri to show his ID, he can stay in Finland for as long as he wants, until the RP has arrived. The person at Migri told me that there is no reason border security would take an issue with this. I am definitely calling them again on Tuesday and maybe will call border security as well, as it seems to be a typical situation with the authorities - one is saying one thing, the other something else... <p>", "content": "", "time": " Mon Jul 23, 2018 1:40 pm", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018 - Page 4", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=6db7e42f437a76f7758e1eea57c0649b&start=45", "review": "<p>I am definitely calling them again on Tuesday and maybe will call border security as well, as it seems to be a typical situation with the authorities - one is saying one thing, the other something else... You can count on that! On another web sites they warn not to go out of Finland. Need to get Visa for entering Finland again... etc....<p><p>OK U.S.A. peeps, I now have reliable information as I actually took it upon myself to e-mail the Finnish border security and got a surprisingly speedy reply. A US citizen, whose immigration process is ongoing, is allowed to travel in and out of Finland even after the 90 days in Schengen area in the past 180 are up. This has a few requirements though: - Must only travel to and from Finland directly outside Schengen (so, for example, directly from Helsinki to LAX in our case, no layovers within Schengen) - Passport has to be valid for 3 months after re-entering Finland and - It is recommended to have a copy of the Migri paper stating your RP is in process with you when you travel If your 90 days within 180 days are not over however, you have no problem travelling back and forth with as many layovers as your heart pleases. I'm definitely printing that e-mail and giving it to my fiancé when he flies out to the States, as we all know, the more paper you have, the better!!!<p><p>M00nbean wrote: ↑Thu Jul 26, 2018 6:35 am Hi again! My hubby came home from work yesterday and we completed the application together and added a ton of attachments (including pictures of my divorce papers which I haven't sent to be legalized yet). We figured they would contact us and inform us that it needs to be legalized anyway, or would tell us at the immigration service point when we visit on Aug. 3rd. So we will then tell them that we will send them to USA to be stamped with the apostille and mailed back, and we will submit either in person or online (not sure which they will want). Fellow Kentucky resident here: probably faster to just get a new copy from the Department of Vital Statistics, and have them send it to Secretary of State to apostile. They have it set up to do that on the system and it's quick (marriage and birth certificates were both created and legalized and in my hands in less than 4 days, but I'm still in Kentucky). It was cheap too, maybe $20. Hardest part for you is that they called me to pay for Apostile over the phone, not sure how that and mailing to Finland direct would work but should be possible. The people that work there are super helpful and friendly. As for me, applied and interviewed in NYC on 3\\27\\18, just waiting for the approval. Was put into processing the same day as applied and interviewed. Says it'll be approved anywhere from 1 month ago to December. Waiting on the permit to apply for Quality Engineering jobs in Helsinki/Espoo/Vantaa and Oulu. Hopefully our family will move at some point in the next year.<p><p>Moi everyone! Just posting here to give everyone an update on my residence permit status! (: As of today I have proved my identity at the immigration office in Helsinki (which was packed and smelled like body odor btw) and my application now says \"waiting for processing\". Just to be clear you cannot receive a personal identification code until after you have gotten your residence permit, as clarified per the immigration officer who assisted me and my hubs. The process was fairly easy, though we encountered a small issue at first (figured I would share it here so that everyone knows). Whenever my husband and I got married at the magistrate in Espoo, they asked me if I would change my last name to his, and I ofc said yes. Nobody mentioned anything about this possibly being a problem for me at the immigration office. The officer asked to see my passport and our marriage certificate and asked if I had changed my name on my passport to which I replied no, because how would I do so when I am in Finland and not USA? He then proceeded to ALMOST deny my residence permit application right then and there (i'm assuming as a failure to identify myself) but before he did so he went to consult with other coworkers or his boss (i'm guessing), and luckily he came back and gave us the option to either apply for the residence permit as (insert my first name and old last name) and change it later for 80 euros, or send my passport away to be changed to my new last name as soon as possible, then come back to the immigration office with the new passport. We opted out for keeping my old last name and changing it later for the 80e. He mentioned nothing about my divorce papers, but asked to take copies of the original. Few moments later he printed the paper stating that I am legally staying here until a decision has been made and we were good to go. I did not ask anything about the processing times or anything menial as I figured he would have no certain answer or the same 5-9 months that I have seen beforehand. I assume we will have to send my divorce papers to USA to be legalized but maybe not? I will wait until they contact me before doing so. So that's about it, now its just a waiting game. <p><p>M00nbean wrote: ↑Thu Aug 02, 2018 5:19 pm Just to be clear you cannot receive a personal identification code until after you have gotten your residence permit, as clarified per the immigration officer who assisted me and my hubs. Lol, this is classic Migri! Our worker specifically told us to go to Maistraatti and apply for my fiancé's henkilötunnus (social security number) after we've gotten married. So that's exactly what we're going to do. The worst they can say is no. <p><p>I may see if I can do the same. Purely because if I'm going to be waiting here for 5-9 months without health insurance or anything, I would like to at least have a PIN so that I could see a public doctor instead of a private. Try to save the hubs some money. I tend to get sick at least once a year during the winter months, and we are currently trying to start a family so health insurance would be nice but I'll take what I can get, lol. On the bright side, I am ready for cold weather!!! It has been so hot in Espoo, my sister in law and I both agree it's best to stay in front of our fans all day <p><p>M00nbean wrote: ↑Thu Aug 02, 2018 5:19 pmThe officer asked to see my passport and our marriage certificate and asked if I had changed my name on my passport to which I replied no, because how would I do so when I am in Finland and not USA? https://fi.usembassy.gov/u-s-citizen-se ... passports/ see the New passport will reflect name change (e.g. due marriage, divorce)<p><p>Upphew wrote: ↑Fri Aug 03, 2018 9:31 am M00nbean wrote: ↑Thu Aug 02, 2018 5:19 pmThe officer asked to see my passport and our marriage certificate and asked if I had changed my name on my passport to which I replied no, because how would I do so when I am in Finland and not USA? https://fi.usembassy.gov/u-s-citizen-se ... passports/ see the New passport will reflect name change (e.g. due marriage, divorce) Yes, I googled it once we were out of the office. I will have it taken care of after getting the permit, lol.<p><p>M00nbean wrote: ↑Thu Aug 02, 2018 5:19 pm As of today I have proved my identity at the immigration office in Helsinki (which was packed and smelled like body odor btw) and my application now says \"waiting for processing\". Just to be clear you cannot receive a personal identification code until after you have gotten your residence permit, as clarified per the immigration officer who assisted me and my hubs. BS. I applied for an RP in May and registered my municipality of residence soon after, and they gave me a personal identity code in the mail within a week. Please don't spread false information.<p><p>My story: Applied in person with my wife 18 May. As expected, I've heard nothing from immigration about the status of my application or interviews or anything. At least I don't have to wait in the !\"#¤% US.<p><p>undertakerfreak wrote: ↑Fri Aug 10, 2018 9:34 pm M00nbean wrote: ↑Thu Aug 02, 2018 5:19 pm As of today I have proved my identity at the immigration office in Helsinki (which was packed and smelled like body odor btw) and my application now says \"waiting for processing\". Just to be clear you cannot receive a personal identification code until after you have gotten your residence permit, as clarified per the immigration officer who assisted me and my hubs. BS. I applied for an RP in May and registered my municipality of residence soon after, and they gave me a personal identity code in the mail within a week. Please don't spread false information. Yeah!!!! I got mine(personal identity code) the same day after my wedding last Dec 2017 I applied my first residence permit 1week after the wedding and granted less than 3weeks I applied my Kela card and got it in 2 weeks now I already booked my appointment this November for the extension of my residence permit #realtalk<p><p>latikajamal wrote: ↑Fri Aug 10, 2018 9:56 pm undertakerfreak wrote: ↑Fri Aug 10, 2018 9:34 pm M00nbean wrote: ↑Thu Aug 02, 2018 5:19 pm As of today I have proved my identity at the immigration office in Helsinki (which was packed and smelled like body odor btw) and my application now says \"waiting for processing\". Just to be clear you cannot receive a personal identification code until after you have gotten your residence permit, as clarified per the immigration officer who assisted me and my hubs. BS. I applied for an RP in May and registered my municipality of residence soon after, and they gave me a personal identity code in the mail within a week. Please don't spread false information. Yeah!!!! I got mine(personal identity code) the same day after my wedding last Dec 2017 I applied my first residence permit 1week after the wedding and granted less than 3weeks I applied my Kela card and got it in 2 weeks now I already booked my appointment this November for the extension of my residence permit #realtalk How in the blue hell did you get everything approved so quickly? I've been waiting for three months and I haven't heard so much as a peep.<p><p>undertakerfreak wrote: ↑Fri Aug 10, 2018 10:11 pm latikajamal wrote: ↑Fri Aug 10, 2018 9:56 pm undertakerfreak wrote: ↑Fri Aug 10, 2018 9:34 pm BS. I applied for an RP in May and registered my municipality of residence soon after, and they gave me a personal identity code in the mail within a week. Please don't spread false information. Yeah!!!! I got mine(personal identity code) the same day after my wedding last Dec 2017 I applied my first residence permit 1week after the wedding and granted less than 3weeks I applied my Kela card and got it in 2 weeks now I already booked my appointment this November for the extension of my residence permit #realtalk How in the blue hell did you get everything approved so quickly? I've been waiting for three months and I haven't heard so much as a peep. I dont know, maybe I'm pregnant that time Try to search my recent post (pregnant,unmarried) If I have time,I will continue posting on my thread based on my experiences here in Finland <p><p>latikajamal wrote: ↑Fri Aug 10, 2018 10:18 pm undertakerfreak wrote: ↑Fri Aug 10, 2018 10:11 pm latikajamal wrote: ↑Fri Aug 10, 2018 9:56 pm Yeah!!!! I got mine(personal identity code) the same day after my wedding last Dec 2017 I applied my first residence permit 1week after the wedding and granted less than 3weeks I applied my Kela card and got it in 2 weeks now I already booked my appointment this November for the extension of my residence permit #realtalk How in the blue hell did you get everything approved so quickly? I've been waiting for three months and I haven't heard so much as a peep. I dont know, maybe I'm pregnant that time Try to search my recent post (pregnant,unmarried) If I have time,I will continue posting on my thread based on my experiences here in Finland So, you mean to tell me that you applied for a RP and got a positive decision in THREE WEEKS? This reeks of shadiness. I'm willing to bet your husband, given his social status, greased some palms with cash along the way.<p><p>undertakerfreak wrote: ↑Fri Aug 10, 2018 10:31 pm latikajamal wrote: ↑Fri Aug 10, 2018 10:18 pm undertakerfreak wrote: ↑Fri Aug 10, 2018 10:11 pm How in the blue hell did you get everything approved so quickly? I've been waiting for three months and I haven't heard so much as a peep. I dont know, maybe I'm pregnant that time Try to search my recent post (pregnant,unmarried) If I have time,I will continue posting on my thread based on my experiences here in Finland So, you mean to tell me that you applied for a RP and got a positive decision in THREE WEEKS? This reeks of shadiness. I'm willing to bet your husband, given his social status, greased some palms with cash along the way. Hahaha Do you think it's possible here in Finland?<p>", "content": "", "time": "Sun Jul 29, 2018 10:57 am", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018 - Page 5", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=6db7e42f437a76f7758e1eea57c0649b&start=60", "review": "<p>latikajamal wrote: ↑Fri Aug 10, 2018 10:48 pm undertakerfreak wrote: ↑Fri Aug 10, 2018 10:31 pm latikajamal wrote: ↑Fri Aug 10, 2018 10:18 pm I dont know, maybe I'm pregnant that time Try to search my recent post (pregnant,unmarried) If I have time,I will continue posting on my thread based on my experiences here in Finland So, you mean to tell me that you applied for a RP and got a positive decision in THREE WEEKS? This reeks of shadiness. I'm willing to bet your husband, given his social status, greased some palms with cash along the way. Hahaha Do you think it's possible here in Finland? I think something else had to be at work if everyone else here has been waiting months and months, and yours was fast-tracked in as little as three weeks.<p><p>undertakerfreak wrote: ↑Fri Aug 10, 2018 10:50 pm latikajamal wrote: ↑Fri Aug 10, 2018 10:48 pm undertakerfreak wrote: ↑Fri Aug 10, 2018 10:31 pm So, you mean to tell me that you applied for a RP and got a positive decision in THREE WEEKS? This reeks of shadiness. I'm willing to bet your husband, given his social status, greased some palms with cash along the way. Hahaha Do you think it's possible here in Finland? I think something else had to be at work if everyone else here has been waiting months and months, and yours was fast-tracked in as little as three weeks. I hope soon you will have a positive result and also to the rest of the people here waiting. I read Some received at the same day, some for 2weeks and some waited for months. I'm very happy and grateful that I am one of them who got it so fast.be patient and be positive <p><p>undertakerfreak wrote: ↑Fri Aug 10, 2018 9:34 pm M00nbean wrote: ↑Thu Aug 02, 2018 5:19 pm As of today I have proved my identity at the immigration office in Helsinki (which was packed and smelled like body odor btw) and my application now says \"waiting for processing\". Just to be clear you cannot receive a personal identification code until after you have gotten your residence permit, as clarified per the immigration officer who assisted me and my hubs. BS. I applied for an RP in May and registered my municipality of residence soon after, and they gave me a personal identity code in the mail within a week. Please don't spread false information. First of all, no need to be rude. This is what I was told at the immigration office by the immigration officer himself. This thread is to share our personal experiences and that is what I did. He may or may not have been wrong, either way that is what I was told. After all, they did seem to be in a hurry what with all of the people in the waiting rooms.<p><p>undertakerfreak wrote: ↑Fri Aug 10, 2018 10:31 pm latikajamal wrote: ↑Fri Aug 10, 2018 10:18 pm undertakerfreak wrote: ↑Fri Aug 10, 2018 10:11 pm How in the blue hell did you get everything approved so quickly? I've been waiting for three months and I haven't heard so much as a peep. I dont know, maybe I'm pregnant that time Try to search my recent post (pregnant,unmarried) If I have time,I will continue posting on my thread based on my experiences here in Finland So, you mean to tell me that you applied for a RP and got a positive decision in THREE WEEKS? This reeks of shadiness. I'm willing to bet your husband, given his social status, greased some palms with cash along the way. I have proofed cases, where fi-thai couples got rp under month... My wife still waiting... Another one of those couples fill application same day than my wife. No kids whatsoever... ANNOYING <p><p>Hey Everybody,, i'm new here, my wife is a Finnish Citzen, i'm 23, and she is 21 years old, We met online in 2014, then she visited me 3 times, in 2015, 2017 (got engaged) and August 2018 (we got married), i've never been in Finland because i need a Tourist visa which is so complicated. Today She went to register our marriage, they took copies of Marriage Contract + the english Translation with their apostiles, and they told her that will takes maximum 1 month, and that i can't apply before that. So i created account in enterfinland.fi , and i'm willing to apply right away after the marriage is registered in Finland 1 - i wanna ask about this section, and what should the right thing to be written here, \"Please state whether there is any other purpose for your residence permit application than that stated above which you wish to declare. You may also state any other facts or additional information that are relevant for your application or for your coming to Finland. You can also attach a separate document if necessary.\" 2 - Can i attach the Pictures of weddings, chat history, packages receipts and my criminal record (which is so clean).to raise the chances of obtaining a residence permit and to reduce the time of processing ? 3 - When i will go to prove my identity, should i take original marriage certificate with me, (cause my wife took it with her for registration) Thanks in advance. wish the best to all<p><p>elNino wrote: ↑Thu Aug 23, 2018 8:21 pm Hey Everybody,, i'm new here, my wife is a Finnish Citzen, i'm 23, and she is 21 years old, We met online in 2014, then she visited me 3 times, in 2015, 2017 (got engaged) and August 2018 (we got married), i've never been in Finland because i need a Tourist visa which is so complicated. Today She went to register our marriage, they took copies of Marriage Contract + the english Translation with their apostiles, and they told her that will takes maximum 1 month, and that i can't apply before that. So i created account in enterfinland.fi , and i'm willing to apply right away after the marriage is registered in Finland 1 - i wanna ask about this section, and what should the right thing to be written here, \"Please state whether there is any other purpose for your residence permit application than that stated above which you wish to declare. You may also state any other facts or additional information that are relevant for your application or for your coming to Finland. You can also attach a separate document if necessary.\" 2 - Can i attach the Pictures of weddings, chat history, packages receipts and my criminal record (which is so clean).to raise the chances of obtaining a residence permit and to reduce the time of processing ? 3 - When i will go to prove my identity, should i take original marriage certificate with me, (cause my wife took it with her for registration) Thanks in advance. wish the best to all 1. What do you plan to do if you're approved for a RP? Write your future plans. Work, study, business, whatever. But for now, you're applying for a RP on the basis of family ties, and that's about all you have in that department. 2. Rest assured, immigration will be checking your criminal history either way, so don't bother bringing your history. Nothing you can show them for a RP application will make your application process go faster. I'm clean as a whistle crime-wise, and I've been waiting over three months without so much as a peep from Migri. Not even an interview yet. However, the chat histories and photos and whatnot could come in handy for when they interview you to ensure your marriage isn't a sham. Maybe you'll be one of the lucky ones and inexplicably (and suspiciously) get your RP in a week. Who knows. 3. Yes, you need originals of ALL documents that you submit on your electronic application. Copies won't do. Also, be aware that you have three months to prove your identity, so that gives you plenty of time to get your original back. Why would she need it though? When I married my wife here, we both got certificates, and I've never needed more than just my own for any immigration business. Good luck.<p><p>submitted my application and identification made 08.08.18 decision made 24.08.18 (to my amazement) residence permit card will arrive in 2/3 weeks as per the note from migri.<p><p>Nkosi wrote: ↑Mon Aug 27, 2018 9:03 am submitted my application and identification made 08.08.18 decision made 24.08.18 (to my amazement) residence permit card will arrive in 2/3 weeks as per the note from migri. Some of you people are either really @#$% lucky or something is up with these really quick decisions.<p><p>Nkosi wrote: ↑Mon Aug 27, 2018 9:03 am submitted my application and identification made 08.08.18 decision made 24.08.18 (to my amazement) residence permit card will arrive in 2/3 weeks as per the note from migri. Oh Congrats, that's was fast, when you applied, did you attached extra supporting documents ?<p><p>undertakerfreak wrote: ↑Mon Aug 27, 2018 2:35 pm Nkosi wrote: ↑Mon Aug 27, 2018 9:03 am submitted my application and identification made 08.08.18 decision made 24.08.18 (to my amazement) residence permit card will arrive in 2/3 weeks as per the note from migri. Some of you people are either really @#$% lucky or something is up with these really quick decisions. Couldn't believe my luck either man especially after all the stuff I've been reading here.<p><p>elNino wrote: ↑Mon Aug 27, 2018 8:42 pm Nkosi wrote: ↑Mon Aug 27, 2018 9:03 am submitted my application and identification made 08.08.18 decision made 24.08.18 (to my amazement) residence permit card will arrive in 2/3 weeks as per the note from migri. Oh Congrats, that's was fast, when you applied, did you attached extra supporting documents ? Yes i did.<p><p>Amazing. In 3 weeks !! .My wife waiting now 9 months. Still waiting to be processed in Enter Finland. So frustrated. That silly processing checker tells it takes longer if additional info is needed. But never heard any sound from Migri. Quiker to get pregnant, deliver baby then get RP <p><p>alberti wrote: ↑Tue Aug 28, 2018 8:28 am Amazing. In 3 weeks !! .My wife waiting now 9 months. Still waiting to be processed in Enter Finland. So frustrated. That silly processing checker tells it takes longer if additional info is needed. But never heard any sound from Migri. Quiker to get pregnant, deliver baby then get RP I've read far more stories of people waiting nine months and longer than these lucky people who get them in under a month, so at this point, I'm just planning on waiting the full nine months. I knew the guy at the Migri office was just blowing sunshine up my ass when he said given how well-prepared I was, it should be quick. Bureaucracy. Gotta send the folks home hopeful.<p><p>Expect to wait as much they are estimating. There some exceptions always but just few.<p><p>[/quote] Oh Congrats, that's was fast, when you applied, did you attached extra supporting documents ? [/quote] Yes i did. [/quote] i'm happy for you, Can you please tell us what those supporting documents you attached, ? as long i didn't apply yet, (waiting for our marriage to be registered in maistraatti cause they told to my wife this will take maximum 3 weeks)<p>", "content": "", "time": "Fri Aug 10, 2018 10:50 pm", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018 - Page 6", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=6db7e42f437a76f7758e1eea57c0649b&start=75", "review": "<p>Today my husband got positive decision of RP, we have waited 8 months and 9 days. We waited about 6 months to be processed, then I answered questioners, my husband went for interview, I attached supplements and answered more questions. And thanks migri and God, that finally we got the good decision. Good luck everyone. <3 <3 <3<p><p>Pppts wrote: ↑Mon Sep 03, 2018 5:20 pm Today my husband got positive decision of RP, we have waited 8 months and 9 days. We waited about 6 months to be processed, then I answered questioners, my husband went for interview, I attached supplements and answered more questions. And thanks migri and God, that finally we got the good decision. Good luck everyone. <3 <3 <3 Hi. Congrats to you both. What's your nationality and your husband's, In which embassy you submitted? Thanks<p><p>Another quickly-processed residence permit holder here. I received notice of a positive decision about 2.5 weeks after submitting my application and around 10 days after sending my legalized marriage certificate to Migri. However, I originally applied with a paper application in early June at the consulate on the basis of an established relationship. We married prior to receiving a response on that, so I revised the grounds on which I was applying and submitted a new form. Regardless, Migri contacted me with a request for additional information (regarding the original application) about two months after applying.<p><p>Hello everyone! Any updates? has anyone received a decision? application moved to processing stage? I proved my identity on 07.05.2018,its been 5 months now. I am hoping I can get a decision this year.<p><p>The same here I applied this year 3rd of may is been 5 months now <p><p>I finally got a positive decision today. I applied on march this year. This is my second rp application based on family ties because for my first one, i got a negative decision. I applied for the first rp in my home country and after we got the decision, i came to Finland via Schengen visa and reapplied here. It was a rollercoaster ride but we are happy that the Rp stress is over. <p><p>m.parvia wrote: ↑Tue Oct 09, 2018 1:25 am Hello everyone! Any updates? has anyone received a decision? application moved to processing stage? I proved my identity on 07.05.2018,its been 5 months now. I am hoping I can get a decision this year. What's your nationality? In Which embassy you applied? I applied same as your date. Offline.<p><p>Achrafakil wrote: ↑Tue Oct 09, 2018 3:38 am The same here I applied this year 3rd of may is been 5 months now In Which embassy you applied? I applied also same month as you.<p><p>bangalimahbub wrote: ↑Fri Oct 12, 2018 11:47 am Achrafakil wrote: ↑Tue Oct 09, 2018 3:38 am The same here I applied this year 3rd of may is been 5 months now In Which embassy you applied? I applied also same month as you. I applied in rabat Morocco<p><p>bangalimahbub wrote: ↑Fri Oct 12, 2018 11:46 am m.parvia wrote: ↑Tue Oct 09, 2018 1:25 am Hello everyone! Any updates? has anyone received a decision? application moved to processing stage? I proved my identity on 07.05.2018,its been 5 months now. I am hoping I can get a decision this year. What's your nationality? In Which embassy you applied? I applied same as your date. Offline. I am a Jamaican and I applied in New York. I live in the US because of my studies.<p><p>m.parvia wrote: ↑Fri Oct 12, 2018 5:56 pm bangalimahbub wrote: ↑Fri Oct 12, 2018 11:46 am m.parvia wrote: ↑Tue Oct 09, 2018 1:25 am Hello everyone! Any updates? has anyone received a decision? application moved to processing stage? I proved my identity on 07.05.2018,its been 5 months now. I am hoping I can get a decision this year. What's your nationality? In Which embassy you applied? I applied same as your date. Offline. I am a Jamaican and I applied in New York. I live in the US because of my studies. It'd be wise if you can stay there, rather than come to Finland. This is advice coming from an american.. I know the US is having its problems when it comes to foreigners dealing with natives, but said problem is 100 fold here in Finland. That and, the finnish language is massive hurdle to climb.<p><p>Well I just received approval on my residence permit after nearly 7 months. I applied on March 27th at New York. Only thing they ever asked for was a scan of the legalized marriage certificate (which I had provided 2 hard copies of at the in-person so that was odd). Question though: they say you cannot enter the country without the permit, and it will take 2-3 weeks to arrive at the New York Consulate. I have a trip planned Nov. 16-26. Will they allow me in without it if it does not arrive in time given that I already have a return scheduled and do not plan to stay permanently yet? Should I call the Consulate and see what they think? Also, anyone need an English speaking Quality Engineer in the Helsinki/Espoo/Vanta area? <p><p>I applied my first RP based on family ties last week, and got the decision in less than a week and It's positive. I gave them all the paperworks they needed and also, I scanned those paperworks and upload it online through enterfinland. Now, they are sending the card. I wish you guys a good luck. <p><p>Rasikko wrote: ↑Wed Oct 17, 2018 11:44 pm m.parvia wrote: ↑Fri Oct 12, 2018 5:56 pm bangalimahbub wrote: ↑Fri Oct 12, 2018 11:46 am What's your nationality? In Which embassy you applied? I applied same as your date. Offline. I am a Jamaican and I applied in New York. I live in the US because of my studies. It'd be wise if you can stay there, rather than come to Finland. This is advice coming from an american.. I know the US is having its problems when it comes to foreigners dealing with natives, but said problem is 100 fold here in Finland. That and, the finnish language is massive hurdle to climb. As an American who has been waiting in Finland with my wife for nearly six months for a decision, I call BS on this. Sure, knowing Finnish helps, but virtually everyone here (at least in Helsinki) knows English. And I also sincerely doubt racism is \"100 times\" worse here than it is in the US. Are you kidding me?<p><p>KattyTheKitty wrote: ↑Sat Oct 27, 2018 1:23 am I applied my first RP based on family ties last week, and got the decision in less than a week and It's positive. I gave them all the paperworks they needed and also, I scanned those paperworks and upload it online through enterfinland. Now, they are sending the card. I wish you guys a good luck. Happy for you, but pissed for me. I'm seeing so many of these quick decisions while I've been hanging with my ass in the wind for six months without so much as an interview from Migri.<p>", "content": "", "time": " Mon Sep 03, 2018 5:20 pm", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018 - Page 7", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=6db7e42f437a76f7758e1eea57c0649b&start=90", "review": "<p>undertakerfreak wrote: ↑Sat Oct 27, 2018 4:11 am KattyTheKitty wrote: ↑Sat Oct 27, 2018 1:23 am I applied my first RP based on family ties last week, and got the decision in less than a week and It's positive. I gave them all the paperworks they needed and also, I scanned those paperworks and upload it online through enterfinland. Now, they are sending the card. I wish you guys a good luck. Happy for you, but pissed for me. I'm seeing so many of these quick decisions while I've been hanging with my ass in the wind for six months without so much as an interview from Migri. The same here I apply in 3rd May let's hope the processing will start soon for us <p><p>Achrafakil wrote: ↑Tue Oct 09, 2018 3:38 am The same here I applied this year 3rd of may is been 5 months now hey! 10/25/2018 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. Maybe they have started on May's applications. Will keep you updated.<p><p>undertakerfreak wrote: ↑Sat Oct 27, 2018 4:11 am KattyTheKitty wrote: ↑Sat Oct 27, 2018 1:23 am I applied my first RP based on family ties last week, and got the decision in less than a week and It's positive. I gave them all the paperworks they needed and also, I scanned those paperworks and upload it online through enterfinland. Now, they are sending the card. I wish you guys a good luck. Happy for you, but pissed for me. I'm seeing so many of these quick decisions while I've been hanging with my ass in the wind for six months without so much as an interview from Migri. Well, I can't complain. If you were me, I guess you would be happy too. <p><p>m.parvia wrote: ↑Sat Oct 27, 2018 8:27 pm Achrafakil wrote: ↑Tue Oct 09, 2018 3:38 am The same here I applied this year 3rd of may is been 5 months now hey! 10/25/2018 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. Maybe they have started on May's applications. Will keep you updated. Yeah that's cool and congrats I hope you will hear the decision soon Good luck <p><p>m.parvia wrote: ↑Sat Oct 27, 2018 8:27 pm Achrafakil wrote: ↑Tue Oct 09, 2018 3:38 am The same here I applied this year 3rd of may is been 5 months now hey! 10/25/2018 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. Maybe they have started on May's applications. Will keep you updated. Sorry but no... My wife application applied 9.7. Identified at embassy 13.7... On stage 2 later same day 13.7. So, no...<p><p>Yeah some applications are processing quickly , Which embassy your wife selected ?<p><p>Achrafakil wrote: ↑Sat Oct 27, 2018 10:38 pm m.parvia wrote: ↑Sat Oct 27, 2018 8:27 pm Achrafakil wrote: ↑Tue Oct 09, 2018 3:38 am The same here I applied this year 3rd of may is been 5 months now hey! 10/25/2018 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. Maybe they have started on May's applications. Will keep you updated. Yeah that's cool and congrats I hope you will hear the decision soon Good luck I received supplemental questions today, also submitted the answers today.<p><p>elNino wrote: ↑Tue Oct 30, 2018 12:07 am Yeah some applications are processing quickly , Which embassy your wife selected ? Bangkok / Thailand<p><p>jarikaija wrote: ↑Tue Oct 30, 2018 12:32 pm elNino wrote: ↑Tue Oct 30, 2018 12:07 am Yeah some applications are processing quickly , Which embassy your wife selected ? Bangkok / Thailand. But nothing to do with embassy, since application done online and identify done and accepted. Now the only brake here is migri. <p><p>m.parvia wrote: ↑Tue Oct 30, 2018 3:21 am Achrafakil wrote: ↑Sat Oct 27, 2018 10:38 pm m.parvia wrote: ↑Sat Oct 27, 2018 8:27 pm hey! 10/25/2018 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. Maybe they have started on May's applications. Will keep you updated. Yeah that's cool and congrats I hope you will hear the decision soon Good luck I received supplemental questions today, also submitted the answers today. Heey That's Good I wish you hear now the decision Soon Have a good day! <p><p>jarikaija wrote: ↑Tue Oct 30, 2018 12:34 pm jarikaija wrote: ↑Tue Oct 30, 2018 12:32 pm elNino wrote: ↑Tue Oct 30, 2018 12:07 am Yeah some applications are processing quickly , Which embassy your wife selected ? Bangkok / Thailand. But nothing to do with embassy, since application done online and identify done and accepted. Now the only brake here is migri. Yeah you are right, thanks for the answer i guess not all applications are on the same queue, hopefully my application will be processing soon, and same for all guys who are waiting.<p><p>m.parvia wrote: ↑Tue Oct 30, 2018 3:21 am I received supplemental questions today, also submitted the answers today. Niiiiiice! Maybe you are one of those, who have a rapid line on highway <p><p>m.parvia wrote: ↑Sat Oct 27, 2018 8:27 pm Achrafakil wrote: ↑Tue Oct 09, 2018 3:38 am The same here I applied this year 3rd of may is been 5 months now hey! 10/25/2018 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. Maybe they have started on May's applications. Will keep you updated. I sincerely doubt it.<p><p>I have applied in 3rd of May and today they start processing it takes 6 months exactly how I was expecting ( 5/3/2018 )You have proved your identity and a diary number has been created for your application. You can see the diary number at the top of the page. Your application has been placed in the processing queue. We will contact you if we need more information from you. Our processing times can be found on our website at www.migri.fi ( 11/6/2018 )The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. Wish everyone Here Good luck <p><p>Today My Wife received Letter from migri about 23 questions to answer And that I have to call embassy about interview date But the suprise when. I ask embassy they give date which it will be after 2 months Wish everyone Good luck<p>", "content": "", "time": " Sat Oct 27, 2018 4:54 am", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018 - Page 8", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96969&sid=6db7e42f437a76f7758e1eea57c0649b&start=105", "review": "<p>Achrafakil wrote: ↑Sat Nov 10, 2018 3:20 am Today My Wife received Letter from migri about 23 questions to answer And that I have to call embassy about interview date But the suprise when. I ask embassy they give date which it will be after 2 months Wish everyone Good luck Which country did you apply your RP for Finland? If you don't mind me asking. But I hope you will get your decision soon. <p><p>KattyTheKitty wrote: ↑Sat Nov 10, 2018 4:06 am Achrafakil wrote: ↑Sat Nov 10, 2018 3:20 am Today My Wife received Letter from migri about 23 questions to answer And that I have to call embassy about interview date But the suprise when. I ask embassy they give date which it will be after 2 months Wish everyone Good luck Which country did you apply your RP for Finland? If you don't mind me asking. But I hope you will get your decision soon. I apply in Morocco, <p><p>Good luck Achraf it sucks that you have to wait 2 months just for having interview. (they want to make it 9 months pff)<p><p>Pppts wrote: ↑Mon Sep 03, 2018 5:20 pm Today my husband got positive decision of RP, we have waited 8 months and 9 days. We waited about 6 months to be processed, then I answered questioners, my husband went for interview, I attached supplements and answered more questions. And thanks migri and God, that finally we got the good decision. Good luck everyone. <3 <3 <3 Could you share what kind of interview he had?<p><p>After six months of waiting (applied 18 May), Migri finally got around to sending me and my wife some questions to answer. I am in no way overly excited, because I know there's just more red tape and more waiting to come. But, it's something, at least.<p><p>undertakerfreak wrote: ↑Fri Nov 23, 2018 5:16 pm After six months of waiting (applied 18 May), Migri finally got around I know that some people wait for years in the US for the Green Card, and Canadian processing also takes years. But this is Finland, it should have been faster, I know that there is some investigation ongoing into the processes and staffing at Migri. And I know that they have also promised additional funding to make things happen, particularly for work-based immigration. I could perhaps convince myself that this is a resource based issue, and not a wilful bias. Hopefully, things get a bit better. I know few of the people there, interacted with them in the past... have spoken to them. They are still in similar roles, and I personally don't have a high opinion of them.<p><p>Hello everyone!I applied for first residence permit enter in finland.my wife is Finnish citizens.we married in Italy by European Union law but registration marriage in finland.i gave my identity 10.01.2018.i applied by E service 9.05.2018.now my application is still waiting for processing.i have two questions.first.usuing how long migr take for decision.? second migr ask for interview in every cause?thank reply me.<p><p>Went to turn in the answers to the questions Migri asked my wife and I, assuming I'd be talking to someone there. Instead, a security guard just pointed at this nondescript, empty bin hanging on the wall. Makes me wonder how often they check it.<p><p>Any developments about the Finland residence permit on family ties basis, applicants in April 2018<p><p>Woke up to find my first residence permit has arrived, exactly eight months after I applied in person at Migri. I didn't have to do the interview that I keep reading about, and neither did my wife. A great day, indeed.<p><p>undertakerfreak wrote: ↑Tue Dec 18, 2018 4:49 pm Woke up to find my first residence permit has arrived, exactly eight months after I applied in person at Migri. I didn't have to do the interview that I keep reading about, and neither did my wife. A great day, indeed. Lucky you!!<p><p>This is my case, even tho I've been illegal in Finland for about 9 months after my 90 days as a tourist. (I married my wife 20 days after my 90 days period ended). About 1 week after I proved my identity in the Migri office, I had to pay a cheap fine to the Police then everything was fine. 11/16/2018 You have proved your identity and a diary number has been created for your application. You can see the diary number at the top of the page. Your application has been placed in the processing queue. We will contact you if we need more information from you. Our processing times can be found on our website at www.migri.fi 12/20/2018 A decision has been made on your application. 12/20/2018 The decision can be read on your user account. Don't ask me how that was possible. My wife thinks I may have some kind of guardian angel or something.<p><p>5/7/2018 You have proved your identity. 10/24/2018 You have sent additional information for the application. 10/25/2018 The processing of your application has started. 10/29/2018 You have replied to a request for supplementary information. 12/20/2018 You have sent additional information for the application. 12/21/2018 A decision has been made on your application. Here's my story, A day before my application started processing I updated my address which was followed by supplemental questions which I answered quickly. I felt like they forgot about me and so i decided to give them a nudge. I updated my address again and thought, \"hey I bet you get the decision the day after because they forgot about you\". So said so done. I applied based on the being the fiance of a finnish citizen. We have lived together in the US for over 2.5 years. We are moving back to Finland together. Thank you guys for the support over the months, I welcome any questions you may have.<p><p>Mateusgod wrote: ↑Thu Dec 20, 2018 5:06 pm This is my case, even tho I've been illegal in Finland for about 9 months after my 90 days as a tourist. (I married my wife 20 days after my 90 days period ended). About 1 week after I proved my identity in the Migri office, I had to pay a cheap fine to the Police then everything was fine. 11/16/2018 You have proved your identity and a diary number has been created for your application. You can see the diary number at the top of the page. Your application has been placed in the processing queue. We will contact you if we need more information from you. Our processing times can be found on our website at www.migri.fi 12/20/2018 A decision has been made on your application. 12/20/2018 The decision can be read on your user account. Don't ask me how that was possible. My wife thinks I may have some kind of guardian angel or something. Probably would have been a lot easier to take care of your marriage and apply for your RP during your 90 days, that way you could stay legally for as long as it takes Migri to make a decision. But, whatever works, I guess. I find it pretty stupid that I did everything by the book and had to wait eight months, and someone who was here illegally got a positive decision in just one month. I guess I'll never understand how the @#$% Migri conducts its business, but congrats, I guess.<p><p>Congrats to all people who got their RP Recently, Most of you waited so long, except one case (lucky you man). Wish you all the best in your life guys. My case : (2014 = Met my wife online) / (2015 = we met for first time in my home country) / (2017 = Second meeting + Proposed) / (2018 = we got married) i applied Online from abroad 10/2018 We have received your application and it is pending. 10/2018 You have proved your identity and a diary number has been created for your application. I don't know how long this will take, but i can change nothing nor make it faster, so i will keep my prayers <p>", "content": "", "time": " Sat Nov 10, 2018 4:06 am", "type": "forum"}
{"title": "Student RP application", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97734&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello, I submitted my application on 28th September and proved my identity in the embassy on 2nd October. Now its been almost 3 months and I haven't received any updates regarding my application, its still shows \"waiting for processing\" status. Can someone please advise on how much more time it will take as my studies are going to start in January. Thanks!<p>", "content": "Hello, I submitted my application on 28th September and proved my identity in the embassy on 2nd October. Now its been almost 3 months and I haven't received any updates regarding my application, its still shows \"waiting for processing\" status. Can someone please advise on how much more time it will take as my studies are going to start in January. Thanks!", "time": " Tue Dec 18, 2018 4:12 pm", "type": "forum"}
{"title": "Tax exempt", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97725&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello, I will hopefully move to Finland soon and I saw in Info Finland website that I can bring my car and personal belongings 'tax free'. I read about the rules too from tulli and vero. I will bring a car there and I'm considering to sell it after 1 year(after that mandatory year of 'not able to sell') and as I saw from nettiauto, theres a possibility of making profit from that too. But what troubles me is should I go for pickups for 5 people or awd suv? I mean, how popular or unpopular/expensive pickups are in meaning of yearly taxes and ownership? Thanks<p><p>Pick-up trucks are almost exlusively bought as work vehicles, by businesses and individuals that need to haul stuff around, almost no-one gets those as a primary family car, even if it would seat five people. SUVs are more common, naturally there's great variety in models and price. I'd suggest to bring a car that is suitable for you and for people in general, the more exclusive and expensive it is, the harder time you will have in selling it later.<p><p>Ural wrote: ↑Mon Dec 17, 2018 8:46 am I will hopefully move to Finland soon and I saw in Info Finland website that I can bring my car and personal belongings 'tax free'. \"A number of amendments to the Car Tax Act entered into force on 1 January 2015. The tax reductions for motor vehicles imported to Finland as removal goods were abolished.\" https://www.vero.fi/en/individuals/tax- ... val-goods/<p><p>Ural wrote: ↑Mon Dec 17, 2018 8:46 am Hello, I will hopefully move to Finland soon and I saw in Info Finland website that I can bring my car and personal belongings 'tax free'. I read about the rules too from tulli and vero. I will bring a car there and I'm considering to sell it after 1 year(after that mandatory year of 'not able to sell') and as I saw from nettiauto, theres a possibility of making profit from that too. But what troubles me is should I go for pickups for 5 people or awd suv? I mean, how popular or unpopular/expensive pickups are in meaning of yearly taxes and ownership? Thanks You have read old information? \"A number of amendments to the Car Tax Act entered into force on 1 January 2015. The tax reductions for motor vehicles imported to Finland as removal goods were abolished.\" https://www.vero.fi/en/individuals/tax- ... val-goods/ It might still be profitable to bring car with you as there are a lot of car dealerships that bring cars from abroad to sell here.<p><p>that I can bring my car and personal belongings 'tax free' If you import a car tax free you can run into trouble when you try to sell it in Finland. (pay the import tax) But I don't know how it is with the new car tax act.<p><p>https://tulli.fi/en/private-persons/mov ... eu-country This is what they say in Tulli. So as I've read, I can bring a car there which I've used for at least 6 months in here and it would be tax exempt(if I wouldn't sell it there for the upcoming 12 months after moving). https://www.infofinland.fi/en/moving-to ... to-finland But in here something bothers me, do I have to pay autovero(car tax as I've understood)? Or more like, how many taxes in a car you have and which ones I'll be exempt from? In any way, if we'd talk spesifically about a car; Kia Sportage 1.6 T-Gdi awd 2016 model is 37000e in there(nettiauto) in used market and in here its less than 20000e. So there's a good amount of profit looking that way. Not even talking about pickups even; brand new Mercedes X class is 30000e here and in there is more than 50000e.<p><p>Car taxation is handled by Vero (not tulli) https://www.vero.fi/en/individuals/vehicles/car_tax/ Car tax excemption is for temporary use of a non-Finnish registered car, does not apply to you if you're moving in, importing a car, using it for a longer period and/or selling it. https://www.vero.fi/en/individuals/vehi ... xempt_use/<p><p>FinnGuyHelsinki wrote: ↑Tue Dec 18, 2018 7:26 am Car taxation is handled by Vero (not tulli) https://www.vero.fi/en/individuals/vehicles/car_tax/ Car tax excemption is for temporary use of a non-Finnish registered car, does not apply to you if you're moving in, importing a car, using it for a longer period and/or selling it. https://www.vero.fi/en/individuals/vehi ... xempt_use/ Thank you but my situation is not what you linked and as I have said in first post, I checked vero too. Here what it says in their website; \"For motor vehicles imported from outside the EU, the Finnish Customs will also issue a separate decision in which it approves the exemption of the vehicle from customs duties and VAT.\" Emphasis on Non Eu https://www.vero.fi/en/individuals/tax- ... val-goods/<p><p>Ural wrote: ↑Mon Dec 17, 2018 4:20 pm https://tulli.fi/en/private-persons/mov ... eu-country This is what they say in Tulli. So as I've read, I can bring a car there which I've used for at least 6 months in here and it would be tax exempt(if I wouldn't sell it there for the upcoming 12 months after moving). Did you read this also? https://tulli.fi/en/private-persons/mov ... oval-goods<p><p>Upphew wrote: ↑Tue Dec 18, 2018 9:19 am Ural wrote: ↑Mon Dec 17, 2018 4:20 pm https://tulli.fi/en/private-persons/mov ... eu-country This is what they say in Tulli. So as I've read, I can bring a car there which I've used for at least 6 months in here and it would be tax exempt(if I wouldn't sell it there for the upcoming 12 months after moving). Did you read this also? https://tulli.fi/en/private-persons/mov ... oval-goods Yes I did, is there anything you want me to check there specifically? My situation is outside EU customs and fiscal territory, and also resident outside EU at least 12 months. I saw in vero that exemption is 13450e tops. So pickups for 5 people would have to pay the extra; considering the autovero brand new ones pay, I'd have to pay around 9000e still(they have around 22000 of taxes). Would appreciate any input.<p><p>Ural wrote: ↑Tue Dec 18, 2018 9:55 am Upphew wrote: ↑Tue Dec 18, 2018 9:19 am Ural wrote: ↑Mon Dec 17, 2018 4:20 pm https://tulli.fi/en/private-persons/mov ... eu-country This is what they say in Tulli. So as I've read, I can bring a car there which I've used for at least 6 months in here and it would be tax exempt(if I wouldn't sell it there for the upcoming 12 months after moving). Did you read this also? https://tulli.fi/en/private-persons/mov ... oval-goods Yes I did, is there anything you want me to check there specifically? My situation is outside EU customs and fiscal territory, and also resident outside EU at least 12 months. I saw in vero that exemption is 13450e tops. So pickups for 5 people would have to pay the extra; considering the autovero brand new ones pay, I'd have to pay around 9000e still(they have around 22000 of taxes). Would appreciate any input. From the tulli's link: \"If the requirements on removal goods are met, Customs confirms exemption from customs duty and value added tax for vehicles brought from outside the EU customs and tax territory with a customs clearance decision in connection with import. \" and then the excemption: \"An individual who has moved to Finland by 31 December 2017 is eligible for the tax reduction if the motor vehicle taxed as a vehicle imported to Finland as removal goods is registered for the use of the individual in question or if a binding agreement on the purchase of the vehicle has been made by 31 December 2014.\" If you meet that criteria then you get exempted from the tax.<p><p>Upphew wrote: ↑Tue Dec 18, 2018 10:34 am Ural wrote: ↑Tue Dec 18, 2018 9:55 am Upphew wrote: ↑Tue Dec 18, 2018 9:19 am Did you read this also? https://tulli.fi/en/private-persons/mov ... oval-goods Yes I did, is there anything you want me to check there specifically? My situation is outside EU customs and fiscal territory, and also resident outside EU at least 12 months. I saw in vero that exemption is 13450e tops. So pickups for 5 people would have to pay the extra; considering the autovero brand new ones pay, I'd have to pay around 9000e still(they have around 22000 of taxes). Would appreciate any input. From the tulli's link: \"If the requirements on removal goods are met, Customs confirms exemption from customs duty and value added tax for vehicles brought from outside the EU customs and tax territory with a customs clearance decision in connection with import. \" and then the excemption: \"An individual who has moved to Finland by 31 December 2017 is eligible for the tax reduction if the motor vehicle taxed as a vehicle imported to Finland as removal goods is registered for the use of the individual in question or if a binding agreement on the purchase of the vehicle has been made by 31 December 2014.\" If you meet that criteria then you get exempted from the tax. Maybe better to hire a professional since there are more questions I have in my mind<p>", "content": "Hello, I will hopefully move to Finland soon and I saw in Info Finland website that I can bring my car and personal belongings 'tax free'. I read about the rules too from tulli and vero. I will bring a car there and I'm considering to sell it after 1 year(after that mandatory year of 'not able to sell') and as I saw from nettiauto, theres a possibility of making profit from that too. But what troubles me is should I go for pickups for 5 people or awd suv? I mean, how popular or unpopular/expensive pickups are in meaning of yearly taxes and ownership? Thanks", "time": " Mon Dec 17, 2018 8:46 am", "type": "forum"}
{"title": "Finnish girlfriend pregnant", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97717&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hey everyone Im new to this site and just found it when doing research for my situation. I am an American who was planning to get my residency permit in the next year or more. I have just found out that my Finnish girlfriend is 8 weeks pregnant. I left Finland about a month ago and not only do I not have money to go back but Id have to wait another 60 ish days to be able to enter the Schengen zone again. Ive called the Finnish consulate and vfs.global as well as reading other things online. As far as Ive been able to find or been told, I am either supposed to apply for the regular residency permit or wait for the child to be born and then apply as the father. Not only is the latter option not viable due to the fact that I will need to be present for the later stages of pregnancy and the birth but I will also need to be working during this time. I have a comfortable job here in the US but as I said I am wanting to be there towards the end of her pregnancy and therefore will need to work there. I am at a loss for the best thing to do now. In the two other similar cases like this I have read in this forum the non Finns were the ones pregnant. How does the fact that I am the father and the non Finn affect my chance of getting the permit? And is anyone able to help me with finding a way to speed up the process of moving there to work and to live with my new family? Thank you all for your time and help. This forum has already been very useful.<p><p>From https://migri.fi/en/i-want-to-apply . Your safest bet would be to get married. If not, \"In some cases, a partner in an established intimate relationship may be a sufficient reason for granting a temporary residence permit. In such cases, the grounds for granting the permit may include living together (proven for example by a rental agreement or an extract from a register of occupants), pregnancy or other factor that shows you have a permanent connection, such as your intention to start a family later.\" For a work-based residence permit, you'll need a job here first. I don't know if there are any ways to speed up the processing of the application (maybe there is, maybe there isn't), in any case, the sooner you submit it the better.<p><p>If you are not married with her when the child is born, you as a father will not be recognized automatically, and may require a longer process than you think. The fact you are american maybe is more easy but still is not automatically. As said said before the best will be to marry her and apply as family member permit. This takes quite long in general, like 9 months but it's the easiest to get it.<p><p>Great, thank you. We have talked about getting married to see if that would help speed up the process. Would anyone know if there is a difference between signing the papers in the US compared to in Finland? She is coming to visit in January to meet my family and tell everyone she is pregnant so we thought about getting married here. Or if for some reason getting married in Finland would be better for our situation would it be worth me going there to do the deed? Thank you so much for the help. Please add anything else you might think is useful. Ive been doing so much reading and research the last few days it hurts so it is so nice to just read real peoples thoughts and advice on these things. It seems the main thing I need to figure out now is finding a job over there before I can even send in my application. Other than this forum are there any job searching tips someone can help me with? I am a professional floor installer as well as having many years of janitorial experience and moderate hostel/hospitality work. Other than a few classes I have no college education. I realize that my job opportunities are limited by the working permit and I think I would only qualify to get a job as a skilled professional, meaning in my flooring trade? I really do not fully understand how the work part of my application is supposed to work. In my experience as a traveler meeting many people from around the world construction workers are usually not the travelling and/or move to another country type. I fear that construction might not be the easiest field to get into in another country where I do not know the language. This whole ordeal has been very taxing on us and it only seems to be getting worse. But we could not be more excited to start this new adventure together. Other than the mother of my child I have had no one to talk with about all this so finding this forum and reading other stories and questions has been a real blessing to me.<p><p>In my opinion I think that getting married and then apply for the permit might sound a little curious to the authorities, maybe they can think you are getting married for convenience. They might see it so or they might not, it's hard to say. If you can prove that you are in a established relationship then it could be easier. You have two options, the first is, given your current scenario, to apply for other grounds, that would be your girlfriend being pregnant. Second option is to apply on the ground of family ties, in which case you need to prove that you have been in a established relationship for a while. As I said in my opinion getting married wouldn't NECESSARILY speed up the process. Again, this is only my opinion. Both permits will give the right to work, so you don't need to have a job beforehand. However, if you could get a job here it would make things a little bit easier. In that case you could apply for a permit on the grounds of working. Good luck<p><p>Regarding work itself, you can live in Finland without speaking any finnish and even work in an english-speaking environment. But I believe that on the field you would work being fluent in finnish would be mandatory. Give it a shot, maybe you are lucky, but I want to let you know the difficulties you might face.<p><p>It's not only about permit, If you are married when the children is born you are automatic the father. If you are not married then you need to get you recognized as father, this could be a long process and can require even a DNA test. About marriage, it does not matter where you make it but needs to me marked in Finnish population register as married (before the child is born). If you do it in Finland will be easier, if you do it in US you need to register it in Finland, it can be done at Finnish embassy in US or in Finland. If you marry in US, she will need a certificate from Finnish embassy that she can get married. If you marry in Finland, you will need one from US or US embassy in Finland. If you plan to live in Finland, my personal suggestion is to get married in Finland and later you can register your marriage in US.<p>", "content": "Hey everyone Im new to this site and just found it when doing research for my situation. I am an American who was planning to get my residency permit in the next year or more. I have just found out that my Finnish girlfriend is 8 weeks pregnant. I left Finland about a month ago and not only do I not have money to go back but Id have to wait another 60 ish days to be able to enter the Schengen zone again. Ive called the Finnish consulate and vfs.global as well as reading other things online. As far as Ive been able to find or been told, I am either supposed to apply for the regular residency permit or wait for the child to be born and then apply as the father. Not only is the latter option not viable due to the fact that I will need to be present for the later stages of pregnancy and the birth but I will also need to be working during this time. I have a comfortable job here in the US but as I said I am wanting to be there towards the end of her pregnancy and therefore will need to work there. I am at a loss for the best thing to do now. In the two other similar cases like this I have read in this forum the non Finns were the ones pregnant. How does the fact that I am the father and the non Finn affect my chance of getting the permit? And is anyone able to help me with finding a way to speed up the process of moving there to work and to live with my new family? Thank you all for your time and help. This forum has already been very useful.", "time": "Thu Dec 13, 2018 11:48 pm", "type": "forum"}
{"title": "Drivers License Transfer - USA to Finland", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97607&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Aloha, When my wife moved to the USA, not all states recognized her Finnish/European drivers license; we are now moving to Finland... Does Finland care which state my license is from? e.g. Would my Hawaii license be the same as if i transferred it to Michigan first? I am only finding stuff at the country level... USA to Finland = ok... But the other direction didnt work like that so... thanks KIITOS~! Mahalo, John<p><p>Hi John, I researched this since I was looking to tranfer my NY license and so I can give you a run down. The simple answer is no you cannot tranfer your US licence to a Finland (or any other European Union country) since US is not a part of the Vienna Convention on Road Traffic. What needs to be done: 1. Get medical certificate from https://www.terveystalo.com/fi/ or http://omalaakarisi.fi or http://www.itakeskuksenpoliklinikka.fi/ (should be less than 50 euro) 2. Driving licences not granted by an EU, EEA or Contracting State (https://ajokortti-info.fi/en/basic-info ... sh-licence) You will have to apply for a driving licence permit, pass the driving examination. You must submit your foreign driving licence and a medical certificate as an attachment to your application, to Ajovarma (https://ajokortti-info.fi/en/getting-a-driving-licence https://www.ajovarma.fi/booking). The new driving licence will be sent to your home address within 2 weeks from passing the examination. Your driver's license should be valid. I am yet to move to finland so I cannot vouch if the information provided is accurate. Mahalo Sudeep<p><p>deepsudeep wrote: ↑Sun Nov 18, 2018 8:17 am I am yet to move to finland so I cannot vouch if the information provided is accurate. It's not. deepsudeep wrote: ↑Sun Nov 18, 2018 8:17 am The simple answer is no you cannot tranfer your US licence to a Finland (or any other European Union country) since US is not a part of the Vienna Convention on Road Traffic. US is part of the 1949 Geneva convention which means the license can be transferred. https://ajokortti-info.fi/en/basic-info ... sh-licence waikikiguy wrote: ↑Sat Nov 17, 2018 7:58 pm Does Finland care which state my license is from? No.<p><p>betelgeuse wrote: ↑Sun Nov 18, 2018 9:38 am deepsudeep wrote: ↑Sun Nov 18, 2018 8:17 am I am yet to move to finland so I cannot vouch if the information provided is accurate. It's not. deepsudeep wrote: ↑Sun Nov 18, 2018 8:17 am The simple answer is no you cannot tranfer your US licence to a Finland (or any other European Union country) since US is not a part of the Vienna Convention on Road Traffic. US is part of the 1949 Geneva convention which means the license can be transferred. https://ajokortti-info.fi/en/basic-info ... sh-licence waikikiguy wrote: ↑Sat Nov 17, 2018 7:58 pm Does Finland care which state my license is from? No. Thats really good to know!!! I feel so relieved. I didn't didnt realize that the Geneva convention was different. Thanks!<p><p>betelgeuse wrote: ↑Sun Nov 18, 2018 9:38 am US is part of the 1949 Geneva convention which means the license can be transferred. Certainly did not work the other way around in 2016...<p><p>betelgeuse wrote: ↑Sun Nov 18, 2018 9:38 am deepsudeep wrote: ↑Sun Nov 18, 2018 8:17 am I am yet to move to finland so I cannot vouch if the information provided is accurate. It's not. deepsudeep wrote: ↑Sun Nov 18, 2018 8:17 am The simple answer is no you cannot tranfer your US licence to a Finland (or any other European Union country) since US is not a part of the Vienna Convention on Road Traffic. US is part of the 1949 Geneva convention which means the license can be transferred. https://ajokortti-info.fi/en/basic-info ... sh-licence waikikiguy wrote: ↑Sat Nov 17, 2018 7:58 pm Does Finland care which state my license is from? No. So I went to the Ajovarma Malmi for transferring my license and they asked me to get a medical certificate. Got a temporary license to use within Finland till I get the final one.<p>", "content": "Aloha, When my wife moved to the USA, not all states recognized her Finnish/European drivers license; we are now moving to Finland... Does Finland care which state my license is from? e.g. Would my Hawaii license be the same as if i transferred it to Michigan first? I am only finding stuff at the country level... USA to Finland = ok... But the other direction didnt work like that so... thanks KIITOS~! Mahalo, John", "time": " Sat Nov 17, 2018 7:58 pm", "type": "forum"}
{"title": "Changing address while waiting for RP", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97654&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hey all, I applied for a residence permit and then while it was in the queue, I changed my address, I also changed it in posti, now, I received a positive decision and waiting for the card. Will it automatically come to the new address that I submitted to post and the maistraatti, or do I need to inform them :Migri: somehow, and if I do need to do this, does anyone know how?<p><p>If you applied in enterfinland, you can use the PDF form below to update your address with migri. I will be changing address soon and I contacted my service point to ask what I should do. They suggested I send them my new address in email so they can update it since they will be the one sending the mail to me. In your case you already received a decision so I advice that you act quickly. https://migri.fi/documents/5202425/6287 ... nen_en.pdf For more info https://migri.fi/en/notify-us-of-changes<p><p>I went to them and it turns out that If I changed it in maistraatti it automatically gets updated on migri after few days<p>", "content": "Hey all, I applied for a residence permit and then while it was in the queue, I changed my address, I also changed it in posti, now, I received a positive decision and waiting for the card. Will it automatically come to the new address that I submitted to post and the maistraatti, or do I need to inform them :Migri: somehow, and if I do need to do this, does anyone know how?", "time": " Sun Nov 25, 2018 2:03 pm", "type": "forum"}
{"title": "Applying for a Resident Permits", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97709&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi guys, I am from Vietnam and currently working for a company here. I have been searching for businesses in Finland recently and I have found some very interesting companies for sale. I would like to buy them. My question is what type of immigration application should I apply? From the website https://migri.fi, I can see that I am a private trader and I have to apply for an entrepreneur visa. Am I right? There is also a requirement on minimum salary, I planned to quit my job for some preparations before buying a business. Does this violate the salary requirement? And is there anything else that I would have to notice? Please give me some advices if you can!! Thank you very much!!<p><p>The information is available on Migri pages: https://migri.fi/en/entrepreneur<p><p>Maybe this link is useful too.There is information in English about applying the RP: https://www.foreigner.fi/articulo/movin ... 00741.html<p>", "content": "Hi guys, I am from Vietnam and currently working for a company here. I have been searching for businesses in Finland recently and I have found some very interesting companies for sale. I would like to buy them. My question is what type of immigration application should I apply? From the website https://migri.fi, I can see that I am a private trader and I have to apply for an entrepreneur visa. Am I right? There is also a requirement on minimum salary, I planned to quit my job for some preparations before buying a business. Does this violate the salary requirement? And is there anything else that I would have to notice? Please give me some advices if you can!! Thank you very much!!", "time": " Mon Dec 10, 2018 9:42 am", "type": "forum"}
{"title": "How long do you have to wait for the card? Share your experience!", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97567&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi guys, Just being curious about the waiting time for the card to arrive in your mailbox. My decision is made already, and It's been over two weeks, but no mail from migri in my mailbox that contains RP card has arrived at my address. I have contacted migri, and they said that they are sending it as an ordinary letter which kinda concerns me since I cannot track it and It doesn't have tracking number either. So, I'm here would like to know about your experience on that matter. How long did you have to wait for the card to arrive? Kiitoksia. <p><p>About 2-3 weeks in Finland.<p><p>Beep_Boop wrote: ↑Fri Nov 09, 2018 3:44 pm About 2-3 weeks in Finland. Yeah, that's what I found on migri website too. Maybe I just being worried about it getting lost somewhere since Neuvola once sent me a letter to my address and It has never showed up!! <p><p>Somehow I received mine in exactly a week, and I'm in the US. They must have mailed it the consulate that same day, who then sent it to me. Thought it would take longer but it was very quick.<p><p>Radioactive wrote: ↑Sat Nov 10, 2018 3:15 am Somehow I received mine in exactly a week, and I'm in the US. They must have mailed it the consulate that same day, who then sent it to me. Thought it would take longer but it was very quick. Wow. That was fast. I once sent my husband some paperworks from my home country to his address (in Finland) back then, It took 2 weeks for all those papers to arrive in Finland. I'm waiting for the card in Finland. Hoping It will be in my mailbox soon! Hoping It won't get lost. <p><p>Most of the 2-3 weeks is waiting for the card to be manufactured.<p><p>Decision for my extension took a week. Card must be made and arrives in 2-3 weeks.<p><p>heretostay wrote: ↑Sat Nov 10, 2018 8:46 am Most of the 2-3 weeks is waiting for the card to be manufactured. So the card will arrive after 2-3 weeks then?<p><p>Rasikko wrote: ↑Sat Nov 10, 2018 10:31 am Decision for my extension took a week. Card must be made and arrives in 2-3 weeks. Kiitoksia. I'll just have to wait a lil longer then. Hopefully, It will be in my mailbox soon though. <p><p>Took 3 weeks for my wife's card to arrive. But her name was wrong. Contacted migri, They fixed it and got 3 weeks later new card<p><p>alberti wrote: ↑Tue Nov 13, 2018 4:37 pm Took 3 weeks for my wife's card to arrive. But her name was wrong. Contacted migri, They fixed it and got 3 weeks later new card Got it. Thanks for sharing your experience. <p><p>It is relative. In my case the decision took 6 days and the card arrived after 8 days in the Embassy of Finland in Chile.<p><p>Card arrived in 2 weeks after decision.<p><p>I finally received my card last week. I took 4 weeks to get it. <p><p>KattyTheKitty wrote: ↑Mon Dec 03, 2018 8:57 am I finally received my card last week. I took 4 weeks to get it. 4 weeks in Finland or abroad?<p>", "content": "Hi guys, Just being curious about the waiting time for the card to arrive in your mailbox. My decision is made already, and It's been over two weeks, but no mail from migri in my mailbox that contains RP card has arrived at my address. I have contacted migri, and they said that they are sending it as an ordinary letter which kinda concerns me since I cannot track it and It doesn't have tracking number either. So, I'm here would like to know about your experience on that matter. How long did you have to wait for the card to arrive? Kiitoksia. ", "time": " Fri Nov 09, 2018 2:16 pm", "type": "forum"}
{"title": "Resident Card of EU family Member", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97706&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi, I moved to Finland in Oct 2018 with my wife who is EU national and she got a job offer in Helsinki, after her registration for Right of residence in migri I applied for Eu family member resident card . Migri website says that it takes 2-6 months approx . i want to know that if someone got their card in this time frame . and what will the be validity of this card. Cheers. ak<p><p>Card is valid 5 years.<p>", "content": "Hi, I moved to Finland in Oct 2018 with my wife who is EU national and she got a job offer in Helsinki, after her registration for Right of residence in migri I applied for Eu family member resident card . Migri website says that it takes 2-6 months approx . i want to know that if someone got their card in this time frame . and what will the be validity of this card. Cheers. ak", "time": "Mon Dec 10, 2018 12:17 am", "type": "forum"}
{"title": "first RP spouse of a Finnish citizen", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97687&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>hiii Question For those with previous experiences How long the card takes to reach your embassy ?<p><p>Usually up to two weeks, but it can also take up to three weeks. At which embassy you are expecting them?<p><p>2 weeks to 1 week to 3 weeks to 4 weeks It depends on embassy<p><p>hiii Re: first RP spouse of a Finnish citizen Question For those with previous experiences How long the card takes to reach your embassy ?<p><p>.<p>", "content": "hiii Question For those with previous experiences How long the card takes to reach your embassy ?", "time": " Tue Dec 04, 2018 7:07 pm", "type": "forum"}
{"title": "Is it possible for me to be accepted as a refugee?", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97682&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>I'm living in Russia and it is quite probable I'll be conscripted for serving in the Russian army. But it is also probable I'll be in quite harsh relationship with local ethnic minorities which I can't, most likely, stand against because I won't get any help from others. So I have several questions: 1. Is it even possible for someone, especially a person with white skin, to get asylum because he or she is in hazard of being persecuted due to being related to the major ethnic group of people in his or her home country by ethnic minorities? 2. If it is, where can I view accepted and rejected asylum application cases in Finland? 3. What kinds of information sources should I use to prove myself?<p><p>https://migri.fi/en/what-are-the-grounds-for-asylum-<p><p>I think you might have better luck with Sweden or Norway. As you can see from the stats, Russians are very rarely granted asylum in Finland. http://tilastot.migri.fi/#decisions/23330/49?l=en<p><p>You might have guessed I'm asking this question because I'm in doubt that my case has a chance to win. Do you think I may try to apply for asylum or it is better for me to find another way out?<p><p>aodhagan wrote: ↑Fri Dec 07, 2018 11:17 pm You might have guessed I'm asking this question because I'm in doubt that my case has a chance to win. Do you think I may try to apply for asylum or it is better for me to find another way out? In my opinion, it doesn't sound very convincing and I guess it would be difficult for you to get asylum. It doesn't sound logic that you need any kind of protection when you are in an army, at least protection from outside the army itself. I don't know all of the background and the situation you may face. But again this is only my opinion. I don't know what other ways you may have.<p><p>vla wrote: ↑Sat Dec 08, 2018 2:37 am In my opinion, it doesn't sound very convincing and I guess it would be difficult for you to get asylum. It doesn't sound logic that you need any kind of protection when you are in an army, at least protection from outside the army itself. I don't know all of the background and the situation you may face. But again this is only my opinion. I don't know what other ways you may have. Maybe you misunderstood me, if I get conscripted, I'll be in the same place as they are, and this causes the trouble. I am not in danger as long as I am not in the army itself. But this seems impossible to avoid conscripting. How much money normally an attorney takes for preparing the case? I don't have much unfortunately<p>", "content": "I'm living in Russia and it is quite probable I'll be conscripted for serving in the Russian army. But it is also probable I'll be in quite harsh relationship with local ethnic minorities which I can't, most likely, stand against because I won't get any help from others. So I have several questions: 1. Is it even possible for someone, especially a person with white skin, to get asylum because he or she is in hazard of being persecuted due to being related to the major ethnic group of people in his or her home country by ethnic minorities? 2. If it is, where can I view accepted and rejected asylum application cases in Finland? 3. What kinds of information sources should I use to prove myself?", "time": " Mon Dec 03, 2018 8:13 pm", "type": "forum"}
{"title": "I'm finish 9 month's", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97699&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi guys I waiting for nine months for family ties. I have had an interview at the embassy in Morocco and I'm still waiting a response <p><p>The resolution is coming soon<p><p>I hope today I finish 9 months<p>", "content": "Hi guys I waiting for nine months for family ties. I have had an interview at the embassy in Morocco and I'm still waiting a response ", "time": " Fri Dec 07, 2018 3:41 pm", "type": "forum"}
{"title": "First RP on Other Grounds (Dating Relationship)", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97691&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi. I will submit my application next week and I need some advise, please! <p><p>How many years have you been living together? Do you know if you satisfy all the requirements?<p><p>vla wrote: ↑Thu Dec 06, 2018 1:41 am How many years have you been living together? Do you know if you satisfy all the requirements? ___ It says on https://enterfinland.fi/eServices/info/residencepermit that: You cannot apply electronically in the following cases: > You are a former Finnish citizen or a returnee. > You are applying for a residence permit on other grounds. ___ On https://migri.fi/en/residence-permit-on-other-grounds: Residence permit application for other grounds Apply for a residence permit with this application if you are applying for a residence permit for a reason which is not one of the reasons for which a separate application form exists. Such reasons are an established dating relationship, an intention to get married with a Finnish citizen or becoming a victim of human trafficking. Tourism is not a valid reason. ___ It is more costly since I need to go abroad. On the website of The Consular Office of Finland in Manila, it says: \"The process of applying a residence permit to Finland is changing. Finland is outsourcing the acceptance of residence permit applications in the Philippines to the Application Centre maintained by VFS Global. The Application Centre opens in Manila 4.12.2018. After outsourcing, the Consular Office of Finland in Manila will accept residence permit applications on a limited basis. Previously, residence permits to Finland have been applied via the Embassy of Finland in Kuala Lumpur. You can make an appointment for a residence permit application there also in the future.\" ___ Yes, we are not married yet. We have been together for a little over a year. We have spent time together in six (6) different occasions in a span of 9 months (Tbilisi, Georgia and the rest was when I was still living and working in Dubai). Here in the Philippines, I have all my assets and my bank account which I will have access to once I am in Finland. Her income won't be considered in this application. I have 16,000€ readily available on my bank account (opened way back 2005) and I have a one bedroom flat which I am leasing/renting out as additional income (the flat has just been turned over this year and has been fully paid as well). Migri replied to my e-mail two months ago that it is not required for me to have additional income aside from the 12,000€ (1,000€ per month) that they require but it is allowed. I just want to be financially secured as possible and that I can help my fiancé as much as I can with the expenses. We plan to get married a couple of months after I arrive in Helsinki. She will be spending Christmas and New Year with me and my family. It is heartbreaking to just be a \"Skype couple\" and of course, traveling puts a dent on our finances as well. Also, the reason we haven't been married yet (or at least be in a civil partnership) is because being GAY could land you in jail in UAE or be deported, and same-sex marriage is not legal here in the Philippines.<p><p>I understand your situation but I cannot help you because I don't know this process. I hope you can work it out, my best wishes. You can remark that in your application, that you cannot get married in your country. I advise you to say that you cannot live outside Finland because of this reason, there should be a question about this in the application. I had also a long-distance relationship for three years and I know it's hard. Now we have been married for 5 years and have been together for 10 in total. So I wish you the best and be patient with the application!<p><p>Go get married in Canada. A couple I know in a similar situation did that. Neither had any ties to Canada at all and said it was easy.<p>", "content": "Hi. I will submit my application next week and I need some advise, please! ", "time": " Wed Dec 05, 2018 5:17 pm", "type": "forum"}
{"title": "Residence permit application on the basis of family ties when your spouse is a Finnish citizen 2017- 2018", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97668&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>hii i apply RP in april 2018 I have not got a decision yet Who has an application in April ?and still wait ? After questions and interview How long should he wait ?<p><p>According to Migri in that case it can take 9 months. There is an option to check the times in their website, it's an estimate. But anyway you need to be patient, it's a long process.<p><p>thanks<p><p>I applied 18 May, and only just a couple of weeks ago got any correspondence from Migri. It was only more questions.<p><p>We are in the same situation<p><p>Nina Sanna wrote: ↑Sun Dec 02, 2018 9:16 pm We are in the same situation Hello Did your husband already interviewed or still waiting for interview? <p><p>Nina Sanna wrote: ↑Sat Dec 01, 2018 4:38 am hii i apply RP in april 2018 I have not got a decision yet Who has an application in April ?and still wait ? After questions and interview How long should he wait ? Hi, which dai in April and did you apply on paper or enter_finland?<p>", "content": "hii i apply RP in april 2018 I have not got a decision yet Who has an application in April ?and still wait ? After questions and interview How long should he wait ?", "time": " Sat Dec 01, 2018 4:38 am", "type": "forum"}
{"title": "Question About Ancestors & Citizenship", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97667&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Wasn't able to find much information regarding ancestors and getting a citizenship; may be a long stretch but I gotta ask!! I have been able to trace my ancestors back to the 1800's and some are Swedish; however, upon taking a DNA test, I found out that a small percentage is Finnish. That being said; I believe the DNA test website is showing me a current map of the Nordic region rather than an old map. I know Finland wasn't a country in the 1800's and that it was split between Sweden and Russia; so it is possible my ancestors were living in what is now Finland. So my question is; how far back would does Finland go in terms of having family members who used to live in the region? Is it just parents or grandparents or can it be much further back?<p><p>speterson177 wrote: ↑Sat Dec 01, 2018 2:49 am Wasn't able to find much information regarding ancestors and getting a citizenship; may be a long stretch but I gotta ask!! I have been able to trace my ancestors back to the 1800's and some are Swedish; however, upon taking a DNA test, I found out that a small percentage is Finnish. That being said; I believe the DNA test website is showing me a current map of the Nordic region rather than an old map. I know Finland wasn't a country in the 1800's and that it was split between Sweden and Russia; so it is possible my ancestors were living in what is now Finland. So my question is; how far back would does Finland go in terms of having family members who used to live in the region? Is it just parents or grandparents or can it be much further back? https://migri.fi/en/finnish-citizenship<p><p>Thank you Upphew; I've looked there and all throughout the site but I don't see anything that relates to ancestors, just grandparents. I would assume they wouldn't date that far back but just thought I'd ask.<p><p>speterson177 wrote: ↑Tue Dec 04, 2018 8:18 pm Thank you Upphew; I've looked there and all throughout the site but I don't see anything that relates to ancestors, just grandparents. I would assume they wouldn't date that far back but just thought I'd ask. No harm in asking. If you want to check what the law says see the officially done unofficial translation of the relevant law: https://www.finlex.fi/en/laki/kaannokse ... 070974.pdf<p><p>Thanks! Lengthy read haha but thank you. I'll take a look at it when time permits.<p><p>Parents and grandparents only. Not any further back.<p><p>heretostay wrote: ↑Wed Dec 05, 2018 8:25 pm Parents and grandparents only. Not any further back. Thanks. I kinda figured that would be the case but just thought I'd ask.<p>", "content": "Wasn't able to find much information regarding ancestors and getting a citizenship; may be a long stretch but I gotta ask!! I have been able to trace my ancestors back to the 1800's and some are Swedish; however, upon taking a DNA test, I found out that a small percentage is Finnish. That being said; I believe the DNA test website is showing me a current map of the Nordic region rather than an old map. I know Finland wasn't a country in the 1800's and that it was split between Sweden and Russia; so it is possible my ancestors were living in what is now Finland. So my question is; how far back would does Finland go in terms of having family members who used to live in the region? Is it just parents or grandparents or can it be much further back?", "time": " Sat Dec 01, 2018 2:49 am", "type": "forum"}
{"title": "Being 3 weeks in waiting for progress step!?", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97684&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi! I am going to start my Ph.D. on 1st Jan. However, my status is Waiting for progress for 21 days. In addition, my friends who submitted and visited the embassy after and before me are in progress. do you know the reason for this case? FYI, one of my friends with 3-day submission before got his positive response in 2 weeks.<p><p>What kind of permit are you applying to? You can check in Migri the processing times for each one. 21 days doesn't seem so long, but again it depends on the kind of permit.<p><p>BiteBill wrote: ↑Tue Dec 04, 2018 1:02 pm Hi! I am going to start my Ph.D. on 1st Jan. However, my status is Waiting for progress for 21 days. In addition, my friends who submitted and visited the embassy after and before me are in progress. do you know the reason for this case? FYI, one of my friends with 3-day submission before got his positive response in 2 weeks. Probably the only one who knows what's going on, or whether anything particular is going on, is the person handling your case. You cannot compare yours to those of anyone else's. See https://migri.fi/en/expected-processing ... at-affects<p><p>Hey, I think every case is different. I hope you get your RP soon. I came to Finland two weeks ago, I would like to work here during the winter. Any ideas?<p>", "content": "Hi! I am going to start my Ph.D. on 1st Jan. However, my status is Waiting for progress for 21 days. In addition, my friends who submitted and visited the embassy after and before me are in progress. do you know the reason for this case? FYI, one of my friends with 3-day submission before got his positive response in 2 weeks.", "time": " Tue Dec 04, 2018 1:02 pm", "type": "forum"}
{"title": "Requerimients for entering with a residence permit", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97672&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi! In a few weeks I am moving to Finland. This is the first time I move with a residence permit for the grounds of work, the other times I was always there as a tourist for less than 90 days. I am familiar with the requirements when going as a tourist, such as return ticket, accommodation bookings, travel insurance, prove of economic solvency, etc. How does it work when I am moving there for work? I will be entering the Schengen territory through Spain. I have the Finnish residence permit and the work contract. Do I need anything else? Thanks for your help.<p><p>vla wrote: ↑Sun Dec 02, 2018 5:17 am How does it work when I am moving there for work? I will be entering the Schengen territory through Spain. I have the Finnish residence permit and the work contract. Do I need anything else? You do not.<p><p>betelgeuse is correct in that, in theory, you do not need anything other than your residence permit and passport. In practice, however, it's a slightly different story. The passport control officer needs to be convinced that you have the right to enter, and sometimes merely having the residence permit and passport will not convince them. For this reason, be prepared to answer simple questions such as where you'll be working, showing them your work contract if they ask for it, showing them your CV if they ask for it, showing them your university degree if it's on your CV and if they ask for it, etc. Most people aren't asked for anything, but some are. Many years ago when I entered on a student residence permit for the first time, I was asked to show university acceptance letter, my high school diploma, and the bank statement.<p><p>Beep_Boop wrote: ↑Sun Dec 02, 2018 2:05 pm betelgeuse is correct in that, in theory, you do not need anything other than your residence permit and passport. In practice, however, it's a slightly different story. Thanks, that's exactly what I thought. Is there any official list of the documents they might ask for? I have checked in the EU website and the Spanish ministry of foreign affairs but found nothing. I will go to the Spanish consulate to ask for guidance anyway, and collect all the possible documents just in case.<p><p>Nothing official. I would say that anything submitted in your residence permit application is a good place to start.<p>", "content": "Hi! In a few weeks I am moving to Finland. This is the first time I move with a residence permit for the grounds of work, the other times I was always there as a tourist for less than 90 days. I am familiar with the requirements when going as a tourist, such as return ticket, accommodation bookings, travel insurance, prove of economic solvency, etc. How does it work when I am moving there for work? I will be entering the Schengen territory through Spain. I have the Finnish residence permit and the work contract. Do I need anything else? Thanks for your help.", "time": " Sun Dec 02, 2018 5:17 am", "type": "forum"}
{"title": "pregnant, unmarried", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=95668&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Good day! I hope you can give me a piece of advice with my situation.. I'm an Asian girl, in a relationship with a Finnish citizen, we've been together less than 2yrs. He met my family in my home country,we had a vacation in other country, and i got my tourist visa for 90days in Finland,we stayed together and love each other.. last month before I leave Finland, before the expiry of my visa, we found out that I'm pregnant,, now I'm back to my home country. I only want to know what type of visa do I need to apply now,, now that I'm pregnant(6weeks) we're not married yet.. Hope I can get some ideas from here.. Thank you so much..<p><p>I believe you have not lived together 2 years, you are not married, based on the pregnancy you cannot get any type of residence permit until your children is born. After he is born, if he will get Finnish citizenship, based on the father, you may apply for family ties residence permit with the child. Recognizing in Finland, your boyfriend paternity may not be so strait forward process as it sounds. Meanwhile, only a visa for visiting is the option, you will be as a tourist in Finland, anything you will have to pay, including if you are getting birth in Finland, and is not cheap. Good luck!<p><p>latikajamal wrote:Good day! I hope you can give me a piece of advice with my situation.. I'm an Asian girl, in a relationship with a Finnish citizen, we've been together less than 2yrs. He met my family in my home country,we had a vacation in other country, and i got my tourist visa for 90days in Finland,we stayed together and love each other.. last month before I leave Finland, before the expiry of my visa, we found out that I'm pregnant,, now I'm back to my home country. I only want to know what type of visa do I need to apply now,, now that I'm pregnant(6weeks) we're not married yet.. Hope I can get some ideas from here.. Thank you so much.. Let him come to your home country and marry him. Then the RP process is easy.<p><p>rinso wrote:latikajamal wrote:Good day! I hope you can give me a piece of advice with my situation.. I'm an Asian girl, in a relationship with a Finnish citizen, we've been together less than 2yrs. He met my family in my home country,we had a vacation in other country, and i got my tourist visa for 90days in Finland,we stayed together and love each other.. last month before I leave Finland, before the expiry of my visa, we found out that I'm pregnant,, now I'm back to my home country. I only want to know what type of visa do I need to apply now,, now that I'm pregnant(6weeks) we're not married yet.. Hope I can get some ideas from here.. Thank you so much.. Let him come to your home country and marry him. Then the RP process is easy. No it is not. Don't lie to people. Their relationship can be flagged as possible false marriage and they have to be prepared to present undeniable evidence of opposite.<p><p>What is your partner's reaction to the pregnancy? Are you two ready to be parents?? Since you are SE asian and unmarried I think it would be better if you have the baby in Finland and marry your partner there. I am assuming both of you are working so can jointly contribute to the hospital bill after you deliver the baby. Since you two have been in a relationship for 2 years and have proof of your relationship you can marry him if you are visiting Finland on a tourist visa. (just mention on your application you intend to marry).<p><p>Their relationship can be flagged as possible false marriage and they have to be prepared to present undeniable evidence of opposite. A bun in the oven (which he recognizes) will be sufficient.<p><p>Please also note that if you are not married, your boyfriend is not automatically considered the baby's father. You'll need to go through some additional bureaucracy in Finland, so that your boyfriend accepts the baby as his own. This will include some questions about your relationship. Until he's officially the baby's father, your child will not have Finnish citizenship.<p><p>theelephantmum wrote:Please also note that if you are not married, your boyfriend is not automatically considered the baby's father. You'll need to go through some additional bureaucracy in Finland, so that your boyfriend accepts the baby as his own. This will include some questions about your relationship. Until he's officially the baby's father, your child will not have Finnish citizenship. If your boyfriend denies (if he does not want the child) you can however request a DNA test to prove he is the father (will cost something too, incl legal stuff), if this DNA test proves he is the father, your child has Finnish citizenship and you will get permanent residence based on family ties (as long as you have custody of the child). But as said, easiest is getting married now, then a lot of things will go so much easier.<p><p>Blessedbaby wrote:What is your partner's reaction to the pregnancy? Are you two ready to be parents?? Since you are SE asian and unmarried I think it would be better if you have the baby in Finland and marry your partner there. I am assuming both of you are working so can jointly contribute to the hospital bill after you deliver the baby. Since you two have been in a relationship for 2 years and have proof of your relationship you can marry him if you are visiting Finland on a tourist visa. (just mention on your application you intend to marry). Thanks for the comment.....We both happy about my pregnancy, He tried to ask immigration in Finland and seek information on what to do. I really have no idea, because this is our first baby, and he wants me to stay and deliver our baby in Finland. Money here is not a problem if ever I'm gonna deliver my baby in Finland...what I want is that to be with him...and my baby deserves to be in Finland because my baby's father is a finnish citizen.. if I deliver my baby here in my home country, I knew it will be a lot of papers and work. I only want to know, what type of visa for me to get to Finland as soon as possible....I was thinking I just finished my 3months tourist visa and I need to wait for 3more months before I'm gonna apply my next visa.. Thank you...<p><p>Yes, you must wait for 3 months before asking a new tourist visa which if they will give it will be for maximum 3 months. Beeing pregnant does not qualify you for any residence permit. If you plan to give birth in Finland while on tourist visa there will be quite a high cost, 2-3k€.<p><p>Hi..yesterday I went to the embassy who process visa for Finland,we don't have finnish embassy in our home country. in my boyfriend's invitation, he said that I'm pregnant and he's going to marry me as soon as I got my visa and apply residence permit in Finland due to family ties. It's a visit visa, for 3mos like what I got before, I had my valid plane tickets back and forth, travel insurance, I never shown any of my bank accounts, I just gave them my boyfriend's bank statement for 3mos, and the proof of my accommodation he's 3property in Finland with title,he's cars because he's a racer since my boyfriend has his own company,he can finance my pregnancy in Finland.i also gave our proof of relationship 3pics, and copies of our passport with stamps of our vacations, like what I presented last time I got my tourist visa for 3mos.... But this time I just added the proof of my pregnancy now it's 17weeks(medical certificate,ultrasound pix) the staff who interviewed me said,your documents are good, you can proceed to biometric, but she noticed I'm giving her 1 more paper, and this is my certificate of non impediment with our embassy stamp on it(authenticated by our embassy) I asked her to legalise my certificate by the embassy of Finland, she answered, they had never encountered that, and they were not allow to do that, I said, my boyfriend said I need it for my marriage if ever I got my visa to visit Finland, so what she told me was, write a letter to the embassy regarding to this matter and she will just insert it in the back of my certificate, so I did, I gave my certificate with a letter asking to legalise my certificate by the finnish embassy even though it's Norway embassy.so now I'm waiting for the result and I will tell to this forum how it goes with my application, I always put into my mind that, everything happens for a reason<p><p>After 5days, I got an answer from the norwegian embassy here in our home country who process the visa under Finland. I'm so happy to say to this forum that my VISA WAS GRANTED, I'm so grateful when the norwegian embassy called me(the reason they called was about the certificate of non impediment) he told me that they were not authorised to put the stamp in that certificate of non impediment and give me some idea on how to get that. We only have consulate from Finland we don't have embassy. I don't know how can I get that stamp now.but it's okay, I'll wait on Monday, my boyfriend will asked the embassy in Finland how to get that stamp. December is my flight going to Finland and I hope I could get that stamp so I could get marry in Finland, and for sure I'm gonna deliver my baby there as I told to my application. I wanna end my thread with this post and goodluck to everyone..everything is possible when you believe..as long as the relationship Is genuine,you have nothing to worry.<p><p>tavastia wrote:Yes, you must wait for 3 months before asking a new tourist visa which if they will give it will be for maximum 3 months. Beeing pregnant does not qualify you for any residence permit. If you plan to give birth in Finland while on tourist visa there will be quite a high cost, 2-3k€. I would like to thank you tavastia for your advice, that was really helpful ,and hope you could spread truthful comments to those who would ask for help..i saw all your comments to different posts in this forum which was really helpful and in detail...thank you and Godbless.<p><p>Blessedbaby wrote:What is your partner's reaction to the pregnancy? Are you two ready to be parents?? Since you are SE asian and unmarried I think it would be better if you have the baby in Finland and marry your partner there. I am assuming both of you are working so can jointly contribute to the hospital bill after you deliver the baby. Since you two have been in a relationship for 2 years and have proof of your relationship you can marry him if you are visiting Finland on a tourist visa. (just mention on your application you intend to marry). Thank you for this comment, really helped me a lot....hope you can help a lot of people who ask for help...thank you and Godbless...<p><p>I'm happy that I got the two stamps for my certificate of non-impediment. I had a problem before thinking where to get that stamp..because we don't have finnish embassy in our home country....since we don't have finnish embassy, we have honorary consulate of Finland in our home country. I send them email and they replied, they told me what to do in that email, and I went there with my certificate of non impediment which was legalised by our department of foreign affairs, and in less than 10minutes, the honorary consulate of Finland in our home country legalised it. So I had the two stamps now in my certificate. I'm excited to see my boyfriend again after 4mos.,and tell him.. I made it! See you next week Finland... Hope it's gonna be a safe flight for me and my little angel.mwah!<p>", "content": "Good day! I hope you can give me a piece of advice with my situation.. I'm an Asian girl, in a relationship with a Finnish citizen, we've been together less than 2yrs. He met my family in my home country,we had a vacation in other country, and i got my tourist visa for 90days in Finland,we stayed together and love each other.. last month before I leave Finland, before the expiry of my visa, we found out that I'm pregnant,, now I'm back to my home country. I only want to know what type of visa do I need to apply now,, now that I'm pregnant(6weeks) we're not married yet.. Hope I can get some ideas from here.. Thank you so much..", "time": " Wed Sep 06, 2017 2:46 pm", "type": "forum"}
{"title": "documentation on the guardianship of the child (legalised)", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=96454&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>https://enterfinland.fi/eServices/info/childspermit Does anybody know how to make this documentation on the guardianship of the child (legalised) and where to legalize it? thank you in advance!<p><p>Any update on this? Did you end up making it?<p><p>This can be anything depends on the country where divorce is taking place. In most cases a divorce certificate / court order is enough if this states how the children are taking care. Legalization will also be country dependent, it could legalization or apostile (easier and cheaper way).<p>", "content": "https://enterfinland.fi/eServices/info/childspermit Does anybody know how to make this documentation on the guardianship of the child (legalised) and where to legalize it? thank you in advance!", "time": " Tue Mar 13, 2018 9:51 am", "type": "forum"}
{"title": "My work/Residence permit Experience - 2017", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=95807&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>So I applied for a work permit last July 2017. And I was very nervous about how long will it take, what papers do I need .. etc. And unfortunately, there isn't a lot of information online from other people who went through the same thing. So after being informed that I was granted the permit, I want to put the whole thing here for anyone who might need or want to know the whole process from start to end. - I came to Finland for an internship for 6 months, and for that, I needed a temporary work permit. I won't discuss this here as I don't remember most of it . - Then after the internship ended, the company offered me a permanent contract to apply for a new work permit. - The company advised me to apply for \"special expert\" work permit because I am a university graduate. On the website, it says: You may be considered to be a specialist if: your work tasks are demanding and require university studies. your salary is higher than average, at least approximately 3,000 euro gross pay per month. FYI: my salary is below 3000 euro. -for the papers, I had to submit online copy of valid passport employment contract degree certificate in addition to that, there were some papers that the company must provide. Finally, this is my enterFinland log that I used to check everyday 1/20/2017 A customer number has been created for you. You can see your customer number at the top of the page. 7/7/2017 We have received the processing fee for your application. 7/7/2017 We have received your application and it is pending. 7/11/2017 You have proved your identity and a diary number has been created for your application. You can see the diary number at the top of the page. Your application has been placed in the processing queue. We will contact you if we need more information from you. Our processing times can be found on our website at http://www.migri.fi 7/18/2017 You have sent additional information for the application. We have received it. The documents you sent are displayed in the application information. 8/18/2017 The Employment and Economic Development Office has made a partial decision on your application. Your application is now in queue for processing at the Finnish Immigration Service. We will contact you if we need additional information. See our website for processing times. 10/3/2017 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. 10/4/2017 A decision has been made on your application. 10/4/2017 The decision can be read on your user account. 10/4/2017 You have received the decision if you have any questions, don't hesitate.<p><p>Hi! Thank you for sharing your experience. I just wanna ask what is initiation certificate means?oct 12 2o17 it says in enter finland it started but until now still in progress..its been 6 days!and how can i know if my partial decision is positive?thank you<p><p>Hi, Thank you for your sharing. I am also looking for people who have the same experience as mine. I also came to Finland in Feb 2017 with a 6-month internship contract (6-month B permit) then extending to a 1-year A permit since Aug 2017 (after 4-month waiting from July to Nov ) Can I please ask if you got the 1-year A permit? Because i am planning on extending my RP next May (in order to avoid long waiting like last time). I'd love to share experience if possible ^^<p><p>wen1220 wrote: ↑Fri Oct 20, 2017 8:52 pm Hi! Thank you for sharing your experience. I just wanna ask what is initiation certificate means?oct 12 2o17 it says in enter finland it started but until now still in progress..its been 6 days!and how can i know if my partial decision is positive?thank you Sorry for the late response, I have no idea to be honest, didn't see this in my case<p><p>linhvu93 wrote: ↑Sun Dec 17, 2017 9:30 pm Hi, Thank you for your sharing. I am also looking for people who have the same experience as mine. I also came to Finland in Feb 2017 with a 6-month internship contract (6-month B permit) then extending to a 1-year A permit since Aug 2017 (after 4-month waiting from July to Nov ) Can I please ask if you got the 1-year A permit? Because i am planning on extending my RP next May (in order to avoid long waiting like last time). I'd love to share experience if possible ^^ I am not sure if I got your question right, but ya, I got a 1 year A permit. is that what you wanted to know ?<p><p>bassiouny wrote: ↑Thu Dec 28, 2017 6:27 pm linhvu93 wrote: ↑Sun Dec 17, 2017 9:30 pm Hi, Thank you for your sharing. I am also looking for people who have the same experience as mine. I also came to Finland in Feb 2017 with a 6-month internship contract (6-month B permit) then extending to a 1-year A permit since Aug 2017 (after 4-month waiting from July to Nov ) Can I please ask if you got the 1-year A permit? Because i am planning on extending my RP next May (in order to avoid long waiting like last time). I'd love to share experience if possible ^^ I am not sure if I got your question right, but ya, I got a 1 year A permit. is that what you wanted to know ? Yes and does your RP limit on your job?<p><p> - I came to Finland for an internship for 6 months, and for that, I needed a temporary work permit. I won't discuss this here as I don't remember most of it . - Then after the internship ended, the company offered me a permanent contract to apply for a new work permit. - The company advised me to apply for \"special expert\" work permit because I am a university graduate. On the website, it says: Hello, Thanks for sharing your experience. I am wondering if you continuously work while processing your application(A-RP for specialist). Thanks,<p><p>Mine took 13 weeks to be ready. Officers, where I had to take a social security number and migri office, wasn't very helpful and their English level was highly questionable. people who work where you get a bus pass speaks way better English. anyways. after 13 weeks and me sending them emails every so often for new estimated time, today I got an email saying I should check my migri profile. There was a blue button of fate and once you click on it, I think you accept your fate. You cannot say you didn't check or seen the decision after clicking on it. Sneaky fins! The website told me to wait for a week or two to get my RP card. good luck everyone, this process is very hard and time-consuming if you ask me.<p><p>Husoe wrote: ↑Wed Oct 24, 2018 4:09 pm Mine took 13 weeks to be ready. Officers, where I had to take a social security number and migri office, wasn't very helpful and their English level was highly questionable. people who work where you get a bus pass speaks way better English. There are no social security numbers in Finland. There is a personal identity code. The distinction is important because you can have a personal identity code and not be covered by Kela.<p><p>here I am again for the 2nd time, 5/16/2018 We have received the processing fee for your application. 5/16/2018 We have received your application and it is pending. 5/18/2018 You have proved your identity and a diary number has been created for your application. You can see the diary number at the top of the page. Your application has been placed in the processing queue. We will contact you if we need more information from you. Our processing times can be found on our website at www.migri.fi 11/22/2018 The Employment and Economic Development Office has made a partial decision on your application. Your application is now in queue for processing at the Finnish Immigration Service. We will contact you if we need additional information. See our website for processing times. 11/22/2018 Your application is waiting for your reply to a request for supplementary information. 11/22/2018 You have replied to a request for supplementary information. 11/23/2018 A decision has been made on your application. 11/23/2018 The decision can be read on your user account. 11/23/2018 You have received the decision.<p>", "content": "So I applied for a work permit last July 2017. And I was very nervous about how long will it take, what papers do I need .. etc. And unfortunately, there isn't a lot of information online from other people who went through the same thing. So after being informed that I was granted the permit, I want to put the whole thing here for anyone who might need or want to know the whole process from start to end. - I came to Finland for an internship for 6 months, and for that, I needed a temporary work permit. I won't discuss this here as I don't remember most of it . - Then after the internship ended, the company offered me a permanent contract to apply for a new work permit. - The company advised me to apply for \"special expert\" work permit because I am a university graduate. On the website, it says: You may be considered to be a specialist if: your work tasks are demanding and require university studies. your salary is higher than average, at least approximately 3,000 euro gross pay per month. FYI: my salary is below 3000 euro. -for the papers, I had to submit online copy of valid passport employment contract degree certificate in addition to that, there were some papers that the company must provide. Finally, this is my enterFinland log that I used to check everyday 1/20/2017 A customer number has been created for you. You can see your customer number at the top of the page. 7/7/2017 We have received the processing fee for your application. 7/7/2017 We have received your application and it is pending. 7/11/2017 You have proved your identity and a diary number has been created for your application. You can see the diary number at the top of the page. Your application has been placed in the processing queue. We will contact you if we need more information from you. Our processing times can be found on our website at http://www.migri.fi 7/18/2017 You have sent additional information for the application. We have received it. The documents you sent are displayed in the application information. 8/18/2017 The Employment and Economic Development Office has made a partial decision on your application. Your application is now in queue for processing at the Finnish Immigration Service. We will contact you if we need additional information. See our website for processing times. 10/3/2017 The processing of your application has started. Contacting us does not speed up the processing of the application. If we need further information from you, we will send you a request through this service. 10/4/2017 A decision has been made on your application. 10/4/2017 The decision can be read on your user account. 10/4/2017 You have received the decision if you have any questions, don't hesitate.", "time": "Wed Oct 04, 2017 10:09 am", "type": "forum"}
{"title": "Northern Irish man (UK citizenship) looking to move to oulu for work and my new girl", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97634&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Ummm hey everyone, new to the forum but I've seen alot of people get help and great advise on here but none that really relates to me and I need help so bad. I think I'm the same as most of the Brits on here who has a Finnish girlfriend but unfortunately I have only been dating her for a week now yet been in finland 4 times in the last 2 years. I'm a chef in full time employment and have been for just over 3 years with a gap between working in retail for 2 years. I have been doing my basic chef degree and wonder would that been enough plus my experience to possibly land me a job somewhere? I have looked up chef jobs and seems there our plenty but do ask for a degree. Also another issue I feel I may face is I dont speak any Finnish but willing to study it in classes. What I'm trying to find out is what all would I need to move there and what way to go about it as I'm quite confused with the matter. (please help)<p><p>As for staying and legally residing, see: https://migri.fi/en/i-want-to-apply You will need \"hygieniapassi\" in order to work in a restaurant kitchen: https://hygieniapassi.fi/english If I was you, in addition to what job postings are available, I'd contact restaurants directly and see if that way there would be an opening. Even if for a shorter period, it will still work a lot in your favor for getting the next job. Polish your CV (whilst remaining honest), the most you can lose is a little bit of effort.<p><p>Thank you, I will look into the getting in contact with job directly. But with the hygiene pass do I need a Finnish one or would mine from Britain be valid?<p><p>You would need a Finnish one<p><p>Bofore doing any move familarise yourself with the salary levels in the service industry. Also note that tips are not common in Finland unless you are working for high-end restaurants...<p>", "content": "Ummm hey everyone, new to the forum but I've seen alot of people get help and great advise on here but none that really relates to me and I need help so bad. I think I'm the same as most of the Brits on here who has a Finnish girlfriend but unfortunately I have only been dating her for a week now yet been in finland 4 times in the last 2 years. I'm a chef in full time employment and have been for just over 3 years with a gap between working in retail for 2 years. I have been doing my basic chef degree and wonder would that been enough plus my experience to possibly land me a job somewhere? I have looked up chef jobs and seems there our plenty but do ask for a degree. Also another issue I feel I may face is I dont speak any Finnish but willing to study it in classes. What I'm trying to find out is what all would I need to move there and what way to go about it as I'm quite confused with the matter. (please help)", "time": " Sat Nov 24, 2018 4:21 am", "type": "forum"}
{"title": "Residence permit of a spouse  Finnish citizen", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97604&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello everybody I am waiting for my husband.7 months of waiting.I am the fifth month of pregnancy .I am very weak I have iron deficiency in the blood .The heartbeat is irregular Last week they sent me questions and ask for an appointment with my husband Are we still waiting for so much? I'm afraid of a negative decision<p><p>9 months is the norm.<p><p>Nina been married plus pregnancy, your husband got a strong case in the eyes of migri or the law. I see no reason for rejection, you just need to update migri on the pregnancy and any new development. Good luck.<p><p>thank youuu .I sent them a paper doctor that I was sick<p>", "content": "Hello everybody I am waiting for my husband.7 months of waiting.I am the fifth month of pregnancy .I am very weak I have iron deficiency in the blood .The heartbeat is irregular Last week they sent me questions and ask for an appointment with my husband Are we still waiting for so much? I'm afraid of a negative decision", "time": "Fri Nov 16, 2018 11:18 pm", "type": "forum"}
{"title": "Job and resident permit", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97629&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Resident permit can't be granted without job ? Finish companies are favorable to offer job who is already in Finland. So how can anyone outside of EU countries can get RP ? Te office required bank code or mobile registration Without this one cannot register in TE office. So how can one get job ? Most of the time finish companies don't answer emails So I am not able to know actually were is the problem I am product inventor, with few patents. I could be useful for product development companies, research universities etc. I am trying to get in touch with local individual who can help but could not find anyone. Some help appriciated.<p><p>Milindkulkarni wrote: ↑Thu Nov 22, 2018 4:29 pm Resident permit can't be granted without job ? Depends on what you're basing the residence permit application on. If it's work, and if you don't have any, kind of makes sense that you're not eligible for a permit, right? It is stated in the law - stemming from EU - that EU residents come first. It is possible to hire from outside EU, but that requires the employer to prove that no suitable candidates weren't available from within the EU. With the extra hassle it involves, obviously you will have to have something beyond ordinary to offer to get that treatment. As for getting a job, your previous experience matters, so get your CV in order. Create a profile in LinkedIn, unless you already have one, and see what's available there. Many jobs go through acquaintances, a good word from someone the employer knows (i.e. trusts) goes a long way. Don't let that put you down, however, there are jobs out there if you have the skills - and have something to show for them - that are in demand.<p><p>Germany has job seeker visa, Finland doesn't.<p>", "content": "Resident permit can't be granted without job ? Finish companies are favorable to offer job who is already in Finland. So how can anyone outside of EU countries can get RP ? Te office required bank code or mobile registration Without this one cannot register in TE office. So how can one get job ? Most of the time finish companies don't answer emails So I am not able to know actually were is the problem I am product inventor, with few patents. I could be useful for product development companies, research universities etc. I am trying to get in touch with local individual who can help but could not find anyone. Some help appriciated.", "time": " Thu Nov 22, 2018 4:29 pm", "type": "forum"}
{"title": "Waiting time", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97625&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello Does it always take 9 months for a decision to be made ? Applications based on family ties , finnish spouses ! It has been 6 months now and I didn't hear anything in my country neither did my husband in Finland ! Please share your stories and the processing times ! I know that every application is unique but you all know that 6 months is a very long time to not hear a word :/<p><p>It quite often takes the full 9 months. Don’t expect it sooner but it can come sooner and is a nice surprise then. I have personally for my own family members seen it take progressively longer lately.<p><p>Yes, it can take even more than 9 months if for example they request you for an interview and there is no time at ambassy only after X months... There are some exceptions always but the norm is around 9 months.<p><p>Oh ! Can they make another interview ? I was interviewed at the Embassy the day i proved my identity which was 6 months ago ! But I didn't hear anything ever since , my husband didn't hear anything there as well !<p>", "content": "Hello Does it always take 9 months for a decision to be made ? Applications based on family ties , finnish spouses ! It has been 6 months now and I didn't hear anything in my country neither did my husband in Finland ! Please share your stories and the processing times ! I know that every application is unique but you all know that 6 months is a very long time to not hear a word :/", "time": " Wed Nov 21, 2018 8:26 pm", "type": "forum"}
{"title": "Waiting time for an appeal", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=65555&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi folks, Can someone tell from experience how long it takes nowadays (2012) for a residence permit appeal to be decided? I filed an appeal sometime ago (lost count of how many months ago) n its still pending decision, thanks in advance for all your valuable opinions.<p><p>I submitted mine in june of 2011 and got it approved in april of 2012 just depends on your situation<p><p>Kaarina91 wrote:I submitted mine in june of 2011 and got it approved in april of 2012 just depends on your situation Kaarina91, did you try to contact the court or police while the appeal is being processed? When you submitted the appeal, did you get any estimation for how long the waiting time will be?<p><p>Kaarina91 wrote:I submitted mine in june of 2011 and got it approved in april of 2012 just depends on your situation Anyone else please! Your information will be so helpful to people waiting for the court like me and others. I lodged the appeal in June 2012 but haven't received any response from the court so far. I am running out of patience <p><p>reindeer wrote:Kaarina91 wrote:I submitted mine in june of 2011 and got it approved in april of 2012 just depends on your situation Anyone else please! Your information will be so helpful to people waiting for the court like me and others. I lodged the appeal in June 2012 but haven't received any response from the court so far. I am running out of patience Average processing time for aliens stuff is 9,9 months: http://www.oikeus.fi/9849.htm<p><p>Upphew wrote:reindeer wrote:Kaarina91 wrote:I submitted mine in june of 2011 and got it approved in april of 2012 just depends on your situation Anyone else please! Your information will be so helpful to people waiting for the court like me and others. I lodged the appeal in June 2012 but haven't received any response from the court so far. I am running out of patience Average processing time for aliens stuff is 9,9 months: http://www.oikeus.fi/9849.htm Thanks Upphew for the info but that seems to be for Vaasa Administrative Court only. Any idea about Helsinki?<p><p>reindeer wrote:Upphew wrote:Average processing time for aliens stuff is 9,9 months: http://www.oikeus.fi/9849.htm Thanks Upphew for the info but that seems to be for Vaasa Administrative Court only. Any idea about Helsinki? There is crapload more administrative stuff going on in Helsinki and probably immigrants too. So I would be surprised to hear that they are faster than smaller courts.<p><p>2011 figures Helsinki and Vaasa as a comparison (average waiting time/months): Aliens in general Helsinki 7,8, Vaasa 8,1 Family permits: Helsinki 9,9 Vaasa 8,4 Other residence permits: Helsinki 9,5 Vaasa 7,3 I don't think you should look for more precise answer, the permits are not decided on strict, first appealed, first served basis anyway. There were a small number cases that had been decided in less than 2 months, significant fraction that had got a result in 2-5 months, but also those that took more than a year, plus a few which took over 18 months. http://193.166.171.75/Database/StatFin/ ... ikr_fi.asp<p><p>In the olden days, they use to basically threaten if you contact them it will take longer for your permit to be processed. So don't go contacting them. Just wait.<p><p>While waiting for the court decision, can I make a new application? Will the police precess?<p><p>reindeer wrote:While waiting for the court decision, can I make a new application? Will the police precess? No, they will wait the outcome of the appeal and then reject the application immediately if the appeal is rejected. A flow of continuous applications does not let you stay. That trick is not working.<p><p>If I get negative decision from the court, can I reapply with a new application?<p><p>reindeer wrote:If I get negative decision from the court, can I reapply with a new application? yes, from your home country. When the appeal is denied, you have to leave.<p><p>rinso wrote:reindeer wrote:If I get negative decision from the court, can I reapply with a new application? yes, from your home country. When the appeal is denied, you have to leave. Do we have the link somewhere for the law about this? I know one of my friend who has been rejected by both the administrative and supreme courts then he came to the police, they advised him to reapply and he finally got the RP.<p><p>reindeer wrote:rinso wrote:reindeer wrote:If I get negative decision from the court, can I reapply with a new application? yes, from your home country. When the appeal is denied, you have to leave. Do we have the link somewhere for the law about this? I know one of my friend who has been rejected by both the administrative and supreme courts then he came to the police, they advised him to reapply and he finally got the RP. You can reapply. The difference is that the second time they may issue a refusal of entry/expulsion order, and if necessary enforce it, even while your application is being processed.<p>", "content": "Hi folks, Can someone tell from experience how long it takes nowadays (2012) for a residence permit appeal to be decided? I filed an appeal sometime ago (lost count of how many months ago) n its still pending decision, thanks in advance for all your valuable opinions.", "time": " Mon Sep 03, 2012 6:49 pm", "type": "forum"}
{"title": "Processing time of RP", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97597&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hello Everyone Anywone who applied in May and still waiting for a decision ? I applied on May 20th, proved my identity on May 28th and everytime I check my application online , it is still \" waiting to be processed \" ! My application is based on Family ties, I'm married to a finnish citizen and praying to get a decision before Christmas! I want to spend it with my husband and his family!! Who is going through our same case ?<p><p>Hey , I'm pretty sure that you will hear from them soon maybe in this month and once your application gets to phase 2 then it won't take longer .... just be patient Good luck ✌<p><p>Lastscorpionman wrote: ↑Fri Nov 16, 2018 2:58 pm Hey , I'm pretty sure that you will hear from them soon maybe in this month and once your application gets to phase 2 then it won't take longer .... just be patient Good luck ✌ Ehhh.... No... My wife application goes to phase 2 at 13.7. Still no decision....<p><p>I'm sure they will answer you this month Crossing fingers for my application<p>", "content": "Hello Everyone Anywone who applied in May and still waiting for a decision ? I applied on May 20th, proved my identity on May 28th and everytime I check my application online , it is still \" waiting to be processed \" ! My application is based on Family ties, I'm married to a finnish citizen and praying to get a decision before Christmas! I want to spend it with my husband and his family!! Who is going through our same case ?", "time": " Fri Nov 16, 2018 3:27 am", "type": "forum"}
{"title": "My family is Finland, residence permit base on family ties. I need your candid views or advice please.", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97546&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hei and greetings to all. Basically i am looking for candid advice. I am in Finland with an other schengen country residence permit. I have a child in Finland who is Finnish citizen and we are all living together with the mother of my child, my girlfriend. We are planning to get married but the document from my home country as a bachelor single which can allow us to get married is delayed. So can i apply residence permit in Finland base on guardian of a Finnish citizen or to wait until i got married and apply base on family ties wife and child? What are the advantage or possibly of the strongest case to apply? Thanks looking forward to your honest and positive views. <p><p>Yes you can apply residence permit for a guardian of finnish citizen, if u have paternity confirmed and have a joint custody with you girl friend.. Read more https://www.google.com/url?sa=t&source= ... tvMNzW91EU<p><p>both options are possible, but being married is by far the easiest one.<p><p>You need to be married when the child is born.<p><p>Yes but you would still need to confirm paternity since the child is born outside married<p><p>Ousman wrote: ↑Fri Nov 09, 2018 10:29 am Yes you can apply residence permit for a guardian of finnish citizen, if u have paternity confirmed and have a joint custody with you girl friend.. Read more https://www.google.com/url?sa=t&source= ... tvMNzW91EU Thanks, but kindly to add that both paternity and custody has been confirmed long time. The only delay is the document from my home country. So advice and view base on stronger case, that's guardian or wait till after marriage and apply?<p><p>you can apply for a residence permit based on a guardian of Finnish citizen i think its the best residence permit to apply and will give you stronger ties with Finland<p>", "content": "Hei and greetings to all. Basically i am looking for candid advice. I am in Finland with an other schengen country residence permit. I have a child in Finland who is Finnish citizen and we are all living together with the mother of my child, my girlfriend. We are planning to get married but the document from my home country as a bachelor single which can allow us to get married is delayed. So can i apply residence permit in Finland base on guardian of a Finnish citizen or to wait until i got married and apply base on family ties wife and child? What are the advantage or possibly of the strongest case to apply? Thanks looking forward to your honest and positive views. ", "time": " Sat Nov 03, 2018 1:02 am", "type": "forum"}
{"title": "What is \"Response to possible refusal of entry\" in MP_1 form in Residence Permit application", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97591&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi All I am a Finnish citizen and my wife is about to apply for her first residence permit in Finland. English isn't my native language unfortunately, so I can't quite understand the questions in the MP_1 form. - Are you opposed to your refusal of entry and prohibition of entry? - Is a family member of yours residing in Finland opposed to your refusal of entry and prohibition of entry? - Are you opposed to your visa being cancelled? What do these questions mean? :/ Do they want to know if the family is going to be disappointed in case of rejection? - Yes, but that is obvious, isn't it? Or do they want to know what we are going to do in case of rejection? Something like \"Husband will probably have to quit his Finnish job and family is going to leave Finland in grief\"? P.S. This form - https://migri.fi/documents/5202425/5790 ... 8en%29.pdf<p><p>_doctor wrote: ↑Wed Nov 14, 2018 7:14 pmEnglish isn't my native language unfortunately, so I can't quite understand the questions in the MP_1 form. Here's the form in Finnish https://migri.fi/documents/5202425/6287 ... 8fi%29.pdf<p><p>Finnish isn't my native either (though I speak some). Anyways what words mean seem to be clear, but what they actually want to know isn't :/ Or maybe I misunderstand things and everything is much simpler? Do they just want how we'll react to possible refusal as in \"do you have any other country to go to?\"?<p><p>I cannot tell you what to answer, but I can tell you that you're over-complicating it. That section is just to make it theoretically easier to deport you in case your application is denied.<p><p>_doctor wrote: ↑Thu Nov 15, 2018 3:47 pm Finnish isn't my native either (though I speak some). Anyways what words mean seem to be clear, but what they actually want to know isn't :/ The truth. If you don't know, you can say so.<p><p>_doctor wrote: ↑Wed Nov 14, 2018 7:14 pm Or do they want to know what we are going to do in case of rejection? Yes, that's exactly what they're asking. Why and what possible implications any answer in any situation may bring, I have no idea.<p><p>Thank you, guys! Seems clear enough now.<p>", "content": "Hi All I am a Finnish citizen and my wife is about to apply for her first residence permit in Finland. English isn't my native language unfortunately, so I can't quite understand the questions in the MP_1 form. - Are you opposed to your refusal of entry and prohibition of entry? - Is a family member of yours residing in Finland opposed to your refusal of entry and prohibition of entry? - Are you opposed to your visa being cancelled? What do these questions mean? :/ Do they want to know if the family is going to be disappointed in case of rejection? - Yes, but that is obvious, isn't it? Or do they want to know what we are going to do in case of rejection? Something like \"Husband will probably have to quit his Finnish job and family is going to leave Finland in grief\"? P.S. This form - https://migri.fi/documents/5202425/5790 ... 8en%29.pdf", "time": " Wed Nov 14, 2018 7:14 pm", "type": "forum"}
{"title": "Applying for RP before coming to Finland, but receiving it in Finland", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97587&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>Hi All I am a Finnish Citizen, my wife is a Russian citizen with an active visa, our common infant daughter is a Finnish citizen. We are about to move to Finland in a couple of weeks and wait for RP for the wife in Finland. - Is it a good idea to submit application for residence permit on enterfinland.fi already now (to get RP a couple of weeks earlier) yet validate the identity already in Finland at migri.fi point? - Has anybody tried it? And since we both do not live in Finland yet, would it work if I put my employer address as a contact address (employer won't mind).<p><p>_doctor wrote: ↑Wed Nov 14, 2018 12:40 pm Hi All I am a Finnish Citizen, my wife is a Russian citizen with an active visa, our common infant daughter is a Finnish citizen. We are about to move to Finland in a couple of weeks and wait for RP for the wife in Finland. - Is it a good idea to submit application for residence permit on enterfinland.fi already now (to get RP a couple of weeks earlier) yet validate the identity already in Finland at migri.fi point? - Has anybody tried it? And since we both do not live in Finland yet, would it work if I put my employer address as a contact address (employer won't mind). 1. I think you can do that. Submit application to book an appointment first, and when you are in Finland already, then you can identify your wife's ID. Just make sure that you brings all the requirements! Because once you have identified yourself, they will give you a paper that says \"you are not allowed to go abroad while waiting for the decision\". RP will be proccessed when you have visited migri and identified yourself. So just sit, and wait. Just remember, everyone case is unique. In my case, I received positive decision in less than a week. 2. About the address, I'm not sure about that. Since there will be a question about where do you guys live. But you can always contact migri about it. They will reply your email!<p><p> \"you are not allowed to go abroad while waiting for the decision\" Oh?! Is it so indeed? We actually were going to travel out-in Finland while her visa is active (then she certainly would have to stay within Finland). 2. About the address, I'm not sure about that. Since there will be a question about where do you guys live. But you can always contact migri about it. They will reply your email! We will live in Finland, just don't have a permanent apartment yet. I'll try asking migri, thanks!<p><p>_doctor wrote: ↑Wed Nov 14, 2018 1:25 pm \"you are not allowed to go abroad while waiting for the decision\" Oh?! Is it so indeed? We actually were going to travel out-in Finland while her visa is active (then she certainly would have to stay within Finland). 2. About the address, I'm not sure about that. Since there will be a question about where do you guys live. But you can always contact migri about it. They will reply your email! We will live in Finland, just don't have a permanent apartment yet. I'll try asking migri, thanks! If her schengen visa is still active, I think you can only travel within schengen countries but not outside schengen areas because she may need a visa to be able to go back to Finland If she is travelling outside schengen areas. Migri will reccommend you to stay in Finland while waiting for the decision though. At least, that's what they told me. About the permanent apartement, I'm living with my husband in an apartement, and he is just renting it, but he has been living here for at least 5 years. And yes, I put his apartement address and migri is okay with it. As long as you put her name on your mailbox as well.<p><p>Once you selected the service point as the embassy, you can only receive the card there, not in Finland.<p><p>tavastia wrote: ↑Thu Nov 15, 2018 3:42 pm Once you selected the service point as the embassy, you can only receive the card there, not in Finland. Good advice. OP needs to make sure that he chooses a migri service point anywhere in Finland and If he doesn't have finnish bank, pay directly at migri.<p>", "content": "Hi All I am a Finnish Citizen, my wife is a Russian citizen with an active visa, our common infant daughter is a Finnish citizen. We are about to move to Finland in a couple of weeks and wait for RP for the wife in Finland. - Is it a good idea to submit application for residence permit on enterfinland.fi already now (to get RP a couple of weeks earlier) yet validate the identity already in Finland at migri.fi point? - Has anybody tried it? And since we both do not live in Finland yet, would it work if I put my employer address as a contact address (employer won't mind).", "time": "Wed Nov 14, 2018 12:40 pm", "type": "forum"}
{"title": "Problem with posti", "url": "https://www.finlandforum.org/viewtopic.php?f=2&t=97589&sid=9585c3dbb627171facd7618ff938494e", "review": "<p>So, Migri contacted me about the card that they have sent it to our address but got returned as UNKNOWN by posti. The address is correct, we have my name on our mailbox, so I dunno what's wrong with Posti? This is not my first problem with posti. Neuvola sent me a letter for the first time, but It never showed up, and I know exactly that It was our mistake since we didn't have my name on our mailbox at the time since I have just moved to Finland, but now we have it and It's been there for two months and still never received anything anymore from Neuvola because the nurse asked me again If I have received some other letters from Neuvola, and ofc I said \"NO\". And now I have a problem again with Posti unable to send RP card and just returned it to migri as UNKNOWN. Anyone has similar experince? I'm quite dissapointed with it since I cannot track it. <p><p>Whenever there's something that you absolutely have to have, especially in a timely manner, use Posti only if there's no other alternative. Their service is all over the place, I just received a postcard three working days later than a friend of mine, sent from the same place at the same time, and we live ~500m from each other.<p><p>FinnGuyHelsinki wrote: ↑Wed Nov 14, 2018 3:51 pm Whenever there's something that you absolutely have to have, especially in a timely manner, use Posti only if there's no other alternative. Their service is all over the place, I just received a postcard three working days later than a friend of mine, sent from the same place at the same time, and we live ~500m from each other. The thing is the sender uses posti's service and I cannot complain about it because It's letters from the govermental office and posti is all over the place and easy to find and whatnot. But seriously, I'm getting quite frustrated about this delivery problems I have had. <p><p>KattyTheKitty wrote: ↑Wed Nov 14, 2018 4:18 pm The thing is the sender uses posti's service and I cannot complain about it because It's letters from the govermental office and posti is all over the place and easy to find and whatnot. But seriously, I'm getting quite frustrated about this delivery problems I have had. By \"all over the place\" I meant that their service doesn't work as one could expect, wasn't referring to the abundance of their offices. I don't know about residency permit cards, but at least for some documents applied from the police it's possible to pick them up in person from the police station.<p><p>They are shocking thesedays. They never bother even trying to deliver packages. Just straight to the post office and never the closest smartpost you specify as preferred. Then you may or may not get a text, email or card through the door. They only deliver about 3 days a week. But they'll constantly post advertising.<p><p>irnbru wrote: ↑Thu Nov 15, 2018 8:43 am They are shocking thesedays. They never bother even trying to deliver packages. Just straight to the post office and never the closest smartpost you specify as preferred. Then you may or may not get a text, email or card through the door. They only deliver about 3 days a week. But they'll constantly post advertising. Regarding the text message notifications, with some mobile subcsriptions Posti and Matkahuolto notifications may not come through (while DHL and some others work fine). That's especially bad if one tries to use SmartPost, as the opening code is delivered via SMS and Posti is reluctant to give it any other way. I don't know whether the issue is with the operator or at the sending end. I and some ex-colleagues of mine had this with company paid Elisa subscriptions, nowadays I have Elisa (new subscription, same number) paid by my current employer without the same issue.<p><p>irnbru wrote: ↑Thu Nov 15, 2018 8:43 am They are shocking thesedays. They never bother even trying to deliver packages. Just straight to the post office and never the closest smartpost you specify as preferred. Then you may or may not get a text, email or card through the door. They only deliver about 3 days a week. But they'll constantly post advertising. Migri send the RP card as unregistered letter which means you won't get any tracking number or a text message when the card has arrived. I was quite shocked that posti had really terrible service (I thought delivery service in my home country was quite bad, but posti is beyond me! lol). They keep sending us those advertising, but reluctant to send me my card. how nice. <p><p>FinnGuyHelsinki wrote: ↑Thu Nov 15, 2018 9:25 am irnbru wrote: ↑Thu Nov 15, 2018 8:43 am They are shocking thesedays. They never bother even trying to deliver packages. Just straight to the post office and never the closest smartpost you specify as preferred. Then you may or may not get a text, email or card through the door. They only deliver about 3 days a week. But they'll constantly post advertising. Regarding the text message notifications, with some mobile subcsriptions Posti and Matkahuolto notifications may not come through (while DHL and some others work fine). That's especially bad if one tries to use SmartPost, as the opening code is delivered via SMS and Posti is reluctant to give it any other way. I don't know whether the issue is with the operator or at the sending end. I and some ex-colleagues of mine had this with company paid Elisa subscriptions, nowadays I have Elisa (new subscription, same number) paid by my current employer without the same issue. [/quote If I had options, I would ask migri to send it via another post delivery service. My card hasn't arrived, got returned to migri and migri got a note with \"UNKNOWN\". While I'm here waiting for it. Posti thinks I don't exist. lol<p>", "content": "So, Migri contacted me about the card that they have sent it to our address but got returned as UNKNOWN by posti. The address is correct, we have my name on our mailbox, so I dunno what's wrong with Posti? This is not my first problem with posti. Neuvola sent me a letter for the first time, but It never showed up, and I know exactly that It was our mistake since we didn't have my name on our mailbox at the time since I have just moved to Finland, but now we have it and It's been there for two months and still never received anything anymore from Neuvola because the nurse asked me again If I have received some other letters from Neuvola, and ofc I said \"NO\". And now I have a problem again with Posti unable to send RP card and just returned it to migri as UNKNOWN. Anyone has similar experince? I'm quite dissapointed with it since I cannot track it. ", "time": " Wed Nov 14, 2018 3:30 pm", "type": "forum"}
