{"title": "Finland’s heavy-metal stars reveal their lighter side at Christmas - thisisFINLAND", "url": "https://finland.fi/christmas/finlands-heavy-metal-stars-reveal-their-lighter-side-at-christmas/", "review": "", "content": "<p>In fact, Finnish heavy metal music has found inspiration in Christmas festivities for many years and in multiple ways.<p><p>When you peek behind the doom-laden metal-head personas and ask musicians to reflect on the season of goodwill, they happily admit to how much they enjoy it.<p><p>When you’re on the road as often as Tarja Turunen is, the best possible Christmas present is to spend time at home.Photo: Eugenio Mazzinghi<p><p>“For me the real Christmas feeling comes from the snow, quietness and peaceful environment that you get in Finland,” says Tarja Turunen, singer, songwriter and former lead vocalist of symphonic metal band Nightwish. “Fireworks and such don’t really suit my Christmas mood.”<p><p>Nevertheless, Turunen’s Christmas also has a metallic hue, because she is part of the band Raskasta Joulua (Heavy Christmas). It is a supergroup collective with regular and occasional members who create heavified versions of well-known Finnish Christmas carols.<p><p>However, when it comes to Christmas music at home Turunen prefers the traditional carols. “I like classical Christmas songs, also orchestral works, because you can truly relax as they play in the background. My favourite Finnish Christmas song is ‘Varpunen Jouluaamuna’ (Sparrow on Christmas Morning) and ‘I Love Walking in the Air’ from the Snowman cartoon [a British creation that also became popular in Finland].”<p><p>When you’re on tour almost until Santa’s big day, as Turunen is with Raskasta Joulua, the best possible Christmas present is to spend time at home. She says she loves to bake and prepare holiday food together with her daughter.<p><p>Noora Louhimo (front) sings about pain, death and hell with Battle Beast, but appreciates the peaceful Christmas season so much that she starts decorating in November, to make it last longer.Photo: Battle Beast<p><p>For Noora Louhimo, lead singer of the heavy metal band Battle Beast, the earlier the festive season starts, the better. “I start decorating in November, because that way I can make Christmas last longer,” she says.<p><p>The antithesis of what Santa symbolises, Battle Beast has released four albums since 2005. But the global touring and heavy workload have turned the imposing frontwoman into one big Christmas softie: “Now more than ever before, I just want to be with my loved ones during Christmas. My work is so hectic that I like to keep it very simple and minimalistic during the Christmas season. I just like to stay at home.”<p><p>Singing about pain, death and hell for most of the year would take a toll on anyone, so it’s no surprise that Louhimo uses the festive season to destress and recharge her batteries. “I also like walking in nature, but it’s not the same if there’s no snow at Christmas.”<p><p>Let’s hope that snowflakes drift down to deliver the soothing visuals that this metal singer longs for.<p><p>Timo Kotipelto (centre), shown here with the other members of power metal band Stratovarius, visits with family and friends during the Christmas season for traditional food, quality time and board games.Photo: Stratovarius<p><p>Traditional food, quality time and board games sum up Timo Kotipelto’s Christmas. The lead vocalist of the power metal band Stratovarius usually visits his parents for Christmas, along with the other family members. “We don’t really buy gifts for each other, except for the children,” says Kotipelto. “I try to help out with the preparations or make people smile with my stupid sense of humour.”<p><p>Stratovarius is one of Finland’s oldest metal bands and among the most influential in the power metal genre, with 15 studio albums and 5 live albums. Kotipelto wrote several of Stratovarius’s songs in his hometown, Lappajärvi, in western central Finland. The place brings back fond memories. “When I was younger, I made a gingerbread house with my brother,” he says. “As far as I remember, it wasn’t the most beautiful of houses, but it tasted good!”<p><p>Jyrki Linnankivi, better known as Jyrki69, is lead singer of gothic rock band The 69 Eyes. We think he’s the one dressed in red in this band photo.Photo: Ville Juurikkala<p><p>Better known as Jyrki69, Jyrki Linnankivi is the lead singer of Finnish gothic rock band The 69 Eyes. He has gingerbread memories of his own.<p><p>“Once our band took part in a celebrity gingerbread house competition,” says Linnankivi. “We made a haunted house with bats in it.” He says he loves to listen to Christmas carols in the sauna. The 69 Eyes have been playing together since the summer of 1989, and at the time of writing are working on their 12th album.<p><p>By Carina Chela, December 2018<p><p>Timo Rautiainen of Trio Niskalaukaus heavy-metal fame (right) and Johanna Försti (left) are the guest singers on a Christmas album by the fabulous Finnish fiddle band Frigg.Photo: Antti Vuorenmaa<p><p>Strangely enough, one of the newest recordings of a metal star singing Christmas music is found on an album by Frigg, a world-famous Finnish group of folk fiddlers. Named after a Norse goddess, the band is putting out an album of seasonal tunes appropriately entitled Joululaulut (Christmas Songs).<p><p>Timo Rautiainen, who first gained fame on the heavy metal scene with the band Trio Niskalaukaus, is one of the guest singers on the recording. “I do some folk music myself, and I’m a big Frigg fan,” says Rautiainen in the Joululaulut press release, “so it’s an honour to participate in this project. The album is an intriguing blend of new and old, performed in an unusual manner.”<p><p>– Box text by Peter Marten, December 2018<p><p> <p><p>Tarja Turunen: Metallic moods with softer hues<p><p>Noora Louhimo: Snowflakes soothe the pain<p><p>Timo Kotipelto: Gingerbread memories<p><p>Jyrki Linnankivi: Haunting Christmas<p><p>Timo Rautiainen sits in with Frigg<p>", "time": "2018-12-18T09:19:15+00:00", "type": "christmas"}
{"title": "The Finland emojis take off on Christmas adventures - thisisFINLAND", "url": "https://finland.fi/christmas/christmas2018/", "review": "", "content": "<p>They show the adventures of the Finland emojis, especially Baby in a Box and the legendary phone called Unbreakable.<p><p>And while these films are for kids, we bet grown-ups will enjoy them, too!<p><p>“Baby in a Box” refers to the maternity package, a box of baby clothes, care items and accessories sent to every new family in Finland to give the child a good start and help parents grow into their role. The box itself is designed to serve as a crib during the early months.<p><p>“Unbreakable” is an old-school Nokia 3310 phone, famously sturdy and now surrounded by an aura of nostalgia. You don’t have to be very old to remember playing games such as Snake on that tiny green screen.<p><p><p><p>Baby in a Box and Unbreakable help a swan who gets distracted by the Northern Lights and crashes into the bell tower of Helsinki Cathedral.<p><p>Who’s in this video: The swan is Finland’s national bird, so of course it has its own emoji (and swans just might be cuter than cats). And Finland is *the* place to experience the spectacular dance of Aurora Borealis, the Northern Lights. You usually get the best views up north, but you can sometimes catch them in southern Finland, too.<p><p><p><p>Hey, bear! You can’t take your long winter’s nap in the middle of the road! That could be dangerous!<p><p>Who’s in this video: Bears hibernate, sleeping the winter away – sometimes when it’s cold and dark outside, you feel they might be right!<p><p><p><p>What happens when two Finnish horses are playing ice hockey on a frozen lake and lose the puck? How will they get it back? And how does an ermine become involved?<p><p>Who’s in this video: Strong and stubborn, the Finnish horse is a trusted friend that has been a reliable companion in work and play for centuries. Of course Finnish horses know how to play ice hockey!<p><p><p><p>How can Santa Claus take off from northern Finland to deliver presents to everyone, if Rudolph’s bright red nose has a short-circuit?<p><p>Who’s in this video: The original Santa Claus, the one and only, comes from Finland, and makes his home in Korvatunturi, up north in Finnish Lapland, where there are lots of reindeer.<p><p>By ThisisFINLAND staff, November 2018<p><p>About our heroes<p><p>A swan is dazzled by the Northern Lights<p><p>A long winter’s nap<p><p>Playing pond hockey: Who’s got the puck?<p><p>Helping Santa deliver the presents<p>", "time": "2018-11-29T08:39:01+00:00", "type": "christmas"}
{"title": "Finland’s ambassador of Christmas - thisisFINLAND", "url": "https://finland.fi/christmas/the-ambassador-of-christmas/", "review": "", "content": "<p>Santa Claus is the great hero of the Finnish holiday season. As just about everyone knows, he lives in northern Finland and helps spread the joy of Christmas all over the world.<p><p>Korvatunturi, the mountain in Finnish Lapland where Santa Claus makes his home, lies 1000 kilometres north of the capital, Helsinki. He lives there with his wife and hundreds of elves. From the top of Korvatunturi, they can hear the Christmas wishes of all the children in the world.<p><p>For Finnish kids, the countdown to Christmas begins during Advent, when the streets are decorated. Children and adults alike have fun opening windows on Advent calendars, one window a day until Christmas Eve. Usually the windows reveal light-hearted Christmas pictures, although the flaps sometimes conceal chocolate or other small gifts.<p><p>During Advent – and other times of year as well – Santa may have time to appear and spread Christmas cheer in towns around Finland and beyond. People often ask him about the elves he works with, and in warmer countries folks also want to know about reindeer – and snow.<p><p>At home in Finnish Lapland: Kids in warm countries often ask Santa about cold weather and snow.Antti Aimo-Koivisto/Lehtikuva<p><p>There’s lots of snow in Finnish Lapland from November until late spring – sometimes even until May. How does Santa answer people’s snow questions? He does his best to describe snow and cold.<p><p>Snow is a white, flaky substance composed of ice crystals. You can make it into snowmen, snow castles, snowballs and snow sculptures. And when snowflakes float dreamily through the air to the ground, that’s a beautiful winter day.<p><p>Temperatures may drop below -30 degrees Celsius, so the snow crunches beneath your feet as you walk and the joints of the log houses creak. But, surprisingly, compared with southern Finland, Lapland doesn’t feel so cold. The frozen sea of the south and the snowy fells of the north make the cold feel different.<p><p>Snow makes it easy for Santa to transport the presents. He glides lightly over the snow in a sleigh drawn by prancing reindeer, with Rudolph in the lead.<p><p>Santa’s most famous reindeer is Rudolph the red-nosed reindeer, of course. But Santa could never make the journeys to every home in the world with only one reindeer, so Rudolph is just one of many.<p><p>Energy boost: Santa feeds tasty lichen to two of the many reindeer that help transport the presents.Photo: Kacper Pempel/Lehtikuva<p><p>All of the working reindeer are males that weigh around 100 kilograms each. They’re strong enough to pull Santa Claus and a sleigh full of presents over long distances. Rudolph is especially important because his red nose provides light on the dark yuletide evenings when Santa has to travel.<p><p>Reindeer calves are born in the late spring weighing about five kilograms. They grow very quickly, feeding on lichen. In the autumn, they eat the tasty mushrooms that grow on the northern Finnish fells.<p><p>Tourists who visit Lapland can experience a ride in a reindeer-drawn sleigh. It’s a lot of fun when the snow whirls up as the reindeer pull you along.<p><p>Santa lives a peaceful existence at home when not delivering presents or making public speaking appearances. He, Mrs Claus and the elves eat a lot of salmon, porridge and tasty local berries.<p><p>The Clauses are not the only ones who have benefited from help from elves over the years. The tradition of household elves goes back to ancient times, more than 2,000 years ago. The household elf has always been the guardian spirit that protects the home, secretly or quietly.<p><p>In Finland, such elves have always protected and assisted the inhabitants of country dwellings. They heated saunas, tended the children and saw to the grain, the cattle and the horses in the stable. They were best friends with the dogs and cats. Elves were also very attached to the old buildings in which they lived.<p><p>People appreciate elves and give them food in return for their services. In many homes a bowl of rice porridge is put aside on Christmas Eve, and strangely enough, it’s always empty in the morning.<p><p>By Sinikka Salokorpi<p><p>The glow of snow and cold<p><p>Our friends the reindeer<p><p>At home with the elves<p>", "time": "2017-12-19T22:00:00+00:00", "type": "christmas"}
{"title": "My first Finnish Christmas: Cold but cosy - thisisFINLAND", "url": "https://finland.fi/christmas/my-first-finnish-christmas-cold-but-cosy/", "review": "", "content": "<p>An Englishman who has lived in Helsinki for decades recalls the magic of his first Christmas in Finland.<p><p>For most Europeans, Christmas is still firmly a family affair involving all the traditional pleasures as well as pressures: outreaches to distant relatives, extensive purchasing of gifts, strenuous travel and often strained relations.<p><p>For Finns, geography imposes certain constraints, not least the weather, but for many visitors these are as exotic as they are extreme. Despite the documented rise in temperatures over the last 40 years the average for Helsinki between December and February is still four degrees Celsius below zero (25 degrees Fahrenheit), and the chances of a white Christmas in the capital are given as 60 percent.<p><p>Some Finns decorate their yards with ice lanterns. You let a bucket of water freeze partway then pour out the excess, leaving a hollow space for the candle. Photo: Pekka Sakki/Lehtikuva<p><p>There is a steady movement of the Finnish population from rural municipalities, and particularly to the capital Helsinki, but the Christmas period sees a complete reversal of the flow. Despite the increasingly urban population structure, the option to revert to family tracts and traditions is irresistible, making for a very quiet capital during the holiday period.<p><p>Long-term Helsinki resident Charles Gil is typical of the generation who live their daily lives in the city centre, but flee to the forests for respite at Christmas: “Before our children were born we spent one Christmas here, but the city was very quiet indeed. We have been at my mother-in-law’s every time since then.” Despite the relaxation of many old restrictions on bars and entertainment, the streets are very empty for the public holiday.<p><p>The experience of my first winter season in Finland, in the mid-1980s, is seared into my memory on account of its uniqueness. Our group of five foreigners from Germany, France and the UK had rented a winter break from a brochure: a cottage by the lake in Ruokolahti, a community on the eastern edge of the country, near the border of what was then the Soviet Union.<p><p>The owners had never had rental visitors over Christmas before, but the building was well insulated against the outside temperature of 20 degrees Celsius below zero (four degrees Fahrenheit below zero), and the family made a great effort to accommodate us. They collected us and our rucksacks and skis from the nearest station, tolerated our efforts to communicate in rudimentary Finnish and, most spectacularly, they had decorated the cottage for our arrival with twinkling outdoor ice lanterns and a roaring fire in the fireplace.<p><p>The manager and owner was a farmer, and he was determined to instruct these gormless townies in the local ways – and in Finnish. Raising water daily from the hole cut in the lake went fine, as long as we remembered to cover the hole each time to stop too thick a layer of ice from forming. Accompanying him on his rounds to check the winter fishing nets, spread between holes bored through the ice, was chilly but very satisfying – there were always some fish.<p><p>A ski trip across a frozen lake becomes a treasured memory. Photo: Ismo Pekkarinen/Lehtikuva<p><p>A greater challenge arrived when he presented us with a catch from one of those nets, a one-and-a-half-kilo (three-pound) burbot. The species forms a common fish in northern waters, related to cod in genus and taste, but possesses an extremely slimy and slippery skin that must be peeled off before cooking. We didn’t understand his instructions very well, but with the help of many hands the fish was skinned, cooked and enjoyed.<p><p>Equally memorable was the ski trip that two of us made through the hazy dusk, five or six kilometres across the lake in a mild snowstorm to the historic Ruokolahti Church, a beautiful 150-year-old wooden building, filled to bursting with the Christmas Eve congregation.<p><p>Facilities for visitors to Finland during Christmas have boomed since those days, with ski centres in Finnish Lapland offering ranges of holidays from hotel to chalet. Arrangements and prices vary, but traditional Christmas weather represents the norm for virtually the whole country.<p><p>By Anthony Shaw<p><p>Flight to the countryside<p><p>Tussling with the elements<p>", "time": "2017-12-18T22:00:00+00:00", "type": "christmas"}
{"title": "Exclusive interview: Mrs Claus of Korvatunturi, Finland - thisisFINLAND", "url": "https://finland.fi/christmas/exclusive-interview-mrs-claus/", "review": "", "content": "<p><p><p> <p><p>Santa and his wife, Mrs Claus, have a hectic schedule, but we pulled a few strings and managed to get an interview with Mrs Claus about life at Korvatunturi, their home in Finnish Lapland.<p><p>Whenever children – or adults for that matter – have a chance to meet Santa Claus, their heads are packed with questions they’ve always wanted to ask. But the excitement of the moment usually makes them nervous, leaving them with only one thought: “What was it I wanted to ask?” And so the questions go unanswered.<p><p>Side by side with every great man is a great woman. Through our extensive Finnish contact network we managed to obtain a rare interview with Mrs Claus about Santa, the elves and the gift delivery process.<p><p>Read on to find out if Santa is ever in a bad mood, if you can get work as an elf, if Santa has ever got stuck in a chimney, and much more!<p><p>Click or scroll below to find out how Mrs Claus answers:<p><p><p><p>Santa and one of his reindeer pause from a workout to pose for a photo.Photo: Bob Strong/Lehtikuva<p><p>1. How old is Santa Claus? <p><p>That’s something not even he can remember exactly. Once when he was sitting in his favourite rocking chair in front of the fireplace at Korvatunturi, the mountain in Finnish Lapland where our home is, he began to count how many Christmases he could remember. But when he got to something like 364, he fell asleep.<p><p>2. Does Santa Claus have a family? Of course! Everyone in the world is his family. Adults and children are equally precious to him.<p><p>3. Can people visit Korvatunturi? Of course they can, if they know how to get there. But it’s a long and difficult journey. And everyone gives different directions. But you have to turn left after the little spruce tree, or if you’re coming from the west along the narrow path, then you should turn right, that is, if you have passed Spruce Pond already.<p><p>4. Does Santa Claus have to be good? Santa Claus is always good. Sometimes he has to be strict, but he is always fair. Sometimes he’s a little angry, sad or upset. He gets really upset if he hears about places in the world where they don’t care for children’s well-being.<p><p>Fishing is one of Santa’s hobbies, but he never catches anything. Here he’s on vacation in the “deep south”, Helsinki, last June.Photo: Martti Kainulainen/Lehtikuva<p><p>5. What does Santa Claus think about the way people celebrate Christmas in different cultures? Every culture has its own customs that deserve to be respected, and that’s just what Santa Claus does.<p><p>6. Was Santa Claus ever a child, and did he go to school? Santa Claus still feels like a child to this day. Life has been one long education for him. You have to keep studying because the world’s always changing. He’s gone to a lot of schools. Once he even visited an elementary school.<p><p>7. How tall is Santa? It depends on whether he is walking deep in thought, or if he is examining little berry branches on the floor of the forest, or if he is looking at the horizon. He’s taller than the tallest elf, but shorter than the old spruce trees in Lapland.<p><p>8. What hobbies does Santa have? Taking saunas, especially old-fashioned Finnish smoke saunas, is something he really likes. Taking naps is also an extremely important pastime for him.<p><p>9. Does Santa Claus live at Korvatunturi? Korvatunturi is his permanent residence and the place he loves the most, but all year long he drops by different places around the world. He only stays in places where he feels content.<p><p>10. How many names does Santa Claus have? I think every country has a different name for him. Here in Finland he’s called Joulupukki, and in America he’s Santa Claus. If remember correctly, in Germany they call him Weihnachtsmann, and in nearby Holland, Kerstman. He has all these names, and many more, because he is so well loved.<p><p><p><p>Elves help Santa sort and read letters from all over the world. Photo: Kacper Pempel/Lehtikuva<p><p>1. How many elves are there at Korvatunturi? No one knows for sure. Elves are fast and they are rarely all in the same place at the same time. But when the sun sets over Korvatunturi, there are probably as many little elf toes under the blankets as there are stars in the sky, if not more.<p><p>2. Are elves Santa’s children? Santa Claus believes that everyone should be everyone else’s child and that being a child is the most important thing in the world.<p><p>3. Are new elves still being born? New Christmas elves and other kinds of elves are born frequently. When the last rays of the evening sun meet with the Northern Lights, the wind is blowing from the north and the stars are shining, that is when elves are born.<p><p>4. Is it possible to become an elf? Of course. And it is possible to stay an elf. Taking care of smaller and weaker people is elf work. Making someone happy who doesn’t have anything to be happy about, or giving toys or clothes to children who need them – these are the best ways to be an elf.<p><p>5. Does Santa read all the letters he gets? The elves help him read the letters and make inventories. Santa Claus gets a lot of Christmas cards, too.<p><p>In addition to wish lists, Santa also receives numerous Christmas cards.Photo: Kacper Pempel/Lehtikuva<p><p>6. What kind of elves does Santa Claus have? He has reindeer herder elves. They respect reindeer as wild animals that have learned to live in harmony with humans and elves. He has mapmaking elves and pathfinder elves. He has a wood elf who is so old and wise that he knows how to make the best of each piece of wood, because he understands the spirit of the wood, and he looks like a knotty old pine himself. There are also professor elves who study various important things.<p><p>7. Do all the elves have names? Almost always. They have names like: Threshing Barn Elf of Hill Farm, Sauna Elf of Bay House, and so on. Some of them have nicknames that refer to their profession, like Ink Splotch, Mapmaker, Compass or Surveyor. The nicknames may relate to a personal trait, such as Old Wiseman, Speedy, Wise Guy, Long Beard, White Beard or Black Whiskers.<p><p>8. What do Santa and his elves do during their free time? They play lots of games. One of their favourites things to do is sit by the fireplace and talk about everything in the world. They reminisce about past journeys and recall interesting people and places that they have visited through the years.<p><p>9. Can humans see elves? Elves are good at sneaking around, so it’s usually hard to detect them. Children are often able to see a branch move, or notice something looking through the window or peeping from behind the curtains. Then they know that it’s their own personal elf tiptoeing around. Sometimes elves move something or leave some other sign to show that they have been around. They have also been known to pick up mail addressed to Santa Claus.<p><p>10. Do Christmas elves also go by different names? Yes, indeed. In Finnish we call them Tonttu; in Swedish and Norwegian, Tomte or Nisse; in German, Heinzelmännchen; in Dutch, Kabouter; and in English some call them gnomes as well.<p><p><p><p>To deliver everything on time, Santa has to plan the route carefully and use time zones to his advantage. Photo: Martti Kainulainen/Lehtikuva<p><p>1. How does Santa Claus travel? Lots of ways. He has a sleigh drawn by team of reindeer, but he also has a team of dogs, a car, an aeroplane, a snowmobile and a helicopter. Santa uses whatever means of transport is best suited to the weather conditions and the purpose of his journey.<p><p>2. Are all the presents made at Korvatunturi? Not all of them. Some are made at home, and they are especially precious. Surely you’ve heard of homemade jelly or mustard or hand-knitted wool socks. In some places there are little workshops that also help Santa Claus by making gifts.<p><p>3. How does Santa have time to deliver all the presents? He takes advantage of the differences between time zones. When children in Finland are awake, children in Japan are asleep and vice-versa. There is also some magic involved. Sometimes Santa Claus may delegate the elves to deliver presents. The most important thing is that the gifts get there on time.<p><p>4. Has Santa ever got stuck in a chimney? If that happened, delivery would get cut short. Santa Claus has a big book entitled Chimneys of the World. It is important to know how to get down them, and that is Santa’s specialty.<p><p>5. Is it possible to get presents even if you haven’t been good? Santa Claus is certain that, deep down, all children are good. If a child is hungry or tired, it’s only natural that crabbiness can creep in. Voicing disappointment or not feeling well has nothing to do with being good.<p><p>Santa and Mrs Claus keep reindeer, but deliveries can also be made by dogsled, snowmobile, aeroplane, helicopter and any other form of transport if necessary.Photo: Martti Kainulainen/Lehtikuva<p><p>6. What does Santa Claus do when he’s not delivering presents? He relaxes by walking in the forest and listening to the voices of the wilderness. He also spends time preparing the next Christmas delivery by reading children’s letters. His favourite pastime is reading books.<p><p>7. Does Santa get any presents? Oh yes, often. The best gifts, in Santa Claus’ opinion, are the happy smiles of children and the joyful look in their eyes.<p><p>8. Can Santa read children’s thoughts? Maybe not every thought, but at least the thoughts that children want him to read definitely come through. There is a special understanding between children and Santa Claus.<p><p>9. How does Santa know how to get to everyone’s house? This is how it works: The elf secretaries keep exact records of all children by country, state, county, province, city, town, village or district, by house or apartment building, by bedroom or even by bed. These records are used to plan the delivery route. It’s very demanding work; 284 elves work in the address department year round.<p><p>10. Where does Santa Claus get all the money it takes to fly to Japan? Shhh! We don’t use the word “money” here. Santa is extremely lucky, because in his world money doesn’t exist. The important thing is that he catches the plane, and that it’s the plane going to Japan when that’s where he intends to go. He usually takes a long nap on the flight.<p><p>Adapted from The Secret of the Magical Mountain Korvatunturi, a book published by Polarlehdet Ltd.<p><p>By Heli Karjalainen and Annikki Marjala<p><p><p><p>10 questions about Santa<p><p>10 questions about elves<p><p>10 questions about delivering presents<p>", "time": "2017-12-14T22:00:00+00:00", "type": "christmas"}
{"title": "Old-fashioned Christmas fun in Helsinki - thisisFINLAND", "url": "https://finland.fi/christmas/old-fashioned-christmas-fun/", "review": "", "content": "<p>The annual event (held on December 16 in 2018) provides a welcome antidote to today’s increasingly commercialised Christmas.<p><p>The volunteer-run Seurasaari Christmas Path is the brainchild of former kindergarten teacher Marjaliisa Kauppinen. “When we organised the first Christmas Path in 1996, the idea was to give a present to the children of Helsinki by re-creating the feeling of old countryside Christmases,” she remembers. “Right from the start we knew the open-air museum island of Seurasaari would be an ideal setting, as it has lots of trees, lovely old buildings transplanted from the countryside – and no cars!”<p><p>After crossing the decorated wooden bridge onto the island, families are welcomed by cheerful volunteer elves and forest animals dishing out gingerbread biscuits.<p><p>One simple but ever-popular attraction along the Christmas path is a maze made of straw bales. Photo: Sanna Liimatainen<p><p>The path leads on to more surprises, including an elves’ adventure trail, a fairy-tale tent and a simple but amazingly fun maze constructed from big bales of straw. “Our idea is to get children out of the shopping centres and let them run around, play games outside and make things for themselves,” says Kauppinen. “We invite them to bring along decorations they’ve made beforehand and hang them in our Christmas trees.”<p><p>Another popular activity is a romantic ride through Seurasaari’s forests on a real sleigh drawn by two friendly horses (a cart does the trip if there’s no snow).<p><p>In a special Christmas Arena the first Christmas is commemorated with a nativity play, a Christmas gospel and a chance to sing traditional carols with earthbound angels. Generous free portions of Finnish Christmas rice porridge are ladled out for the children (who are asked to bring their own bowls and spoons). Kids are also urged to bring torches so that they can boldly explore Seurasaari’s inviting forests as dusk descends.<p><p>One memorable neck of the woods is illuminated by hundreds of candles, creating an atmospheric avenue of light beneath the overhanging branches.<p><p>“We’ve aimed to give the whole event a very Finnish feeling, taking pride in our own Christmas customs, and using traditional materials like wood and straw instead of modern plastic decorations,” says Kauppinen. The path is blessedly free of tacky tinsel, flashing fairy lights or sponsors’ advertisements.<p><p>“People are really surprised to find that the whole event is absolutely free,” says Kauppinen. “We’ve been delighted to show that you can really do a lot without a big budget when people get inspired by a good idea!”<p><p>Kids are invited to bring along decorations to hang on the Christmas tree on Seurasaari. Photo: Sanna Liimatainen<p><p>Helsinki City Council actively supports the Christmas Path event, and foodstuffs and materials are provided by discreet sponsors, but most work is done by volunteers, including many students and trainee kindergarten teachers. “The joy that this event brings to so many children and their parents is the best possible payback for our work!” says Kauppinen.<p><p>Kids leave the island with fresh buns and a gift of a traditional Christmas card. The one-afternoon event typically attracts as many as 15,000 eager visitors, who are encouraged to leave their cars behind and arrive at Seurasaari by bus.<p><p>Other Finnish towns are following in Helsinki’s footsteps and setting up similar non-commercial yuletide events. Kauppinen is also proud that many Helsinki families who come back year after year feel that the Christmas Path marks the true beginning of their Christmas season.<p><p>By Fran Weaver, updated October 2018<p><p>Two-horse open sleigh<p><p>No logos<p><p>Let Christmas commence<p>", "time": "2017-12-14T22:00:00+00:00", "type": "christmas"}
{"title": "Christmas in Finland with the Sibelius family - thisisFINLAND", "url": "https://finland.fi/christmas/christmas-with-the-sibelius-family/", "review": "", "content": "<p>Sibelius (Dec 8, 1865–Sept 20, 1957), Finland’s most famous composer, also wrote some of Finland’s most beloved Christmas carols, although he dreaded the darkest time of the year. The Sibelius household nonetheless celebrated a jolly Christmas with lots of music.<p><p>I know exactly how it feels to have a composer in the family at Christmas time. The entire, big rambunctious household gathers around the piano after a sumptuous dinner with all the Finnish trimmings and around the man who dominates the house. The fervent but sometimes dissonant singing of traditional and, better still, self-composed carols melts the ice outside.<p><p>For 20 years, I experienced these unforgettable high-spirited holidays with my father-in-law, the Finnish composer Tauno Marttinen, in the cosy wooden house where he and his wife, Ilmi, lived in Hämeenlinna. This city also forms the birthplace of Finland’s most famous composer, Jean Sibelius, whose carols Finns love to sing on Christmas Eve.<p><p>View from the piano: Aino and Jean played the piano (foreground) while the family sang Christmas carols. Photo: Pekka Sakki<p><p>I imagine that at idyllic Lake Tuusula, where Sibelius lived most of his life with his wife Aino and their five daughters, the atmosphere must have been a bit like ours in that music, composer and family were brought together and joy prevailed.<p><p>Sibelius seemed not to have been very religious, and talked about his Christianity only as the “faith of my ancestors,” but it is known that he went to church at least once a year, on Christmas morning. He was not especially fond of Christmas time, in any case.<p><p>“The darkest weeks of the year from my birthday [December 8] until Christmas, when the sun is at its lowest, are always a difficult time for me,” he confided to his secretary, Santeri Levas. “Immediately after Christmas is over, things improve and life is fun once more.”<p><p>Ainola overlooks Lake Tuusula near Järvenpää, about 40 kilometres north of Helsinki. Photo: Pekka Sakki<p><p>Winter doldrums aside, by all accounts the composer enjoyed the time spent with his family when he gave them and their friends compositions as Christmas presents.<p><p>In 1915, Sibelius compiled five carols from his Christmas songs as Opus 1, composed between 1897 and 1913. One of them was the hymn “En etsi valtaa loistoa” (“Give me no splendour, gold or pomp”) and another is “On hanget korkeat, nietokset” (“High are the snowdrifts”), both of which rank among the best-loved Christmas carols in Finland.<p><p>Each year the Sibelius children sang the songs, which played a special role in the holiday traditions of the Sibelius family, because when “Give me no splendour, gold or pomp” was sung, their mother, Aino, was sitting at the piano for once. But it was a signal to the Sibelius children that the Christmas festivities had begun when Jean started to play “High are the snowdrifts.”<p><p>The importance of the carols to Sibelius is indicated by the fact that he reworked them continuously until just a few years before his death in 1957. Sibelius composed “Give me no splendour, gold or pomp” soon after he moved in 1904 to Ainola. The house was named after his wife and located near Järvenpää, about 40 kilometres north of Helsinki.<p><p>At his previous home in Kerava, about ten kilometres further south, he had composed “High are the snowdrifts.” In 1943, that song, with lyrics from a poem by Zacharias Topelius, was given a place in the hymn book of the Finnish Evangelical-Lutheran Church, first in Swedish and later in Finnish.<p><p>The formidable Sibelius Monument, created by sculptor Eila Hiltunen, forms one of Helsinki’s most popular tourist sites. Photo: Ismo Pekkarinen<p><p>At Christmastime Ainola bustled with people. There were the daughters with their growing families, and in-laws and friends dropping in. The house, normally so quiet one could hear a pin drop, echoed with music and game playing and the patter of children running around. And I imagine that smoke from Sibelius’s beloved cigars billowed around them.<p><p>The house had electricity but no running water – Sibelius didn’t want it. It must have been a challenge for the women as they prepared the culinary feast for so many. Among the delicacies were Aino’s own homemade preserves.<p><p>For the children, the high point was the start of Christmas at Ainola. “The children were taken to the dark nursery. They were called to the drawing-room when the Christmas tree was all lit up,” writes his granddaughter Laura Enckell in her recollections of her childhood.<p><p>“It really had to dazzle you with its brightness. He played ‘High are the snowdrifts,’ and he played so loud, with the pedal down, as if he were playing the organ. It was as if he would have liked to have had an orchestra there as well. We sang this song and then we sang ‘Give me no splendour, gold or pomp.’ This was all very jolly. It wasn’t pious or gloomy at all.”<p><p>By Rebecca Libermann<p><p>Joy and melancholy<p><p>Musical Christmas gifts from Sibelius<p><p>Boisterous Christmas din<p>", "time": "2017-12-13T22:00:00+00:00", "type": "christmas"}
{"title": "The chosen one - thisisFINLAND", "url": "https://finland.fi/christmas/the-chosen-one/", "review": "", "content": "<p>Mid-December is dark and cold in Finland, there are no two ways about it. As the country takes its annual plunge into winter, many Finns find solace in a saint.<p><p>White-clad Saint Lucia, borrowed from Catholic and Orthodox churches, wears a striking crown of tall white candles and sings ancient songs to urge people out of their winter doldrums. The main event takes place on December 13.<p><p>It’s the closest thing Finland has to celebrating royalty. This special woman, symbolic of the fourth-century Italian martyr Lucia, is put on a pedestal. She is literally crowned – and then given the duty of offering an abundance of joy, music and golden light to everyone who needs it.<p><p>Thousands of girls across the country also don homemade versions of Lucia’s trademark white dress and crown of candles (kids use safe, battery-powered “candles” nowadays). Then they sing for family or schoolmates in an annual tradition that has continued to grow over the years.<p><p>The honour of being chosen as the one who “gets to be Lucia this year” does not go unnoticed by most girls, many of whom dream of someday being the real Lucia. Hundreds of musically gifted girls in their late teens and early twenties vie for the prestigious title.<p><p>Waving to the crowd: Every year about 30,000 people attend the Lucia crowning ceremony and parade in downtown Helsinki. Photo: Mikko Käkelä/Folkhälsan<p><p>Every autumn ten finalists are selected by a jury and proceed to the next round, the winner of which is decided by popular vote. On December 13, Lucia is crowned at Helsinki Cathedral and parades through the city centre as tens of thousands of bundled-up onlookers cheer and wave.<p><p>For more than 60 years, Lucia festivities have been organised by nongovernmental social welfare organisation Folkhälsan and Swedish-language daily Hufvudstadsbladet.<p><p>The chief Lucia organiser, Folkhälsan’s Margaretha Wildtgrube, says Lucia has come to mean charity, both literal and aesthetic. “Lucia has many roles,” she explains, “building on centuries of Nordic tradition. She has the role of being the ‘Swedish-speaking Finn’s Lucia,’ and is obligated to offer a beautiful, ethereal experience.”<p><p>“But the Lucia brand also has a social responsibility,” Wildtgrube notes. Lucia also raises money to help children who have experienced violence at home.<p><p>For many weeks after December 13, Lucia continues to spread her hope and cheer, visiting hospitals, orphanages, daycare centres and nursing homes at the darkest time of the year in Finland.<p><p>But isn’t this the 21st century? Why does an old-fashioned thing like this only get more popular as the gears of modern life churn along? Hasn’t Lucia changed since her debut? “At her core, Lucia hasn’t changed at all: the white dress, the red belt, the crown of real candles in her hair,” Wildtgrube says.<p><p>“The demands about what qualities Lucia should possess have indeed changed. In the past Lucia was perhaps the ‘quiet girl,’ the one who didn’t necessarily outshine everyone else in the room. But today we want to see a Lucia who can handle the media and feels comfortable in the public eye and everything that goes with that.”<p><p>The value of Lucia is not just a brand name, but a personal feeling, according to Wildtgrube.<p><p>“Lucia hasn’t been exploited by designers and stylists yet, and is genuinely human in her simplicity,” she says. “It’s the ‘small format’ that has made Lucia such a big deal.”<p><p>Candles, music and mood: This little Lucia is eagerly waiting to catch a glimpse of her official counterpart. Photo: Hannes Viktorzon/Folkhälsan<p><p>Most little girls dress up as Lucia at home, whether or not they were selected at school. The candles, music and mood are much too tempting. Margaretha Wildtgrube, who has been in charge of Lucia festivities for the past ten years at social welfare organisation Folkhälsan, reveals that she too was chosen to be Lucia at school.<p><p>Whether official or otherwise, being Lucia is definitely an honour, Wildtgrube says.<p><p>“The girls who have been Lucia say that they did it because the tradition is beautiful and that Lucia brings the best out in people. They also say they get a warm feeling and felt truly wanted when greeted by so many smiles and friendliness.”<p><p>By Mark B. Odom<p><p>Tens of thousands of fans<p><p>More than a brand name<p><p>Every girl wants to be Lucia<p>", "time": "2017-12-09T22:00:00+00:00", "type": "christmas"}
{"title": "Come in from the cold with Finnish glögi - thisisFINLAND", "url": "https://finland.fi/christmas/come-in-from-the-cold-with-finnish-glogi/", "review": "", "content": "<p> <p><p>In our search for the best cup of seasonal glögi (mulled wine) to stoke our holiday cheer, we visit Hvitträsk, architect Eliel Saarinen’s lakeside manor in Kirkkonummi, close to the Finnish capital.<p><p>Half an hour west of Helsinki stands Hvitträsk, a stocky fairytale mansion atop a wooded hill. Majestic steps lead down to a lake on whose shores the sharp-eyed may spot prehistoric rock art. The first to do so was composer and sybarite Jean Sibelius. A century ago, he was a frequent guest at the house, along with other leading artists of the day.<p><p>Eliel Saarinen and two other hot young architects, Herman Gesellius and Armas Lindgren, built Hvitträsk as their shared home. It was known among pre-independence Finland’s elite for its fine dining and wild parties – indeed, one of the architects soon moved out amid a spouse-swapping scandal.<p><p>The 1903 mansion, built in the rustic National Romantic style, is now a museum. The guesthouse where Sibelius, Maxim Gorky and other luminaries stayed is now Hvitträsk’s restaurant, run by Tiia and Ville Dillemuth. [Editor’s note: Since this piece was originally published, Tiia and Ville have moved on to other projects, but their words of wisdom about glögi have not lost any of their potency, so we’ve kept them in this article.] The mood today is more discreet, but glowing with holiday spirit. According to the hosts, the best way to bring holiday cheer to anyone coming in from the cold is to hand them a steaming glass of glögi.<p><p>Hvitträsk stands like a fairytale mansion atop a wooded hill. Photo: Sinimaaria Kangas<p><p>Glögi is the Finnish version of mulled wine, known as glögg in other Scandinavian countries and Glühwein in German-speaking areas. The Dillemuths have created a distinctive Hvitträsk version of the drink, based around blueberries.<p><p>“We took our inspiration from the amazing blueberry forests that surround the house and the fact that the Saarinens loved blueberry pie, even at Christmas,” explains Tiia. While Finns typically serve the drink with gingerbread cookies, the Dillemuths accompany it with blueberry-oat cookies.<p><p>Jars of their glögi spice mixture are available at Hvitträsk’s traditional Christmas market. The annual handicraft bazaar has been held in and around Hvitträsk’s buildings for decades. “Some of the same grannies have been selling their woollen goods here ever since 1975,” says Tiia with a grin.<p><p>In recent years blonde glögi has gained popularity. Photo: Sinimaaria Kangas<p><p>Most Finns simply buy premixed glögi off the shelf at grocery stores or state-run Alko liquor outlets, serving it with raisins and blanched almonds. These days, though, many people seem to be favouring the simple and homemade for Christmas – which goes for drinks as well as food, cards and gifts.<p><p>Finnish food blogs are buzzing with exotic glögi recipes involving blood-grapefruit juice, cherries or almond liqueur. In recent years blonde glögi has gained popularity. Cookbook author Marianne Kiskola suggests strawberry juice spiked with cinnamon, vanilla and ginger, while Sami Malila’s Moomin cookbook offers a favourite based on blackcurrant juice.<p><p>Simmer 20–30 minutes; strain. Makes about 1.5 litres of glögi.<p><p>Boil for about 5 minutes; purée with wand blender.<p><p>Add 1 tablespoon of purée per glass, along with dried blueberries and almonds (whole or sliced).<p><p>The alcohol evaporates in the cooking process. If desired, the glögi can be “strengthened” with 2 cl of Koskenkorva Vodka Vanilla or Becherovka herbal bitters.<p><p>Moisten rim of wine glasses and dip in gingerbread crumbs.<p><p>Add 1 tablespoon of glögi concentrate (cook above recipe until condensed by half or use commercial mixture) to each glass.<p><p>By Wif Stenger<p><p><p><p> <p><p>Inspiration from the forest<p><p>Blonde, berry or blood<p><p>Glögi variations from Hvitträsk<p><p>Hvitträsk glögi<p><p>Blueberry purée<p><p>Hvitträsk royal glögi<p>", "time": "2017-11-25T22:00:00+00:00", "type": "christmas"}
{"title": "ThisisFINLAND Christmas quiz - thisisFINLAND", "url": "https://finland.fi/christmas/thisisfinland-christmas-quiz/", "review": "", "content": "<p><p><p>Here’s a fun quiz about Christmas in Finland! Choose the right definition for each of the following Finnish words and tally your total at the end.<p><p>To the Finns, whose country is 75 percent forest, these three trees look very different – and only one is a true Christmas tree.Illustration: Heli Pukki <p><p>Is this a secret recipe? A sermon? A sing-along? Or perhaps some other “piece” of Christmas?Illustration: Heli Pukki <p><p> <p><p>Answers<p><p>Check your answers against the key below and add up the amount you got correct to find out how much you know about Finnish Christmas traditions:<p><p>1. c, 2. b, 3. b, 4. a, 5. c, 6. c, 7. a, 8. c, 9. b, 10. b<p><p>0–4 Never mind! Come and visit Finland soon to learn more about these colourful Christmas traditions!<p><p>5–7 Well done! You already have a grasp of Finnish Christmas traditions – or you may be on a lucky streak?<p><p>8–10 Onneksi olkoon! Congratulations! (Do you have Finnish blood?)<p><p> <p><p> <p><p>By Fran Weaver<p><p><p><p>Hyvää joulua! Happy Christmas!<p><p>1.<p><p>Tonttu<p><p>2.<p><p>Himmeli<p><p>3.<p><p>Rosolli<p><p>4.<p><p>Joulukuusi (“Christmas tree” – Which of the following is Finland’s traditional Christmas tree?)<p><p>5.<p><p>Lanttulaatikko<p><p>6.<p><p>Pikkujoulu (literally “Little Christmas”)<p><p>7.<p><p>Lipeäkala<p><p>8.<p><p>Joulurauha<p><p>9.<p><p>Glögi<p><p>10.<p><p>Jouluateria (Finland’s traditional Christmas meal – what dish most typically forms its centerpiece?)<p><p>How many did you get right?<p>", "time": "2017-11-19T22:00:00+00:00", "type": "christmas"}
{"title": "A Finnish Christmas cookbook - thisisFINLAND", "url": "https://finland.fi/christmas/christmas-cookbook/", "review": "", "content": "<p>Christmas is the most traditional of Finnish festivals. It is a time for family, close relatives, friends without family, but above all for the children. The good old traditional dishes appear on the Christmas dining table year after year. Casserole dishes, Finnish cuisine at its best, can easily be prepared a few days in advance.<p><p><p><p> Preparation time: about 25 minutes Salting time: 1–2 days Not suitable for freezing<p><p>1. Fillet the salmon unless bought already filleted. Do not, however, remove the skin. 2. Wipe the fillets with paper towels without rinsing. 3. Sprinkle the bottom of a suitable sized dish with salt and place one of the fillets, skinside down, on the salt. Spread the seasoning over both the fillets, placing the other fillet, skinside up, on top. Sprinkle the rest of the salt and the dill over the fish. Cover the dish tightly with aluminium foil. Put a small weight on top and store in a cool place. 4. Scrape off all the seasoning and cut the fillets down to the skin into thin, oblique slices before serving.<p><p>Hint <p><p>Freshly salted salmon does not require any sort of dressing, especially when served at Christmas. However, mustard dressing goes very well with this dish.<p><p>Prepare as follows just before serving the salmon: Mix together 3 tablespoons darkish prepared mustard, 2 tablespoons sugar and 4 tablespoons wine vinegar. Add 3/4 cup (2 dl) oil, preferably olive oil, in a thin stream while beating at the same time. Last of all, mix in plenty of finely chopped fresh dill.<p><p><p><p><p><p><p><p>Dressing:<p><p>Cook the vegetables (not the onion!) in their skin well beforehand until just tender. Peel the vegetables and onion and cut them with the gherkin into small, equal-sized cubes. Mix them together and season with a little salt and white pepper.<p><p>Whip the cream lightly, season with sugar and vinegar and add a few drops of beetroot liquid for colour. Serve the dressing separately. (Garnish the salad with hard-boiled eggs, the yolks and whites chopped separately and laid in stripes on the top.)<p><p><p><p><p><p> Casserole dishes form the main hot dishes served at Christmas. They are very useful from the hosts’ and hostesses’ point of view because they can be prepared well in advance. They keep well for two or three days when stored in a cool place. The flavour of the rutabaga casserole, for instance, improves with reheating.<p><p>Homemade casseroles are Finnish cuisine at its best: nutritious and much easier to prepare than one would imagine, and also exceptionally economical.<p><p>Preparation time: 25–30 minutes Boiling time for the rutabagas: 30–40 minutes Cooking time: 1/2–2 hours Oven temperature: 350°F (175°C) Suitable for freezing<p><p>Coating: dried breadcrumbs, butter<p><p>1. Scrub and peel the rutabagas. Cut up into large pieces and boil in slightly salted water until soft. 2. Strain, keep the cooking liquid, and mash or blend the rutabagas in a kitchen blender. 3. Mix in the cream and dried breadcrumb paste, dark syrup, beaten egg and spices, and as much of the cooking liquid as is needed to give a loose soft consistency. 4. Turn into a greased baking dish, press the surface with a fork to make a pattern, sprinkle over a thin coating of dried breadcrumbs. 5. Dot the top with butter and bake in the oven.<p><p>NOTE: The flavour of the rutabaga casserole can be further enhanced by adding some lightly fried, grated onion.<p><p>Preparation time: 40 minutes Cooking time: 20 minutes + 1 1/2 hours Oven temperature: 350 °F (175°C) Suitable for freezing<p><p>Coating: dried breadcrumbs, butter<p><p>1. Boil the rice in the water and milk mixture and cook until the rice starts to thicken just a bit. 2. Peel and grate the carrots. 3. Mix the grated carrots, milk, melted butter, eggs and spices into the rice pudding. 4. Pour the mixture into a greased baking dish. Sprinkle with dried breadcrumbs and dot with butter. Bake in the oven until brown all over.<p><p><p><p><p><p> Preparation time: 30 minutes Soaking time: 12 hours Marinading time: 2–3 days<p><p>Marinade:<p><p>1. Soak the fish overnight in cold water or equal portions of water and milk. The liquid can be changed occasionally. 2. Prepare the marinade; boil up all the ingredients and leave to cool at room temperature. 3. Remove the gut and inside belly membrane with, for instance, kitchen scissors. Rinse well and dry with paper towels. Cut up into shortish sections. 4. Peel the onions and carrots and cut into rings. 5. Fill a suitable glass jar with alternate layers of fish slices, onions and carrots, and the spices. Pour over the liquid. 6. Cover the jar and store in a cool place for at least two days. The herrings will keep for a couple of weeks in a cool place, but they are at their best after four to five days.<p><p>Hint <p><p>Different spices can also be used: thin slices of horseradish or celery seeds, mustard seeds. The fish can also be filleted and the skin removed. In that case, soaking is not required.<p><p><p><p><p><p> Preparation time: 10 minutes Cooking time: 45–55 minutes/2 lb. (1 kg) Oven temperature: 250–300 °F (125–150°C) and 440°F (225°C)<p><p>Coating:<p><p>cloves for decorating<p><p>1. Place ham on a wiregrid in the roasting pan, skin side up. Push a roasting thermometer into the thickest part of the ham making sure it does not touch the bone. 2. Put the ham in the oven. It is difficult to give a precise roasting time, it is best to go by the roasting thermometer. When it reaches 170 °F (77°C) the meat is cooked. 3. Remove from the oven and let it stand for a moment. Remove the skin and as much of the underlying fat as required. 4. Mix together the ingredients for the coating and smear over the ham. Put back into the oven at 440 °F (225°C) for ten minutes or until golden brown all over. Decorate the surface of the ham with cloves.<p><p>NOTE: If the ham is cooked at a lower temperature less liquid will be lost and the meat will be much more succulent. Of course the lower the temperature, the longer the cooking time.<p><p>Variation<p><p>Many people consider that the meat will be much juicier if the ham is covered with a pastry crust. Prepare the pastry by mixing about 2 cups (800 g) rye flour in one litre of water. The pastry is then rolled out or patted over the surface of the ham to give a crust about 1/2 inch (1 1/2 cm) thick. No salt should be added to the pastry. If the ham happens to be too salty, the pastry crust will absorb the excess salt.<p><p>Hint<p><p>The meat juices which collect in the roasting pan can be used to make a tasty gravy. Be careful, however, it will be rather salty. One well-tried method is to mix in some apple sauce flavour with ground ginger and mustard, and serve together with the warm ham.<p><p><p><p><p><p> (for 10 people) Preparation time: 10 minutes Cooking time: 40 minutes Suitable for freezing<p><p>1. Add the rice to the boiling milk and water mixture. 2. Simmer until cooked. Add the salt and one blanched almond. Serve with ground cinnamon, sugar to taste, and milk.<p><p>NOTE: The almond is believed to bring good luck to the person who happens to get it.<p><p><p><p><p><p> Preparation time: 5 minutes Soaking time: overnight Cooking time: about 15 minutes<p><p>1. Rinse the mixed fruit in cold water and leave to soak overnight in water containing a little sugar. 2. Boil the fruit in the soaking liquid with the cinnamon and a touch of salt if desired. 3. Continue to boil over a low heat until the fruit is fully cooked. 4. Transfer the fruit with a slotted spoon to the serving dish and remove the stick of cinnamon. 5. Thicken the juice: remove the pan from the heat, mix the potato starch in a little cold water and add in a thin stream to the liquid, stirring continuously. Bring quickly back to the boil without stirring. 6. Pour over the fruit and sprinkle a little sugar over the top.<p><p><p><p><p><p> (makes 3 loaves) Preparation time: 30 minutes Rising time: 1 1/2 hours altogether Baking time: about 40 minutes Oven temperature: 400 °F (200 °C) Suitable for freezing<p><p>1. Warm up the buttermilk. 2. Crumble in the yeast and add the syrup and spices. 3. Mix in the flour and knead thoroughly. Cover with a cloth and leave to rise. If the kitchen is drafty, stand the covered bowl in warmish water. 4. Divide the dough into three and shape each portion into a round loaf. Put in a warm place to rise. Prick with a fork before placing in the oven.<p><p><p><p><p><p> Pastry:<p><p>Filling:<p><p>1. Put all the pastry ingredients into a bowl and mix quickly by hand into a dough. Don’t knead too much. 2. Put the dough to a cold place to harden. 3. Roll out on a floured board, folding a few times to make a puff pastry, and finally make a 1/2 cm thick sheet. 4. Cut the sheet into 7 x 7 cm squares. Split the corners of each square. 5. Place a bit of prune puree or plum jam in the middle of each square. Fold over every other split end onto the center, to form a windmill-like pastry. 6. Brush with beaten egg and bake at 450° F (250° C) until light brown. To make round pastries, cut into circles, fill, and fold in half. Bake as above.<p><p><p><p><p><p> (makes about 200) Preparation time: 30 minutes Cooking time: 10 minutes per batch Oven temperature: 400°F (200 °C)<p><p>1. Boil the syrup and spices, add the margarine and beat until the mixture is cool. 2. Beat the eggs and sugar. 3. Mix the soda in with part of the flour and then combine with the syrup-margarine mixture. Add the whipped eggs and the rest of the flour. Do not knead the final mixture. 4. Cover the dough with plastic wrap and leave overnight in a cool place. 5. Roll out the dough, cut up into shapes and bake the cookies in the oven until golden brown.<p><p><p><p><p><p><p><p>In a large kettle, combine all the ingredients except the vodka. Heat slowly, until the drink is steaming hot. Stir every now and then, and taste with a spoon whenever you feel like it. Do not let the drink get even close to boiling. Just keep it warm. Before serving, add vodka if you wish.<p><p><p><p>Photos by Studio Fotoni<p><p>Freshly salted salmon<p><p>Rosolli salad<p><p>CASSEROLES<p><p>Glass Masters herring<p><p>Baked ham<p><p>Rice porridge<p><p>Mixed fruit soup<p><p>Christmas bread<p><p>Christmas pastries / Joulutortut<p><p>Gingerbread cookies / Piparkakut<p><p>Christmas glögg<p><p>Rutabaga casserole<p><p>Carrot casserole<p>", "time": "2017-11-17T22:00:00+00:00", "type": "christmas"}
{"title": "Sending Santa letters in Finnish Lapland - thisisFINLAND", "url": "https://finland.fi/christmas/sending-santa-letters-in-finnish-lapland/", "review": "", "content": "<p>Do you ever wonder where all those letters that children write to Santa Claus wind up? In Finnish Lapland, of course, at Santa’s Main Post Office – and right next door, you can meet Santa himself. We pay him a visit.<p><p>On the Arctic Circle, at 66.5 degrees north latitude, Santa Claus runs his very own post office with the help of his elves. Located outside the city of Rovaniemi in Finnish Lapland, Santa’s Main Post Office forms a logistics centre for the more than half a million cards, letters and packages he receives each Christmas. He gets more than 30,000 a day during the holiday season.<p><p>As everyone knows, Santa Claus makes his home farther north in Finland, on a mountain called Korvatunturi. However, his special magic also allows him to be in Rovaniemi much of the time, all year round, for people to meet him.<p><p>Santa Claus takes a break after reading a pile of letters in his post office in Finnish Lapland. Photo: VisitRovaniemi.fi<p><p>Letters to Santa Claus form an important part of Christmas preparations for many Finnish children, especially the smaller ones, but it’s not limited to a certain age group. The letter to Santa represents a genre unto itself, with subgenres ranging from messages from kids who have just learned to write (“Dad, how do you spell ‘Santa Claus’?”) to longer compositions by somewhat older children.<p><p>Although the specific content of the letters Santa receives is of course confidential, our elf sources tell us that subjects often range beyond the obvious holiday gift wishlists. Writers trust Santa with their thoughts about life and whatever troubles the world is experiencing at the time of writing, and some also ask for advice.<p><p>Our contacts among the elves also say that grown-ups, not just kids, are interested in Santa. People of all ages write to extend holiday greetings or to express profound wishes that go beyond Christmas presents, such as world peace. On a lighter note, if you visit Santa’s Main Post Office you will find out that a great many toddlers have – at the suggestion of their parents, no doubt – sent their soothers (also known as “pacifiers” or “dummies”) to Santa Claus as a sign that they have outgrown them.<p><p>Something about Santa strikes a chord that is appreciated by people of all nationalities – he has received mail from 198 different countries to date. Perhaps because of this, he and his elves form an impressively multilingual bunch.<p><p><p><p>Depending on your viewpoint, this video is either cute or too sugary, but it does show you what Santa’s office looks like.Video: Santa’s Main Post Office and City of Rovaniemi<p><p>Santa’s Main Post Office makes up part of a cluster of buildings known as Santa Claus Village. The Arctic Circle cuts through the middle – it is painted onto the pavement.<p><p>One building houses Santa’s “office.” You enter through a vaulted room where a giant pendulum swings back and forth. Labelled “Earth’s Rotational Speed Regulator,” this enormous piece of clockwork gives you an impression of the magic and mystery Santa draws upon in order to get around the globe and deliver billions of presents on a tight deadline.<p><p>Upstairs, elves usher you into a chamber and – there he is, Santa himself, with a long white beard, looking just like he does in all the pictures. He greets the kids and gives the grown-ups a hearty Finnish handshake. When the author of this article visited with a group consisting of about 20 people from as many different countries, Santa chatted with us in a wide variety of languages.<p><p>You don’t need Santa’s magical insight to figure out that everyone who passes through will want a photo opportunity. A photographer elf snaps away, immortalising the moment. They even have a live webcam so anyone can take a peek as Santa receives guests.<p><p>No matter what time of year visitors arrive to see Santa and his post office, he and his elves are bound to fill their hearts with genuine, long-lasting Christmas spirit. That’s what it’s all about.<p><p>By Peter Marten<p><p>Writing to Santa<p><p>Meeting Santa<p>", "time": "2017-11-11T22:00:00+00:00", "type": "christmas"}
{"title": "Christmas lights up the Helsinki night - thisisFINLAND", "url": "https://finland.fi/christmas/christmas-lights-up-the-helsinki-night/", "review": "", "content": "<p>Holiday decorations in the Finnish capital contradict the idea that the northern winter must be a time of lingering darkness. Our photographer ventures out in search of illumination. Bring on the light!<p><p>When the holiday lights on Alexander Street come to life in late November, Helsinkians know that the Christmas season has begun in earnest. Senate Square always features a huge, locally harvested Christmas tree – workers spend several days in a bucket lift adorning the tree with lights. All across the city, merchants spare no expense to make their windows glow with seasonal cheer. Sample the holiday spirit in our slideshow!<p><p> <p><p> <p><p>Look up to get a down-to-earth view of the decorations that adorn the atrium at Kamppi, a downtown Helsinki shopping centre.<p><p>Kamppi’s display of illuminated presents provides an oh-so-subtle hint of the approach of Christmas.<p><p>Each holiday season, stores attract children with elaborate Christmas displays set to music. The traditional favourite in Helsinki occupies a corner display window at Stockmann, the city’s largest department store.<p><p>Christmas lights and car lights cross paths at one end of Keskuskatu (Central Street), a city-centre pedestrian area.<p><p>For Finnish shoe designer Minna Parikka, who runs a flagship store on Alexander Street, the holiday season offers the perfect excuse to create an elaborate, decorative window display for her elaborately decorated shoes and accessories – as if she needed an excuse.<p><p>Finnish national poet Johann Ludvig Runeberg looks out over a decorated Esplanade. At park level stands a figure representing Finland, with her arm over a scroll that contains the words to the national anthem – which Runeberg wrote.<p><p>Illuminating the hand of truth: Gunnar Finne’s “Fact and Fable,” a monument on the Esplanade to the writer Zacharias Topelius, includes statues of two women who represent truth and fiction.<p><p>A giant snowflake lights up the foreground as Helsinkians ascend to another level in Citycenter, a shopping venue across from the Central Railway Station.<p><p>Torches glow outside a restaurant on Sofia Street, just south of Senate Square.<p><p>The ghost of the number 4 tram glides up the slope of a Christmas-clad Alexander Street.<p><p>A group of friends admires the 20-metre (67-foot) Christmas tree from the cathedral steps on Senate Square.<p><p>The star at the top of the Christmas tree on Senate Square stands out against the tower of the Lutheran Cathedral as St John looks on.<p><p> <p><p> <p><p>Photos by Tim Bird, Text by Peter Marten<p><p>A light-hearted Christmas in Helsinki<p><p><!-- 1 --><p>", "time": "2016-12-11T14:49:00+00:00", "type": "christmas"}
{"title": "What’s in Finnish Christmas for non-Christians? - thisisFINLAND", "url": "https://finland.fi/christmas/whats-in-it-for-non-christians/", "review": "", "content": "<p><p><p> <p><p>Christmas means different things to different people, and you don’t have to be a Scrooge to decide it’s not for you. On the other hand, you don’t have to be a Christian to join in, either.<p><p>Christmas in Finland is impossible to ignore. The first cards and gift-packed chocolates appear a day or two earlier every year and the pikkujoulut – pre-Christmas parties – are arranged ever further ahead of the main event. When that main event arrives, we excuse the emptiness of our bank accounts, telling ourselves it’s Scrooge-like not to spend large amounts on food, drink and presents.<p><p>At least, most of us do. It’s sometimes hard to remember that there are people who actually make the decision not to participate – the estimated 40,000 Muslims living in Finland, for example. Many are descendants of Tatar Muslims who came here when the country was a grand duchy under the Russian Empire, while more recent arrivals are from Kosovo, Bosnia, Somalia and a number of other countries.<p><p>“Christmas is a non-Islamic holiday, so Muslims spend it as most Finns do in Finland, relaxing and trying to be with their family, but some might work,” says Anas Hajjar, deputy chairman of the Islamic Council of Finland. “Since Muslims do not celebrate birthdays as religious holidays, Christmas is not celebrated, but it is respected as it commemorates the birth of a great prophet.”<p><p>When the Radisson Hotel went up in Kamppi in 1991, it was designed so that Helsinki Synagogue, built in 1906, would remain a visible part of the neighbourhood.Photo: Peter Marten<p><p>“As the birthday of Christ, you could almost say that Christmas is the moment when Christianity is separated from the Jewish religion,” says Dan Kantor, executive director of the Jewish Community of Helsinki. The majority of Finland’s 1,500 Jews live in the capital area, using the synagogue in the Kamppi district and its adjoining community centre as their religious and social hub.<p><p>“I can remember my own experience as a small boy, when I used to look out of the window and see the Santas running around from neighbour to neighbour,” says Kantor. “At that time you perhaps thought that you didn’t quite belong to the rest of the Finnish people. But we have our own holidays. Of course, you feel a difference at this time – you can’t escape it. But it’s not a problem because we have a strong identity.”<p><p>The Jewish festival of Hanukah, a festival of light, coincides with the Christian festive season, and presents are also given to children at this time. “In most Jewish homes and families, Christmas doesn’t play a role,” Kantor says, “but most marriages these days are intermarriages and then Christmas enters the picture.”<p><p>Christmas shopping isn’t for everyone, but it’s open to all faiths, part of the undefined area where culture and religion overlap.Photo: Mikko Stig/Lehtikuva<p><p>Another non-Christian element joins in the celebrations, but not out of religious respect. “My wife and I have both been atheists since our early teens, but nobody visiting us at Christmas time would notice any difference,” states Jaakko Wallenius, compiler of the Being Human blog site. “Everybody with a rudimentary knowledge of history knows that Christmas has really nothing to do with Christian beliefs. Christmas, also called Yule – which is close to the Finnish word for Christmas, joulu – was a big event for the pagan Germanic nations long before they were converted to Christianity.<p><p>“The main function of Christmas is to celebrate family ties and to provide an opportunity to cease all normal activities,” Wallenius continues. “Because of this, it is possible to find time to search for inner peace and harmony, as there are no strict schedules or places to go. Many people have a misconception that these feelings must somehow be connected to a religion, even though religion is not needed in any way to attain these things.<p><p>“This feast has always been a celebration of light over darkness, even though a part of the population has seen fit to simultaneously celebrate the birthday of the founder of their religion. We have no reason to dump these age-old traditions, even if the Christian church has for centuries tried to hijack them as its own.”<p><p>At least one group of non-Christians, then, gets to have its Christmas cake and eat it, too.<p><p>By Tim Bird<p><p><p><p>Differences aren’t a problem<p><p>Light over darkness<p>", "time": "2016-11-25T22:00:00+00:00", "type": "christmas"}
{"title": "Go ahead and jump! - thisisFINLAND", "url": "https://finland.fi/christmas/go-ahead-and-jump/", "review": "", "content": "<p>Finns are passionate about ski jumping: some get their thrills soaring off a slope at more than 100 kilometres an hour, while others cheer on their national champions from the comfort of their sofa.<p><p>Happy New Year to all winter sports fans! Our love for ski jumping has inspired a little New Year’s gift for you. Here you go: an emoji immortalising all-time ski jumping legend Matti Nykänen. The most successful ski jumper in history wears his suit from the 1988 Calgary Winter Olympics in his very own emoji.<p><p>Matti Nykänen has said that “life is a person’s best time”. We couldn’t agree more!ThisisFINLAND<p><p>Released during the European Four Hills Tournament, the emoji honours not only Nykänen’s astounding athletic career but also other Finnish men and women who excel in the sport – in the hope that this symbol will help encourage them to new heights.<p><p>Nykänen’s emoji brings him into a prestigious group as only three of the 30 Finland emojis depict world-renowned Finns. The two previous individual emoji figures represent the peace mediator and Nobel laureate Martti Ahtisaari and Formula One racer Kimi Räikkönen.<p><p>Matti Nykänen is not just a world-known ski jumper but a one of a kind verbal virtuoso. He has introduced some of the well-used catchphrases for the Finnish language. It is not rarely we say “every chance is an opportunity” or we estimate the percentages with a “fifty-sixty” share. One thing we know for sure: “life is life”. (We know, they don’t make much sense in Finnish either. But we still love his sayings!)<p><p>This month Finland became the first country to issue its own set of national emojis. These tongue-in-cheek images illustrate Finnish emotions and strengths, as well as vices, and are part of our Christmas calendar 2015 at xmas.finland.fi.<p><p>The Finland emojis can be downloaded for Android devices from Google Play and for iOS devices from the App Store. The Nykänen emoji will be updated for iOS slightly later. Emoji stickers are also available for all devices from the Christmas calendar page. The emojis are also featured in the following apps: iMoji, Jongla, Futurefly and gotIT.<p><p>More Finland emojis will appear next spring, as the summer collection is unveiled. Finland emojis are digital stickers that are visible on all devices, even if the recipient has not downloaded the emoji set.<p><p>By Jenita Cresswell, December 2015<p>", "time": "2015-12-29T21:00:21+00:00", "type": "christmas"}
{"title": "A Finnish Heavy Christmas to one and all! - thisisFINLAND", "url": "https://finland.fi/christmas/a-heavy-christmas-to-one-and-all/", "review": "", "content": "<p>The Finnish heavy metal Christmas band Raskasta Joulua has evolved into a supergroup collective with many very famous regular and occasional members, including legendary Nordic rockers such as Marco Hietala of Nightwish, Sonata Arctica’s Tony Kakko, and Elize Ryd from Amaranthe.<p><p>In a country where heavy rock is a mainstream musical genre it comes as no surprise to learn that a select group of Finnish rock artists have got together to metalise popular seasonal hymns and songs.<p><p>The idea was born when professional guitarist Erkka Korhonen, who records and gigs with many top Finnish metal and progressive bands, realised that two important elements of Finnish culture – celebrating Christmas and thrashing out loud music – could be creatively combined. It was easy to find fellow musicians keen to join the seasonal fun. “It meant going outside the box, but we felt it seemed just crazy enough to work!” he remembers.<p><p>The idea of the band Raskasta joulua was to combine two key elements of Finnish culture: celebrating Christmas and thrashing out metal music. “Many Finnish Christmas songs are quite dark and melancholy compared to carols in the Anglo-Saxon tradition, so they’re surprisingly well suited to heavier interpretations,” says guitarist Erkka Korhonen, who came up with the idea for the band.Photo: Kirsi Elo/Finnish Evangelical Lutheran Mission<p><p>“Christmas songs have been performed traditionally in Finland for ever, but we have now two generations who’ve grown up with rock music, so the time’s surely right for heavy versions,” adds Korhonen. “Many Finnish Christmas songs are quite dark and melancholy compared to carols in the Anglo-Saxon tradition, so they’re surprisingly well-suited to heavier interpretations.”<p><p>The rockers soon set up regular pre-Christmas gigs, and released the first of their six albums in 2004. The band Raskasta Joulua (Heavy Christmas) has since evolved into a supergroup collective with many regular and occasional members, including legendary Nordic rockers like Marco Hietala of Nightwish, Sonata Arctica’s Tony Kakko, and Elize Ryd from Amaranthe.<p><p>The Raskasta Joulua bandmembers are more used to playing arenas, concert halls and clubs, so they relished the chance to play in an atmospheric old chapel. Altogether the band had 27 gigs in 24 towns. They also have TV appearances, one of which is on Christmas Eve in Finland.Photo: Kirsi Elo / Finnish Evangelical Lutheran Mission<p><p>Korhonen emphasises that everyone enjoys getting together at Christmas to enjoy familiar seasonal songs – and heavy rockers are no different. “In fact we’ve been pleased to have young people from difficult family backgrounds tell us that coming to our concerts gives them a nice Christmas feeling they’d somehow missed before,” he says.<p><p>Christmas is of course also a time for giving. Since 2013 Raskasta Joulua have enlisted volunteer tin-rattlers to collect donations at their gigs for the annual campaign Kauneimmat Joululaulut (The Greatest Christmas Carols), run by the Finnish Evangelical Lutheran Mission (FELM) to raise funds for development projects around the world.<p><p>Campaign coordinator Johanna Lillqvist greatly appreciates the rock stars’ efforts. “This year the theme of our Christmas campaign is appropriately ‘Peace’. Donations will be channelled to grassroots peace-building projects run by FELM and our partners in conflict-torn countries,” she says.<p><p>FELM’s mainstream musical campaign involves collecting donations at thousands of popular but more conservative carol-singing services, held in hundreds of churches around Finland at Christmastime. “Last year we raised over a million euros for projects benefiting women, and this Christmas we hope to raise even more for peace projects,” says Lillqvist.<p><p>Though this Raskasta Joulua album release party at a Helsinki church was largely acoustic, the heavy musicians let their long hair down in a convivial pre-Christmas spirit, and the church really rocked. From left: J.P. Leppäluoto, Marco Hietala and Ilja Jalkanen. Photo: Kirsi Elo/Finnish Evangelical Lutheran Mission<p><p>Released in November 2015, Raskasta Joulua’s album Tulkoon Joulu (Let Christmas Come) features arrangements that include acoustic instruments but still have a heavy or prog-rock feel. Finnish translations of ‘The Little Drummer Boy’, ‘The First Noel’ and snatches of the medieval English ‘Coventry Carol’ ring out alongside groundbreaking – and ear-splitting – adaptations of well-loved Finnish songs like ‘Tonttu ei vaan saa unta’ (‘The Sleepless Elf’).<p><p>Raskasta Joulua’s back catalogue also includes Raskasta Joulua IV (2017) and 2014’s Ragnarok Juletide, an collection of heavy carols with vocals sung in English, as well as several other, earlier albums.<p><p>By Fran Weaver, December 2015, updated December 2018<p><p> <p><p>Joy and peace for metal-heads<p><p>Heavy elves and drummer boys<p>", "time": "2015-12-21T15:45:53+00:00", "type": "christmas"}
{"title": "Christmas Eve in a candlelit cemetery - thisisFINLAND", "url": "https://finland.fi/christmas/christmas-eve-in-a-candlelit-cemetery/", "review": "", "content": "<p><p><p> <p><p>Visiting the local cemetery is very much a part of many Finnish families’ Christmas rituals. Hey, it’s not as morbid as it might sound.<p><p>Although going to a graveyard might seem an unlikely activity for the festive season, the sight of hundreds of graveside candles glowing in the snow in a serene wooded cemetery can be surprisingly uplifting.<p><p>Placing candles on the graves of deceased relatives at Christmastime is a deep-rooted tradition followed by non-churchgoers and members of the Orthodox faith, as well as believers from the majority Evangelical Lutheran Church of Finland. “As many as three-quarters of Finnish families visit a cemetery at Christmas, mostly on Christmas Eve, and we even have to make special traffic arrangements to accommodate the crowds,” says Risto Lehto, who manages six cemeteries run by the Parish Union of Helsinki.<p><p>Lehto explains that many people stroll in their local graveyards at Christmas even if none of their relatives are buried there, just to enjoy the tranquil candlelit scene. “Our cemeteries also have memorial features where people can light candles for those buried elsewhere.”<p><p>People come to the cemetery to pay their respects or just to reflect quietly on the candlelit scene.Photo: Heikki Saukkomaa/Lehtikuva<p><p>Though the cemetery may be crowded, the atmosphere is silent and solemn as people quietly reflect on the candlelit scene, and their lost loved ones. “In truth cemeteries are for the living and not for the dead,” says Lehto. “In Finland we really take care of our cemeteries as scenic parks with grand old trees. They’re places where people can enjoy a peaceful stroll, as well as remembering the deceased. Grieving can be a long process, and we like to provide settings where people can gain comfort. Our cemeteries are nothing like the scary derelict graveyards you see in horror films!”<p><p>The myriad graveside candles certainly bring light and joy to the scene on a midwinter afternoon, making a secluded cemetery look like a mystic fairy dell. Some people make picturesque natural lanterns around their candles using piles of snowballs or icy covers made of water that has been frozen in a bucket.<p><p>Lehto explains that the tradition of putting candles by graves only became widespread in Finland in the 1920s, when candles became affordable. However, the custom of paying seasonal respect to the dead probably dates back much further, and may even have its roots in pre-Christian times – like the pagan tradition of lighting midsummer bonfires, which is nowadays associated with the Christian feast of St John’s Day (Juhannus in Finnish).<p><p>The sight of hundreds of graveside candles glowing in the snow in a serene wooded cemetery can be surprisingly uplifting.Photo: Heikki Saukkomaa/Lehtikuva<p><p>“In the post-war 1950s, when people wanted to remember those who died fighting to preserve Finland’s independence, putting candles on graves became more common on Independence Day (December 6) as well,” says Lehto. All Saints’ Day (November 1) is another day when Finnish cemeteries radiate with soft candlelight.<p><p>“The tradition of visiting the cemetery certainly fits in well with our idea that Christmas is a family festivity, and a time of peace,” says Lehto. “Though actually for most Finnish families Christmas Eve ends up being a very hectic day, with a trip to the cemetery on top of other compulsory rituals like the huge Christmas meal, the Christmas sauna and the eagerly awaited arrival of Santa Claus!”<p><p> <p><p>By Fran Weaver<p><p> <p><p><p><p>Light in the darkness<p><p>A hectic time of peace<p>", "time": "2015-12-19T22:00:00+00:00", "type": "christmas"}
{"title": "Oh-so-sweet Finnish Christmas! - thisisFINLAND", "url": "https://finland.fi/christmas/oh-so-sweet-christmas/", "review": "", "content": "<p>There is plenty to satisfy Finland’s collective sweet tooth as Christmas approaches, from candy and chocolate to hot drinks and pastries.<p><p>It only comes once a year, which is just as well for the Finnish national waistline, but an endless roll call of traditional treats heralds the arrival of the Christmas season. The New Year diet will come soon enough, so tuck into a visual feast on a Helsinki tour of seasonal Finnish goodies to get you in the festive mood.<p><p>Glögi, the essence of Finnish Christmas: the aroma of cloves and cinnamon from steaming hot juice or wine with almonds and raisins. Photo: Tim Bird<p><p>Home made jams, jellies and mustards at a Helsinki Christmas fair. Photo: Tim Bird<p><p>The heartening smell of roasted chestnuts has become part of Finnish Christmas in recent years. Photo: Tim Bird<p><p>Sugar-coated green jellies, called Vihreät kuulat (Green cannonballs) are a familiar feature at many festive celebrations. Photo: Tim Bird<p><p>Cane candy at the St Thomas Christmas market in Helsinki’s Senate Square. Photo: Tim Bird<p><p>Rice porridge sprinkled with cinnamon is a festive favourite, especially for kids looking for the ‘good luck almond’ concealed in the bowl. Rice porridge is a common breakfast on Christmas Eve. Photo: Tim Bird<p><p>The star-shaped Finnish ‘joulutorttu’ or ‘Christmas tart’ is a sugar-sprinkled puff pastry topped with a dollop of plum jam. Photo: Tim Bird<p><p>The Christmas bun ‘joulupulla’ is adorned with a gingerbread star and flavoured with cardamom. Photo: Tim Bird<p><p>Finland, as everyone knows, is the home of the real Father Christmas, so it’s only right that he should also be present in chocolate form. Photo: Tim Bird<p><p>Sugar snow sprinkles on a chocolate snow globe in Stockmann department store’s annual Christmas window. (Spoiler: it is not edible!) Photo: Tim Bird<p><p>Gingerbread cookies are part of the Christmas package. In fact, for many Finns eating the raw gingerbread dough is part of the fun when baking these Christmas delicacies. Photo: Tim Bird<p><p>A ‘gingerbread Helsinki in 1850’s’ created by Helsinki pre-school children was constructed at the Museum of Finnish Architecture. Photo: Tim Bird<p><p>Chocolate CD greeting cards at the Old Market Hall in Helsinki. Don’t try playing these on your hi-fi! Photo: Tim Bird<p><p>Wishing you ‘Hyvää joulua’ – Merry Christmas – every time you eat one of these handmade chocolates. Photo: Tim Bird<p><p>Strawberry and cranberry juice for hot Christmas drinks at Helsinki’s Market Square. Photo: Tim Bird<p><p>By Tim Bird<p>", "time": "2015-12-17T11:11:45+00:00", "type": "christmas"}
{"title": "Finnish Christmas markets brighten winter - thisisFINLAND", "url": "https://finland.fi/christmas/finnish-christmas-markets-brighten-winter/", "review": "", "content": "<p>Christmas markets are in vogue across Europe, but in Finland they form a long-time tradition. It’s a great time for local artisans to brighten up the early winter with their brilliantly coloured handicrafts. (See our slideshow below.)<p><p>A visit to one of Helsinki’s various Christmas markets is one of the traditional preparations for the festive season in the Finnish capital. In late November the crowds gather on Senate Square, where the city has put up a massive Christmas tree, to watch the lights go on as the Christmas season is officially opened. A couple weeks later, food and crafts stalls open on the square itself for Saint Thomas’s Market .<p><p>At the other end of Alexander Street, the stalls by the Three Smiths statue offer a daily fare of hand-knitted socks, felt slippers, hats and home-made conserves. The Women’s Christmas Fair at Wanha Satama Trade Fair Centre dates back a century to a time when women took what was a rare opportunity to make money for themselves.<p><p>Christmas fairs and markets thrive in Finland’s other towns and cities, not only the capital. The aroma of glögi (Glühwein or mulled wine) fills the chilly air, brass bands play favourite carols and the flames of outdoor candles fill the town squares with the illusion of warmth. In these moments it’s easy to believe that Christmas was made especially for Finland.<p><p> <p><p> <p><p>As the low sun sets on Helsinki’s Lutheran Cathedral, the angels come out to watch the Christmas lights come on.<p><p>Woollen hats, socks and mittens make brilliant – and in the Finnish winter, very useful – Christmas presents.<p><p>Roasted chestnuts from Hartman Abenstein’s tent by the Three Smiths statue are a firmly established Helsinki tradition.<p><p>South American clothes sold from a stall on Keskuskatu (Central Street) add a cosmopolitan flavour to the Christmas proceedings.<p><p>Bright colours dominate on the stands at the Women’s Christmas Fair in the Wanha Satama (Old Harbour), a trade fair centre in Helsinki’s Katajanokka neighbourhood.<p><p>Cake-shaped soap bars, anyone? Christmas market ingenuity knows no limits.<p><p>They’re a great source of Christmas gifts, but why not treat yourself while you’re at it?<p><p>Jars of berry conserves and mustard piled high at the Women’s Christmas Market.<p><p>Felt hats – hand-crafted chic, and very warm as well.<p><p>Market shoppers in Porvoo, drag home the traditional Christmas tree.<p><p>Father Christmas drops into the Christmas market to supervise proceedings on the main square in the southwestern city of Turku.<p><p>Candles and jewellery make perfect presents in Turku’s Christmas market.<p><p>Santa’s little helpers take a break in Turku’s Old Town Christmas Market.<p><p> <p><p> <p><p>Text and photos by Tim Bird<p><p>Brilliant Christmas colours<p><p><!-- 1 --><p>", "time": "2015-01-05T19:23:00+00:00", "type": "christmas"}
{"title": "Top 5 Finnish Christmas foods - thisisFINLAND", "url": "https://finland.fi/christmas/top-5-finnish-christmas-foods/", "review": "", "content": "<p>Photo: Visit Finland<p><p>The undisputed winner was baked ham, king of the Finnish Christmas dinner. Most Finns could not imagine Christmas without ham. Slowly baking the ham in the oven is one of a Finnish Christmas ritual. Ham tastes best with homemade mustard. Any leftover ham is usually added to pea soup after Christmas. Delicious!<p><p>Photo: Visit Finland<p><p>Surprisingly, number two was rutabaga casserole. All the Christmas casseroles were popular, but this one topped them all. Casserole dishes, Finnish cuisine at its best, can easily be prepared a few days in advance.<p><p>Photo: Jaana Rantala/Visit Finland<p><p>Who could resist these pastries filled with plum jam? Of all the Christmas desserts, these were the overwhelming winner among our readers. The aroma of freshly baked pastries goes a long way towards getting you in the Christmas spirit. Dust your star-shaped delights with powdered sugar when they have cooled off. Eat, enjoy and repeat!<p><p>Photo: Päivi Niemi/Visit Finland<p><p>What could be more comforting than bowl of steaming rice porridge? Usually the porridge is served with sugar and cinnamon on top. Some prefer it with a fruit broth known as “fruit soup.” Traditionally an almond is hidden in the pot of porridge. Whoever finds the almond in her or his serving gets to make a wish. Sometimes rice porridge is served for breakfast.<p><p>Photo: Taru Rantala/Visit Finland<p><p>The scent of cinnamon, cloves and nutmeg is inseparable from Finnish Christmas. It comes from baking gingerbread cookies. The dough is delicious by itself, especially if you ask your children. How much of it actually makes it to the oven without getting eaten? Many of our Facebook readers mention that they drink warm glögi (mulled wine) with their cookies.<p><p>By Tiina Krook, December 2014<p><p>1. Baked ham (Kinkku)<p><p><p><p>2. Rutabaga casserole (Lanttulaatikko)<p><p><p><p>3. Christmas pastries (Joulutorttu)<p><p><p><p>4. Rice porridge (Riisipuuro)<p><p><p><p>5. Gingerbread cookies (Piparkakut)<p>", "time": "2014-12-13T21:49:00+00:00", "type": "christmas"}
{"title": "Films project Finnish view of Christmas - thisisFINLAND", "url": "https://finland.fi/christmas/films-project-finnish-view-of-christmas/", "review": "", "content": "<p>Movies can make a significant contribution to the holiday atmosphere, and Finland has produced its fair share of classic Christmas flicks over the years. Santa Claus, who lives in Finnish Lapland (as everyone knows), forms a focal point in these films.<p><p><p><p>Niko is a young reindeer whose mother told him that his father is one of Santa’s elite flying reindeer. However, Niko is afraid of flying, and his dreams of flight are ridiculed by the other youngsters. Niko leaves the comfort of his home valley to learn to overcome his fear and find Santa’s secret hideout. He faces wolves and many other dangers, but in the end Niko saves the day and finds his father. Also known as Niko and the Way to the Stars, The Flight before Christmas is a classic, warm-hearted, uplifting Christmas animation for the whole family. A sequel appeared in 2012, called Niko 2: Little Brother, Big Trouble – A Christmas Adventure (original title: Niko 2: Lentäjäveljekset).<p><p>“Christmas Story” reveals details of the life and background of Santa Claus.Courtesy of Snapper Films<p><p>If you’ve ever wondered how Santa Claus became what he is, this movie is for you. It tells the story of Nikolas, a young boy who lives in Finnish Lapland. His family is killed in an accident and the village decides to care for him communally. In gratitude, Nikolas whittles toys for the children of the families that care for him. Eventually he ends up an apprentice for a grumpy carpenter and continues to make gifts for the children of the village. A tradition is born and it occupies more and more of his life every year, until as an old man he embodies the tradition and becomes Santa Claus. Something beautiful and joyful is born out of a great tragedy.<p><p>The big mystery: Who is interfering with Santa’s work?Illustration: Mauri Kunnas/Otava/Yle<p><p>Based on a book by Finnish author and illustrator Mauri Kunnas (published by Otava), Santa Claus and the Magic Drum takes place at Santa’s workshop. It’s almost Christmas Eve and Santa’s busy compound is beset by a series of mysterious mishaps that jeopardise Christmas. The culprit turns out to be a shaman and his magic drum, bent on making trouble due to an unfortunate delay of several decades in the processing of a letter he sent to Santa Claus as a child. This energetic animated movie offers something for everyone, from toddlers to senior citizens. It combines the kind of hijinks that children love with sly references only adults will get. In other words, it’s a perfect animated movie.<p><p>Behind bars: “Rare Exports” features Santa as you’ve never seen him before.Courtesy of SF Film Finland<p><p>Rare Exports puts Christmas myths in the blender with some classic horror movies and comes out with a cocktail for the discerning Christmas film connoisseur, featuring Santa Claus as you’ve never seen him before. Roger Ebert, the legendary movie critic for the Chicago Sun-Times, said, “Rare Exports: A Christmas Tale is a rather brilliant lump of coal for your stocking hung by the fireside with care.” He’s right. It’s a holiday movie with an edge, so watch one of our other suggestions during the day and break out Rare Exports after the kids are in bed.<p><p> <p><p>By Arttu Tolonen, updated December 2014<p><p><p><p>The Flight before Christmas (original title: Niko – lentäjän poika, 2008)<p><p>Christmas Story (orig. Joulutarina, 2007)<p><p>Santa Claus and the Magic Drum (orig. Joulupukki ja noitarumpu, 1996)<p><p>Rare Exports: A Christmas Tale (orig. Rare Exports, 2010)<p>", "time": "2014-11-27T13:02:00+00:00", "type": "christmas"}
{"title": "The original Finnish Christmas ornament - thisisFINLAND", "url": "https://finland.fi/christmas/the-original-finnish-christmas-ornament/", "review": "", "content": "<p>The himmeli, a traditional Finnish holiday decoration made out of straw, remains popular today. We take a closer look at the ornament’s many forms and talk to himmeli maker Eija Koski.<p><p>Although the root of the word “himmeli” is Germanic – in Swedish and German himmel means “sky” or “heaven” – and different versions of this straw mobile can be found in other Nordic countries, the himmeli is considered the quintessential traditional Finnish Christmas decoration.<p><p>Eija Koski shows off a himmeli she made at an exhibition held by Verkaranta Handicrafts and Design Centre in the city of Tampere. Photo: Emilia Kangasluoma<p><p>Back in the olden days, himmelis hung above dining tables to ensure a good crop for the coming year, and stayed on display from Christmas till Midsummer. The structure of a himmeli – especially a bigger and more complex one – is visually striking, with geometrical shapes made out of hundreds, or even thousands, of pieces of straw.<p><p>According to connoisseurs the best himmelis are made out of rye, the grain with the longest and sturdiest stems. A well-kept himmeli can last up to a hundred years. In modern interpretations, the materials vary from plywood to paper and even plastic straws. Recent years have seen a himmeli boom in Finland.<p><p>Himmelis have branched out from the traditional diamond shape as enthusiasts explore new possibilities. Photo: Emilia Kangasluoma<p><p>Himmeli maker Eija Koski’s childhood memories go back to her aunt’s farmhouse in Finland’s Northern Savo region, where a himmeli was always on display for Christmas.<p><p>“I remember how I used to stare at the himmeli slowly swaying with the draft while the adults were just talking,” says Koski. “I became enchanted by it!” Twenty years later Koski went to a course on how to make a himmeli. “At that moment I just knew that this was my thing!”<p><p>Eventually she became a himmeli artist and she is currently fully dedicated to himmelis: She travels round the country teaching courses, she has shown her work in innumerable exhibitions and her book, Himmeli (published by Maahenki, 2012), is in its third printing.<p><p>According to Koski, the himmeli boom is part of the slow movement. “I think people are looking to reconnect with their heritage,” she says. “Artisanal handicrafts are becoming more popular.” Often the himmeli-making courses are attended by “urban-style youngsters, and not just women but also men.”<p><p>Koski, who lives in a farm near Vaasa, on the west coast of Finland, uses only organic rye from her own field to make her himmelis. She selects and hand cuts her own rye straws. Even though himmelis seem quite geometrical and architectural, “it’s easy to become addicted,” she says. Many designers consider the himmeli more of a sculpture than an ornament.<p><p>Koski says of himmelis that she “couldn’t imagine Christmas without them”.Photo: Emilia Kangasluoma <p><p>A few years ago Koski received a call from Japan asking if she would be willing to host a Japanese graphic designer who is interested in himmelis. “Well, you can imagine that I was quite surprised at that call!” Koski explains enthusiastically.<p><p>Mutsuko Yamamoto travelled to Vaasa from Sapporo, the northernmost island of Japan, and spent three days as an apprentice at Koski’s farm.<p><p>Yamamoto first spotted a himmeli in the window of the Artek design shop in Helsinki during a Christmas visit. Subsequently Yamamoto became a himmeli artisan, and also teaches the craft to others. Himmelis seem to strike a chord with people in Japan. Yamamoto’s himmelis have even been on display at a Finnish design shop in Tokyo.<p><p>Koski, who has a himmeli in every room of her home, “could not imagine Christmas without them.”<p><p>By Carina Chela, December 2013<p><p>The enchanted artist<p><p>Japan and Finland joined by a himmeli<p>", "time": "2014-12-16T11:12:00+00:00", "type": "christmas"}
{"title": "The Finns dream of a green Christmas - thisisFINLAND", "url": "https://finland.fi/christmas/the-finns-dream-of-a-green-christmas/", "review": "", "content": "<p>It sometimes feels like Christmas has lost its traditional significance and become a celebration of excessive consumption. Finnish environmental organisations offer many tips for if you’d like to find more sustainable ways to enjoy the festivities without missing any of the fun.<p><p>“It’s good to try to have a greener Christmas, but this doesn’t mean you can’t splash out a bit and enjoy the festivities, since the routine consumption choices you make the other 364 days of the year have a lot more impact than Christmas alone,” says Jussi Nikula, head of WWF Finland’s ecological footprint programme.<p><p>Christmas is famously a time for giving. But Finnish green organisations are increasingly encouraging people to give non-material presents instead of unwanted stuff that will just clutter up our homes. “If you think about what really makes people happy, the best way to celebrate is often to take someone out and share some experience together, perhaps going to a show or an exhibition,” says Nikula. Elderly people who live alone may especially welcome such gifts of shared time.<p><p>Charities including FinnChurchAid, WWF and World Vision Finland run popular schemes that enable people to give potentially life-changing or even life-saving presents to needy people in developing countries on behalf of friends or relatives who already have more than enough themselves.<p><p>Finnish dishes such as beetroot salad and root vegetable casseroles are environmentally favourable, as they use seasonally available, locally grown vegetables. Photo: Jussi Nukari/Lehtikuva<p><p>Nikula points out that the three main aspects of our personal ecological footprints all year round relate to transport, food and housing. These also form the main issues to think about when planning a green Christmas.<p><p>“When it comes to Christmas food there really is a tendency towards overconsumption,” Nikula says. “The most important thing is to avoid buying too much food, and to avoid waste by freezing or creatively using any leftovers.”<p><p>The centrepiece of the Finnish Christmas table is typically a huge ham. “In reality, a much smaller ham would be better for most families, leaving more room for other traditional Finnish dishes like beetroot salad and root vegetable casseroles made of seasonally available, locally grown vegetables, which are environmentally favourable,” says Nikula.<p><p>Fish also features prominently on festive tables around Finland. Traditional salted herring starters and other sustainably fished species are favourable, rather than fish from overexploited stocks such as wild salmon. WWF Finland publishes a detailed guide to sustainably managed fish stocks.<p><p>The most common Finnish Christmas dessert is rice porridge with prunes. Nikula suggests going back to an earlier tradition when the porridge was made from locally grown barley.<p><p>No need to make your garden look like Las Vegas when you can create a lantern using ice and a candle. Photo: Matti Kolho/Visit Finland <p><p>“Christmas is also a time when many people like to travel to visit relatives or take a holiday, and your choice of how you travel is a potential pitfall if you’re trying to enjoy a greener Christmas,” says Nikula. “The climate impact of flying to Thailand for Christmas probably far outweighs anything you could possibly do at home.”<p><p>A surprising number of spruce trees are imported into Finland from specialised Christmas tree plantations in Denmark or Estonia, even though this might seem like shipping sand to the Sahara. The WWF recommends buying locally sourced trees, and especially the attractive lopped-off tops of larger spruce trees that have been cut down for other commercial uses.<p><p>Christmas lights and candles are widely used in Finland to brighten up the winter darkness. But there’s no need to make your garden look like Las Vegas when you can create a much nicer atmosphere with a few candles strategically placed in traditional Finnish lanterns made from snowballs or from upturned buckets of frozen water.<p><p>“When buying Christmas lights, look for durable, low-energy options,” says Nikula. “And if you use those popular, small, tea-light candles, it’s very important to collect their aluminium cup containers for recycling, since aluminium has a huge environmental footprint.”<p><p>Environmental organisations encourage the use of e-cards, emailed electronic greeting cards, to save on envelopes, cards and postal services, though WWF also sells wildlife-themed Christmas cards and uses the proceeds to fund the organisation’s global nature conservation work.<p><p>“Making Christmas greener can ultimately be quite simple,” Nikula says. “Give time and shared experiences to your loved ones instead of material gifts; avoid wasting food; and think about how you travel during the holidays.”<p><p>By Fran Weaver, November 2013<p><p>Reining in the festive foods<p><p>Green yuletide choices<p>", "time": "2013-12-09T12:59:00+00:00", "type": "christmas"}
{"title": "A busy season for giving - thisisFINLAND", "url": "https://finland.fi/christmas/a-busy-season-for-giving/", "review": "", "content": "<p>Christmas is the busiest time of the year for charities. We visit two highly appreciated Finnish organisations; one helps the homeless and the other gives gifts to people who are far from home.<p><p>Every Christmas since 1967 a special party has been held for homeless, impoverished and lonely people in Helsinki by a unique charity established by Veikko Hursti. This multitalented artist drifted into alcoholism and delinquency before experiencing a spiritual awakening that led him to dedicate the rest of his life to charitable work, aided by his wife Lahja (whose name happens to mean “gift” in Finnish).<p><p>Veikko Hursti died in 2005, but his son Heikki carries on his work. The guests will enjoy a musical programme and a traditional Finnish Christmas dinner with ham and all the trimmings, before receiving gift packages containing food and clothes.<p><p>“We get help from some companies who provide food, and free use of the sports hall from the city, but otherwise we are absolutely dependent on private donors for funds,” says Hursti. “But thanks to my parents’ dedication, our work is well known and trusted in Finland, and we get lots of generous donations and help from volunteers.”<p><p>The charity’s other annual events include a leftovers party in the sports hall on December 26 and an outdoor concert and soup kitchen in Helsinki’s Hakaniemi Square on Independence Day (December 6), run as a counterpoint to the President’s glamorous televised ball on the same evening.<p><p>Hursti’s charity also distributes food and clothes twice weekly in Helsinki. “Recently these handouts have been attracting up to 1,000 people, which shows how many people are struggling in today’s worrying times,” he says.<p><p>A stock of stockings: The Seamen’s Mission distributes home-knitted woolen socks and other Christmas gifts to sailors who are far from home.Photo: Marko Toljamo<p><p>Another greatly valued Christmas charity is organised by the Finnish Seamen’s Mission to provide gifts for Finnish seafarers working far from home at Christmastime, and for foreign sailors marooned in Finnish ports.<p><p>“This collection has been going on since the 1870s, when ladies’ sewing circles from Finnish parishes started to knit socks, scarves, gloves and woolly hats for ‘unknown seafarers’,” explains pastor Jaakko Laasio. “The tradition is still going strong. This year we’ll send out nearly 1,500 Christmas packages to sailors in Finland and abroad. Most of the packages still come from these active parish sewing circles.”<p><p>Packages today might include chocolates and Christmas candles, as well as ever-popular winter woollies. “The gifts are not expensive,” says Laasio. “The idea is to make a gesture to share the Christmas feeling. Seafarers really value such gifts, and many thank donors by sending them postcards from exotic ports.”<p><p>The Seamen’s Mission runs chapels in eight Finnish ports, where presents are delivered to ships just before Christmas, and special ecumenical Christmas services are held.<p><p>Loads of gifts: Pastor Juha Rintamäki of the Seamen’s Mission takes a turn carrying gifts up the gangplank.Photo: Marko Toljamo<p><p>Gifts destined for foreign ports are shipped in November from Helsinki’s Vuosaari Harbour to the Seamen’s Mission’s seven overseas outposts in Hamburg, London, Antwerp, Rotterdam, Piraeus, Lübeck and Brussels.<p><p>Pastor Heikki Rantanen emphasises that the Seamen’s Mission also serves exiled Finnish landlubbers who might feel homesick as Christmas approaches. “In our overseas bases we organise popular Christmas bazaars with Finnish food and design items, as well as carol singing evenings and Lutheran Christmas services,” he explains. “These events are intended for tourists, au pairs, lorry drivers and emigrants such as EU employees in Brussels, as well as sailors – and they also attract many local people interested in Finnish Christmas traditions. For many Finns abroad, coming to the Finnish Church is not only a spiritual experience, but part of their identity.”<p><p>When darkness falls over Finland in late December, Rantanen has the enviable task of taking the Christmas message to communities of exiled Finns in sunny Southeast Asia.<p><p>By Fran Weaver<p><p>Charity close to home<p><p>Socks for seafarers<p><p>Overseas outposts for homesick Finns<p>", "time": "2013-12-03T13:11:00+00:00", "type": "christmas"}
{"title": "Adding the sparkle to Christmas - thisisFINLAND", "url": "https://finland.fi/christmas/adding-the-sparkle-to-christmas/", "review": "", "content": "<p>Finland is home not only to Santa Claus, but also to the Nordic countries’ only manufacturer of Christmas decorations. Weiste is a family company still run by the grandchildren of the original founder.<p><p>It has been established without doubt that the only true home of Santa Claus is in Finland, in spite of the scandalous counterclaims of certain Nordic neighbours. So it’s appropriate that the only manufacturer of Christmas decorations in the Nordic region is a Finnish family company.<p><p>It is even more fitting that the company, K.A. Weiste Ltd, should have its head office and main factory in the Helsinki suburb of Pukinmäki (Goat Hill), since the Finnish name for Santa Claus is Joulupukki (literally: Christmas goat).<p><p>Weiste is very much a family affair, with five siblings still involved in company matters, representing the third generation since schoolteacher Kalle Aimo Weiste got the Christmas tree ball rolling in 1924. Those family members still have homes in the vicinity of the Pukinmäki factory, presiding over a business that has weathered wars and economic downturns for more than 85 years.<p><p>The sparkle of a Christmas showroom: Helena Friman is already planning next year’s Weiste catalogue.Photo: Tim Bird<p><p>She may have the telltale glint of tinsel on her cheek and the sparkle of a Christmas showroom in her eye, but product manager Helena Friman claims that seasonal decorations are a business like any other. But isn’t it like having Christmas every day? “These are products, this isn’t really Christmas itself,” she says. “And we feel the stress of Christmas long before anyone else.”<p><p>It’s mid-November and the first significant snow is gathering on the trees outside the showroom window. A Weiste truck with “Christmas legend” inscribed across it is being loaded with decorative deliveries. The hard graft for this Christmas is winding down; now Friman is anticipating preparations for next year’s season, with the production of a catalogue illustrating 800 individual varieties of baubles, stars and packs of tinsel, as well as participation in trade fairs.<p><p>“We make our tinsel here in Pukinmäki, and we are one of the biggest tinsel producers in Europe,” she says, adding that the company has two other facilities, in Hanko and Veikkola.<p><p>Baby’s First Christmas: These are some of Weiste’s most popular baubles.Photo: Tim Bird<p><p>Flagship products include silver stars for the top of the Christmas tree and the very successful “Baby’s First Christmas” coloured bauble sets. Weiste is well known in the domestic market but 80 percent of its production is destined for export, with France and the UK accounting for the majority and other important customers in Russia and Norway.<p><p>“The Chinese and other Asian producers are much bigger than us, but we know we are an important producer because the others follow us closely,” says Friman. “If we produce something new, we see that the others will follow. We have concentrated on certain items and on good quality with unique design. Our tree baubles are shatterproof, for example.”<p><p>Such attention to detail should banish forever those familiar little Christmas disasters, resulting in tiny shards of coloured glass at the bottom of the tree. But increased durability doesn’t prevent people from buying more Christmas decorations every year. Even the wonderful world of tinsel sways with changing trends and fashions.<p><p>A filigree butterfly graces a Christmas tree.Photo: Tim Bird<p><p>“Of course, there are always Christmas tree baubles, but the preferences for colours change,” Friman notes. “Even so, the most popular colours are the traditional ones – silver, gold, red, snow white. There is also a bigger market for table decorations, not only tree decorations. We play around with snowflakes, reindeer and flowers, for example, and patterns and shapes of tinsel. My own favourite is a filigree butterfly.”<p><p>Weiste’s resourcefulness saw it through the war years, when it produced braid and other items for the Finnish army. In any case, as Friman points out, it can be reasonably sure of one thing: recessions my come and go, but “Christmas will always come, every year.”<p><p>By Tim Bird<p><p>Christmas legend<p><p>Leading by design<p><p>Snowflakes, reindeer and flowers<p>", "time": "2013-12-02T13:31:00+00:00", "type": "christmas"}
{"title": "Home in time for Christmas in Finland - thisisFINLAND", "url": "https://finland.fi/christmas/home-in-time-for-christmas-in-finland/", "review": "", "content": "<p>After more than a decade abroad, a Finnish journalist concludes that Finland must be the home of not only Santa Claus, but also of Christmas spirit.<p><p>Living in the US from 1998 until 2009, my time spent at home in Finland was split into two romantic extremes: The glimmering, airy summer and the candlelit, clove-scented Christmastime.<p><p>Because of school and university schedules, I rarely had the opportunity to return to Finland during other times of the year. And while my work schedule led me to forego a few summer trips home after my parents returned to Finland in 2002, the thought of staying in North America for Christmas never crossed my mind.<p><p>For the Finns, this glowing holiday represents a midwinter oasis.Photo: Vesa Greis/Kuvaliiteri<p><p>The holidays of one’s childhood are usually difficult to live down, but after experiencing the preholiday bustle of several American cities, I’m convinced that Finland shouldn’t only take credit for being Santa Claus’s country of residence. I dare to say that the entire notion of Christmas spirit, addressed in countless Hollywood films and Christmas cards, should be attributed to this sparsely populated corner of the world.<p><p>It’s not that our population throws glitzier holiday parties than the rest of the world or has a deeper connection to the religious roots of Christmas, but that, simply enough, our unforgiving climate lends added meaning to this celebration of light. To Finns, this glowing holiday has historically served as a figurative oasis in the middle of the frostiest, darkest time of the year, and we consequently approach it with distinctive humility.<p><p>Now, “humility” has nothing to do with abandoning the commercialism of Christmas. In my experience, Americans complain about Christmas decorations appearing in department stores in October just as much as Finns do, and our claim to Santa Claus also means that our focus on Christmas gifts is just as steadfast as that of American consumers.<p><p>However, unlike in the US, Christmas in Finland isn’t just another date in a series of holidays, each with its own decorations and cooking traditions. As the famously dreary Finnish autumn, void of the ubiquitous Halloween and Thanksgiving festivities of the US, turns into December, red candles and elves cut from construction paper begin to slowly appear in apartment windows and many of us catch a trace of the month-long anticipation we felt as children.<p><p>Christmas lights and candles ward off the dark of winter.Photo: Ismo Pekkarinen/Kuvaliiteri<p><p>Christmas in the US can feel like a rushed afterthought to Halloween and Thanksgiving – by the time families start plopping plastic snowmen on their lawns and coffee shops plug in their holiday playlists, Americans are already exhausted by the thought of yet another holiday.<p><p>The Finnish Christmas season builds gradually, like a row of Advent candles on a windowsill, from December 1 to Independence Day (December 6), Lucia Day (December 13) and Christmas Eve. And like one of our distinctively melancholy holiday songs contemplating subzero Nordic temperatures, the fragile nature of human life and our quest for inner peace, many of us begin feeling humble in the face of a harsh winter and grateful for the gentle, tangible glow of candles, however temporary.<p><p>In my childhood, some of the most important Christmas rituals fittingly stemmed from the idea of waiting for the holiday. In early December my mother and I gently unwrapped a family of elves made out of straw and paper mâché from a designated storage box (“They hibernate for the year,” she always said). Each Sunday morning my brother and I rushed to the breakfast table in our eagerness to be the one to light the next Advent candle. At school we rehearsed performances for both Independence Day and end-of-semester celebrations.<p><p>Thousands of people show up to hear the traditional Christmas Peace declaration in Turku on Christmas Eve.Photo: Esko Keski-Oja/City of Turku<p><p>When Finland was still inhabited mainly by peasant farmers, Christmas often marked the only day of the year when families could enjoy an abundant feast. Times have certainly changed, and these days very few in this country have to go hungry or live under the threat of war. Still, one reminder of our humble, uncertain roots still brings out the masses on December 24: the annual declaration of “Christmas Peace” in the city of Turku.<p><p>The tradition can be traced back to the Middle Ages, and continues to be held at the town’s Old Great Square. For as long as I can remember, my mother has made the live broadcast of this event required viewing for the entire family, and despite occasional protests, my brother and I have joined her in front of the TV each year.<p><p>“A general Christmas peace is declared, encouraging everyone to observe this celebration with appropriate devotion and otherwise behave quietly and peacefully,” reads the chief secretary of the city of Turku from a roll of parchment.<p><p>Year after year, I watch thousands of couples, families, toddlers and grandparents look on quietly as the chief secretary reads these words. Wearing fur coats, wool caps and ski jackets, their exhalations become visible in the frozen air as they proceed to sing the Finnish national anthem.<p><p>At least in my book, there isn’t a more appropriate day than this to feel patriotic – or to be thankful that there is such a thing as Christmas.<p><p>By Laura Palotie, December 2009<p><p>Celebration of light<p><p>Candles keep cold at bay<p><p>Peace is declared<p>", "time": "2013-12-02T12:26:00+00:00", "type": "christmas"}
{"title": "Classic Christmas merges with modern flavours - thisisFINLAND", "url": "https://finland.fi/christmas/classic-christmas-merges-with-modern-flavours/", "review": "", "content": "<p><p><p> <p><p>Executive chef Jarkko Nieminen at Kulosaaren Casino carries the restaurant’s Christmas buffet tradition into the future with new options and strong traditions.<p><p>For many Helsinkians, a holiday lunch or dinner in Kulosaaren Casino’s spacious seaside dining room is an annual tradition. Each December, the 94-year-old restaurant features a traditional, plentiful Christmas buffet that includes staples like ham, beetroot salad and a varied selection of fish.<p><p>As the restaurant’s executive chef, Jarkko Nieminen is responsible for ensuring that the buffet both retains its culinary sophistication and continues to please those with more conservative taste buds. While trends in dining change, Kulosaaren Casino is also synonymous with tradition.<p><p>“I have enormous respect for the history and customs of this place,” Nieminen says. “I love classic food and strong, distinct flavours, but I also try my best to merge them with today’s eating habits and styles. We’ve received a lot of positive feedback on the buffet over the years, so I’ve aimed to continue with that same style but add new things here and there.”<p><p>“I have enormous respect for the history and customs of this place,” Jarkko Nieminen says.Photo: Markus Nieminen<p><p>Nieminen says he incorporates modern touches into his buffet selections by seasoning traditional dishes like pâtés in new ways and creating new varieties of sauce and gravy. And during a time when more and more consumers are focusing on sustainability or opting for a vegetarian diet, he is happy to modify his menu accordingly.<p><p>“This year I’ve narrowed our fish selection a bit and brought more vegetables into the menu,” he says. “We’re going to feature a beet terrine, for example, that will provide more options for a vegetarian customer.”<p><p>“Relatively few of our usual customers are vegetarians, but vegetarian food is still part of today’s food culture and will continue to be so in the future. Today’s restaurants simply have to offer vegetarian options.”<p><p>Nieminen possesses a fondness for tradition – at his family’s Christmas table, he is the guardian of his grandfather’s top-secret Baltic herring recipe. However, he also encourages Finns to add more kick to the traditionally subdued flavours of their Christmas food.<p><p>“Finns like the taste of salt and grease, and don’t often use spices that could bring more depth to the flavours; we could easily experiment more with spices,” he says. “Middle Eastern spices like cardamom and nutmeg that we already associate with Christmas could be used in larger quantities, and exotic fruits like mangos and melons are also an excellent fit for the Christmas table.”<p><p>Bring the cream and milk, along with a pinch of cloves, to a boil. Add the artichokes and boil until cooked. Puree into an even mixture and add the cheese and agar powder. Season with salt and black pepper. Pour the puree into dishes and place them in a cold place to set.<p><p>Mix all the ingredients together and spread them out in a casserole pan so that the beets gather plenty of flavour. Bake the beets in 200 degrees until cooked.<p><p>Heat the cream in a pot and add the cheese. Let this cheese-and cream mixture cool overnight. Whip the crème fraîche into a froth and blend it with the cream and cheese mixture. To garnish, sprinkle with blue cheese and chives.<p><p>Glaze the shallots in olive oil. Add the mushrooms, blackroot and rice. Let heat for about three minutes. Add vegetable broth gradually and boil until the rice is cooked. Add lemon juice, parmesan and mascarpone. Season with salt and pepper. Garnish with fresh herbs.<p><p>By Laura Palotie<p><p><p><p>Modern touch<p><p>More kick<p><p>Nieminen’s creative vegetarian options<p><p>Bavaroise<p><p>Roasted beets<p><p>Blue cheese mousse<p><p>Yellow foot mushroom risotto<p>", "time": "2013-12-02T08:16:00+00:00", "type": "christmas"}
{"title": "Free-range duck and tangy ice cream - thisisFINLAND", "url": "https://finland.fi/christmas/free-range-duck-and-tangy-ice-cream/", "review": "", "content": "<p>With chef Marko Palovaara at the helm, Restaurant Nokka fuses organic Finnish ingredients into distinctive Christmas gourmet.<p><p>Restaurant Nokka, located in a former industrial building in the seaside neighbourhood of Katajanokka in Helsinki, draws culinary inspiration from Finland’s earthy flavours. The restaurant collaborates one-on-one with growers and fishermen around the country, and aims to ensure that even its selection of vegetables, whenever possible, comes from local sources.<p><p>In preparing Nokka’s Christmas menu, executive chef Marko Palovaara has experimented with textures and spices to add complexity to well-known recipes. At the centre of the menu, for example, is a locally grown free-range duck served with a honey-almond glaze. It’s a dish Palovaara calls “Nokka’s Christmas spectacle”.<p><p>“Our palette of flavours is very Finnish, but I still aim to bring something new into it,” Palovaara says, sitting in his restaurant during the quiet hours between lunch and dinner. “If we advertise something as rosolli [Scandinavian beet salad], it’s not necessarily made of vegetables cut into cubes and mixed with herring. Our beet salad is a mixture of pickled potato and apple with a beetroot cream, and we’ve flavoured the herring in our own way, using things like cloves.”<p><p>Having grown up in Kolari, a town located in Finnish Lapland, Palovaara says that warm porridge in the morning and reindeer meat alongside ham at the dinner table were part of his family’s Christmas tradition – food, he adds, was a much more crucial component of the holiday than presents. Palovaara recalls one Christmas during his years as a culinary student when he decided to make spontaneous use of the minus 35 degree temperature outside to make lingonberry ice cream.<p><p>“We didn’t have an ice cream maker, so I stuck a steel bowl into the snow and came outside every 15 minutes or so to mix it,” he says with a smile. “It turned out really tasty, and quickly.”<p><p>Lack of pretentiousness: The seaside setting forms the perfect place to enjoy Nokka’s palette of Finnish flavours.© Royal Restaurants<p><p>To Palovaara, Finnish Christmas food is made unique by its lack of pretentiousness, its use of simple flavours like potato, rutabaga and beetroot, and its connection to the country’s history.<p><p>“It’s wonderful that we use so many root vegetables in our Christmas food,” he says. “It’s a custom that comes from a time when Finns lived on relatively little and harvested vegetables in the fall to use throughout the winter. Of course we eat ham, which is greasy, but other than that we eat simple, healthy food during the holidays.”<p><p>“The only thing I’d change about our customs is maybe incorporate shellfish in the menu, lobster and things like that, the way Norwegians and Swedes do,” he says.<p><p>(serves 6–8 people)<p><p>Peel and finely chop the shallots and the garlic. Glaze the livers in a pan with onions and allow them to stew until done. Do not throw away the broth. Grind the cooked livers in a food processor and flavour them with a splash of the broth in which you glazed them. Let the liver cool. Whip butter into the mixture and season it with salt and black pepper.<p><p>Bring the white wine to a boil and add the jam sugar. Add the insides of the figs and let stew until the mixture thickens a bit.<p><p>(6–8 people)<p><p>Make cuts into the fat of the duck and fry in a pan until crispy – begin while the pan is still cold. Roast the breast pieces in 180 degrees in the oven for about seven minutes and glaze them with honey and muesli. In order for the flavours to be absorbed, cover and let sit for 15 minutes before cutting. Cut the breast pieces into slices.<p><p>Simmer the legs in duck fat until done. Remove the bones and reshape the legs.<p><p>Roast the nuts in the oven. Mix the ingredients together and sprinkle them on top of the meat, glazed with honey.<p><p>Peel and chop the vegetables and the apples. Roast them in a splash of olive oil for a moment. Add the vinegar and reduce until almost dry. Add the red wine and allow it to boil until half of it has evaporated. Add the duck stock, sugar, cardamom, white pepper, thyme and bay leaf. Let boil for about an hour. Strain the sauce and season with salt and a piece of cold butter.<p><p>Grind the red cabbage with a knife. In a pot, glaze the cabbage in duck fat. Add a sliced apple and a ground onion, and let simmer for a short while. Finally, add the vinegar, the red wine and a bag of seasoning, and let stew for about an hour.<p><p>By Laura Palotie<p><p>Ice cream in winter<p><p>Culinary roots<p><p>Palovaara’s duck suggestions<p><p>Mousse of duck liver paté with fig compote<p><p>Fig compote<p><p>Roasted duck breast, red cabbage and cardamom sauce<p><p>Muesli <p><p>Cardamom sauce <p><p>Red cabbage <p>", "time": "2013-12-02T08:06:00+00:00", "type": "christmas"}
{"title": "Challenging ham with herring - thisisFINLAND", "url": "https://finland.fi/christmas/challenging-ham-with-herring/", "review": "", "content": "<p>How does a chef known for his “small is better” approach tackle Finnish Christmas dinner – a meal often marked by thick slices of ham, mounds of creamy casserole and plum pastries made from butter-infused dough?<p><p>Antti Ahokas is executive chef at Finnish tapas restaurant Juuri in Helsinki. Actually they call it a sapas restaurant, so that the first letter matches with Suomi, the Finnish word for “Finland”.<p><p>“Finnish fish is unbelievable, and I appreciate the traditional use of mushrooms and root vegetables, but our Christmas food tends to include excessively heavy stuff,” says Ahokas, sitting at a table in Juuri’s compact dining room in between kitchen shifts. “We may want to consider whether we need to have five different casseroles, or top the dinner off with a giant heap of pastries that no one has room for.”<p><p>Rather than serving up the traditional ham for Christmas dinner, he draws his inspiration from the sea. He simply focuses on what many Finns think of as the appetisers of a holiday meal.<p><p>Juuri executive chef Antti Ahokas (left) and cofounder Jarkko Myllymäki serve sapas and other Finnish specialities in a welcoming milieu.© Juuri<p><p>Plenty of Finns start off their Christmas dinners with gravlax (cured salmon), pickled herring or whitefish roe, but to Ahokas, the fish is the star of the meal. His favourite year-round food since childhood has been a clear fish soup prepared according to his grandmother’s recipe. She hailed from the Vironlahti Archipelago, part of present-day Russia.<p><p>Meanwhile, his mother’s Baltic herring pickled in mustard sauce is a staple at his family’s Christmas table to this day. Ham isn’t usually featured at the Ahokas family Christmas table, but as a result of Juuri’s collaboration with wild boar farmers in the Northern Karelia region of Finland, some of this non-traditional meat has found its way onto his menu at home.<p><p>“To add some variety to their Christmas dinners, people could try serving more dishes in smaller portions; an appetiser-size soup that incorporates seasonal flavours would be a good idea, for example,” he says.<p><p>“Don’t be afraid to use wild herbs or other traditional Finnish flavours like nettle; mix it into fish tartar or serve fish with a sour cream and nettle sauce,” he advises.<p><p>Remove the skin from the fish fillets. Place the skinless fillets in the vinegar mix and leave in the refrigerator. After five hours, pour the vinegar mix out of the dish; don’t rinse the fillets! Arrange the fillets and large pieces of dill in alternate layers in a glass jar. Prepare a sauce by whisking all the ingredients well until the mix is even. Pour the sauce over the fish, lifting pieces gently with the tip of a knife to make sure that the sauce reaches the bottom of the jar. Cover and refrigerate for two days. Once pickled, the fish will last for about a week.<p><p>Remove the middle bone from the fillets and cut them length-wise into pieces of about two centimetres thick. Season them with rose salt and black pepper. Place them in a wide container, leaving room between each piece. Mix a sauce from the remaining ingredients, using a blender or a hand mixer, and pour it over the fillets. Let it sit in the refrigerator for at least six hours.<p><p>By Laura Palotie<p><p>Add some variety<p><p>Two Ahokas originals<p><p>Mother’s Baltic herring in mustard sauce <p><p>Pike Perch with lemon<p>", "time": "2013-12-02T08:05:00+00:00", "type": "christmas"}
{"title": "Stuck on the feeling - thisisFINLAND", "url": "https://finland.fi/christmas/stuck-on-the-feeling/", "review": "", "content": "<p>We in Finland are the first in the world to publish our own set of country themed emojis. The Finland emojis are part of our Christmas calendar. FINemojis illustrate Finnish emotions and strengths, as well as vices.<p><p>It’s freezing outside. You have so many layers of clothes on that you feel like a Michelin man. You don’t feel like moving. So you just stand. But hang on, there’s a hand rail, or a light pole, you notice. It’s metal. What would it taste like, you wonder. You take your tongue out of your mouth and decide to lick the pole. Just a little bit, just to get the taste. Just for fun. And then you’re – stuck!<p><p>‘Stuck’ – a familiar feeling for us Finns. Usually we try our luck with licking the metal as a child. But how will you get your tongue off the pole? Well, that’s a different story. Ask a Finn.<p><p>Even a Finnish child knows you shouldn’t lick anything made out of metal when it’s freezing outside.ThisisFINLAND / Bruno Leo Ribeiro<p><p>Stuck is one of the feelings featured in the ThisisFINLAND Christmas calendar. The main role in the calendar is played by emojis this year. All the emojis are available to download for free on Android devices from the Google Play store and later this month they will be available for iOS devices from the App Store. The emojis can also be downloaded for all devices as images from the Christmas calendar site xmas.finland.fi. In addition, the emojis are featured in the following third party applications: iMoji, Jongla, Futurefly and gotIT.<p><p>Even though the entire collection of 29 emojis will be available for download at once, the Christmas calendar will provide a short representation of each of the emoji backgrounds every day. At the end of the month a final special, 30th emoji will be published as a New Year’s gift. The emoji calendar can be followed at xmas.finland.fi and the social media channels of ThisisFINLAND (Facebook, Twitter and Instagram).<p><p>The Christmas calendar is available in thirteen languages, including all of the usual ThisisFINLAND languages plus Japanese, Arabic, Korean, Hindi, Polish and Turkish. The emojis are drawn by Art Director Bruno Leo Ribeiro.<p><p>By Jenita Cresswell, December 2015<p><p> <p>", "time": "2013-12-01T07:59:18+00:00", "type": "christmas"}
{"title": "Meet one of Santa’s elves - thisisFINLAND", "url": "https://finland.fi/christmas/meet-one-of-santas-elves/", "review": "", "content": "<p>Elves tend to shy away from grown-ups, but our reporter used his contacts in Finnish Lapland to catch up with Crackers, one of Santa’s elves, for a rare, exclusive interview.<p><p>Well, he is more like a father than a friend to me! We have very respectful relationship.<p><p>We live in our special place at Korvatunturi, a mountain in Finnish Lapland where Santa Claus makes his home.<p><p>Some kids think I eat jumping beans in the morning, but actually I get my energy from oat porridge; that’s my favorite food. We elves love porridge!<p><p>Crackers the elf says that Santa’s elves get their energy from porridge, their favourite food. Photo: Kaisa Salo<p><p>To make families’ holidays unforgettable! And to remind them that life can be very nice and wonderful!<p><p>We work all the time! We like to work! We watch the children to see how nice they are and what they want and need for Christmas. We make the presents, prepare the cards and train the reindeer so they’ll be fit for Christmas Eve. We’re Santa’s helpers and there is so much to do! It takes the whole year to prepare for the big day.<p><p>Playing, dancing, jumping and just being with the kids! And seeing in their eyes how happy they are in our snowy Christmas land!<p><p>We are not only their very good friends, but we also get quite a lot of respect from them. They really do listen to us. You might call it authority but we don’t really use such difficult words. If I ask them to be nice and to take care of each other, they do! And still they don’t hesitate to play with us. Perhaps we get respect because of our age – an elf may be hundreds of years old.<p><p>I guess it’s easier for kids to be friends with the elves. There is only one Santa, but hundreds and hundreds of us elves. The children respect Santa so much that they are often too excited and forget what they wanted to say when they finally meet him. Santa is the high point of their holiday season, and maybe even their year! We’re around all the time! It’s easier to approach us and ask something that is on their minds. And often those questions are about Santa Claus. So we’re like a liaison between the children and Santa.<p><p>I just stop him for a second to remind him how there is no sense at all in being naughty. It just doesn’t help anyone! And of course I tell them how important it is to be nice.<p><p>Crackers and other elves can sometimes be found doing field research among the families who stay at Snowy Wilderness Lodge at Pallas Mountain in Muonio, Finnish Lapland.<p><p>By Andy Kruse<p><p>Are you friends with Santa Claus?<p><p>Where do elves live?<p><p>What do elves eat?<p><p>What is your elf job during the holiday season?<p><p>What do elves do the rest of the year?<p><p>What is your favorite part about being an elf?<p><p>Tell us about your relationship with the kids.<p><p>How would you compare this relationship to the one Santa Claus has with the kids?<p><p>What do you do if you hear that a kid has been naughty?<p>", "time": "2012-12-14T13:20:00+00:00", "type": "christmas"}
{"title": "New York sings a Finnish Christmas tune - thisisFINLAND", "url": "https://finland.fi/christmas/new-york-sings-a-finnish-christmas-tune/", "review": "", "content": "<p> <p><p><p><p>Greenwich Village in Manhattan, known for its jazz venues, celebrity-inhabited brownstones and collegiate bars, is also home to the New York Finnish Lutheran Congregation. Its bimonthly services are usually attended by a small group of devotees, but once a year, roughly 300 people crowd in these pews to partake in a seasonal tradition: a sing-along of Finnish Christmas songs.<p><p>Accompanied by an organ, members of this immigrant community form a solemn chorus of varied ages and accents as they recall the melodies of their childhoods. Children shift in their seats, candles emit fine strands of smoke, and the honks, shouts and clicks of heels on the surrounding streets seem to disappear.<p><p>“The atmosphere makes you feel like you’re back in Finland,” says Harri Rehnberg, who has lived in New York since 1998.<p><p>New York’s Finnish Lutheran Congregation meets in a little church nestled in Greenwich Village. Photo: Laura Palotie<p><p>Much has been said about the Finnish preference for slow tempos and minor keys. While American holiday tunes focus on mistletoes and silver bells, Christmas songs in Finland are usually more meditative; many are also church hymns. Often noting the harshness of winter or describing Christmas as a day of reflection, a thread of spirituality runs through Finnish evergreens.<p><p>“Christmas in Finland is a family-oriented holiday that arrives at a dark time of the year,” says Finnish Lutheran Congregation pastor Tiina Talvitie, whose surname just happens to mean “winter road.” “Through these songs, we remember the ways in which we used to celebrate as kids. A lot of people want to keep these traditions alive for their own children.”<p><p>Rehnberg, who is married to an American and has a four-year-old daughter, says that becoming a father has drawn him closer to the local Finnish community. “It’s good for my daughter to hear Finnish so that she doesn’t think of it as some secret language invented by her dad.”<p><p>The event wraps up with a distribution of candles and the singing of “Silent Night” in Finnish, Swedish and English.<p><p>Selling Finnish candy makes for good fundraising. Photo: Ilona Lähde<p><p>Another part of the service is a children’s Lucia procession, held in honour of Lucia Day, a Scandinavian December tradition officially celebrated on December 13.<p><p>As the congregation sings “Santa Lucia,” the children walk down the aisle, dressed in white robes and clutching electric candles. Many are students of the New York Finnish School, which organises a Christmas bazaar in conjunction with the sing-along. Rice porridge, wool socks and Fazer chocolate are among the items on sale.<p><p>“This is the largest fundraiser of the year for both the school and our congregation. We don’t earn money from taxes like congregations in Finland, so we depend on donations,” says Talvitie. The sing-along and bazaar take place every year early in the Christmas season.<p><p>New York-based classical pianist and organist Kalle Toivio recently took the stage with his sister Seeli at the famed Carnegie Hall. He’s also the Finnish Lutheran Congregation’s musical director, and accompanies the annual Christmas carol event.<p><p>“Our holiday songs often display a thorough sense of musical expertise in their composition,” he says. “Many of them are also based on real poetry – there’s beautiful prose and a strong sense of structure in them.”<p><p>New York-based Finnish musician Kalle Toivio lists his personal Top Five Finnish holiday songs for us below. You can also listen to them on thisisFINLAND’s Youtube channel.<p><p>By Laura Palotie, December 2012<p><p><p><p>Each year, traditional Christmas songs bring together the dispersed Finnish community in New York. Our reporter visits the event, and a US-based Finnish musician compiles a Top Five playlist (link below).<p><p>Minor keys rule<p><p>Lucia sing-along<p><p><p><p>Kalle Toivio’s Top Five Christmas playlist<p>", "time": "2012-12-06T22:11:00+00:00", "type": "christmas"}
{"title": "Finnish Christmas: Good, bad and ugly - thisisFINLAND", "url": "https://finland.fi/christmas/finnish-christmas-good-bad-and-ugly/", "review": "", "content": "<p> <p><p><p><p>Christmas signifies the most important holiday of the year for the Finns. However, like many good things, this holiday is not without its foibles and nuisances.<p><p>Everyone from toddlers to senior citizens looks forward to Christmas for many months in advance. Here is a light-hearted list of the ups and downs of this special season.<p><p>Among the first signs of Christmas are the spectacular lights of all colours. They hang across streets, illuminate parks and shine from store windows. Although the decorations are admired by all, some Finns worry that the world’s greenest country shouldn’t be wasting electricity.<p><p>A large, healthy Christmas tree is a highly desired object in Finland. Strange how in a country that is 75 percent forested, these trees are so expensive – and it’s highly illegal to cut down your own. Once in the house, the tree is decorated with beautiful ornaments and brings bliss to Finnish families – until those spruce needles start dropping onto the floor. Even after the tree is disposed of, it could take many days before all those stealthy needles are found.<p><p>For many weeks before Christmas, gingerbread cookies, star-shaped pastries and holiday chocolates are given out all over town. These delicious treats are wonderful to the taste buds. Eventually though, you wonder how you put on all those extra kilos.<p><p>A group of Tiernapojat dressed to resemble the Three Wise Men and King Herald sing Christmas carols outside of the Old Student Union in Helsinki. Photo: Martti Kainulainen/Lehtikuva<p><p>One sure sign of the upcoming holidays is the arrival of the Tiernapojat. This is a group of boys (sometimes girls) who enact a Christmas scene starring the Three Wise Men and King Herald. They are dress up in period customs and sing verses – a kind of mini-musical. The first time you witness this at some event, you think, “How charming!” and happily give them a tip. After the 50th time, you discreetly slip out the side door, thinking, “Enough is enough!” The same goes for the popular Christmas tunes you hear in department stores and the radio. They are really enjoyable at the beginning, but by Christmas Day you’ve heard all you can handle – until the next year.<p><p>On Christmas Eve, shops close, public transportation stops and very few restaurants are open. Many people take this opportunity to enjoy quality family time. But after hearing the same stories for two days, some people desperately look forward to Boxing Day, the day after Christmas, when custom dictates that they are allowed to visit friends again.<p><p>Preholiday parties form an important tradition, and are held by companies, organisations and associations. It’s terrific to enjoy free refreshments and entertainment. Partygoers enjoy the relaxed atmosphere – and they sometimes feel free to say things they wouldn’t normally utter. Often this is just healthy expression. Other times, people say something they will regret the next day. Fortunately, there is also a tradition of pretending to forget everything that was said and done at a Christmas party.<p><p>Finnish Christmas ham is always a treat, but it gets progressively less tasty after you eat leftovers for the following week. Christmas fish dishes such as herring, salmon and whitefish are delightful. Too bad Finns always insist on serving lipeäkala (lutfisk), which is reconstituted dried cod, and tastes worse than it sounds. Let it be said that even some Finns, as well as most foreigners, have trouble appreciating this delicacy.<p><p>These should be highly appreciated because people have struggled to find parking, fought crowds in shops and paid the highest prices of the year to get them. So enjoy your presents, even if they’re not precisely what you asked for in your letter to Santa Claus. Christmas is about more than just gifts.<p><p>Nothing negative about him: The sight of Santa Claus always makes people happy. Photo: Kaisa Siren/Lehtikuva<p><p>He lives in Finnish Lapland, and there isn’t anything negative about him (except, perhaps, for all the commercialism people insist on attaching to him). Santa Claus always makes people smile when they see him.<p><p>So despite any minor inconveniences that Christmas brings, it will remain the number one holiday. For the Finns, a few challenges just make something more worthwhile. As you might already know, this quality is called sisu in Finnish, and denotes a special blend of courage and endurance that comes in handy during a hot sauna, a cold winter or even a busy Christmas season.<p><p>By Russell Snyder<p><p> <p><p><p><p>Lights<p><p>Christmas trees<p><p>Goodies<p><p>Music<p><p>Christmas Peace<p><p>Parties<p><p>Food<p><p>Presents<p><p>Santa Claus<p>", "time": "2012-12-06T10:02:00+00:00", "type": "christmas"}
{"title": "Vegetarian inroads into Christmas dinner - thisisFINLAND", "url": "https://finland.fi/christmas/vegetarian-inroads-into-christmas-dinner/", "review": "", "content": "<p>Christmas has the potential to be a compromising time for vegetarians – in most Finnish families the table bears a large cut of ham. Years of work by vegetarian cooks are helping nontraditional foods make inroads into the menu.<p><p>While perhaps not eager to consider herself in a grandmotherly role, Tuija Ruuska admits that she must be one of the longest-serving vegetarian cooks in the business in Helsinki – and that probably means all of Finland, too. “But you have to include my partner Hanni Brotherus here in Kasvisbaari for that title. We share the honours in this restaurant.” At the restaurant-cafeteria of the Finnish Academy of Fine Arts, the team serves over 200 meals every day to students and faculty; all dishes are vegetarian.<p><p>“The thing that has changed fundamentally in Finland is attitudes towards choice,” Ruuska declares. While even the most conventional restaurants now supply at least one vegetarian option, more committed establishments like Ruuska’s offer only vegetarian fare – and always provide an alternative for vegans, who include dairy products and eggs on the list of things they don’t eat.<p><p>For many years Helsinki’s only dedicated vegetarian restaurant, Kasvis, was located near St John’s Church, just south of the city centre. Ruuska and many other budding young restaurateurs passed through the establishment. It definitely had an alternative feel with its simple food and hand-written menus.<p><p>Today a wide variety of Finnish and ethnic restaurants all over the city offer daily vegetarian selections. A handful of restaurants specialise in serving a strictly non-meat selection at lunchtime: Zucchini in the heart of Helsinki (Fabianinkatu 4) and Silvoplee in Hakaniemi (Toinen linja 7) both offer Christmas dishes in December.<p><p>Ruuska’s Kasvisbaari presents a genuinely alternative menu of festive food during the pre-Christmas season. This year it features marinated beans, nut loaves and some very traditional Finnish foods:<p><p>“Traditional Finnish vegetable casseroles – potato, carrot or turnip – are very heavy and use large quantities of cream and even sugar to pep them up,” she says. “We rely on soy products and careful spicing to bring them alive. But we still serve them alongside normal Finnish Christmas dishes like rosolli (a light beet and vegetable pickle) and the traditional dessert of rice porridge.”<p><p><p><p>For Lloyd Polack, a Helsinki chef who hails from the West Midlands in the UK and from the Caribbean, Christmas forms a time to be creative and offer more exotic European and Caribbean dishes. After training in the UK, Polack worked in continental hotels and restaurants before settling in Finland. He, too, got his start at Kasvis.<p><p>A freelance chef and caterer nowadays, Polack can indulge his creative culinary spirits, both at home and on the job. Leafing through old menus, he points out dishes that remain popular, including vegan banana muffins and ginger carrot and bean paté. “Christmas is a good time to be experimental while following the traditional patterns – people are looking for something special,” he declares.<p><p>At home he has learned how to extend his range to include some very local, but not so typical, traditional ingredients. “My mother-in-law is a real forager, so we have always had plenty of Finnish mushrooms, which I had to learn to use at Christmas, too. And I must admit, my sons Pablo and Daniel have been my main guinea pigs!”<p><p>Always proud to be known as being “clever with cakes,” Polack sees higher demand for biscuits and sweet desserts at Christmas. For him, it’s not enough to consider ethical and ecological issues only when preparing food – he also delivers by bicycle whenever possible. “With city traffic nowadays it’s often quicker in the centre to deliver by bike, but when the snow comes I leave it at home.”<p><p>So if you see delivery cyclist with a red hat wobbling through the streets of Helsinki this holiday season, it’s not Santa Claus. It’s another order of vegetarian Christmas goodies on the way to discerning customers.<p><p>By Anthony Shaw<p><p>Vegetarian perspectives<p><p>A new way to look at eating<p>", "time": "2011-12-23T10:06:00+00:00", "type": "christmas"}
{"title": "Finnish traditions stay strong in the US - thisisFINLAND", "url": "https://finland.fi/christmas/finnish-traditions-stay-strong-in-the-us/", "review": "", "content": "<p><p><p> <p><p>As Finns prepare for the holiday season, we visit the US to see how Finnish customs and Christmas traditions are enduring in small-town Minnesota.<p><p>In northern Minnesota, Finnish roots run deep. Finns began emigrating here in the late 19th and early 20th centuries, when the lumber and mining industries were booming. A second wave of immigrants came to mining areas like the town of Virginia, Minnesota after the Second World War.<p><p>“Times were hard in Finland, and travel became available again,” says Eila Ivonen, who came to Minnesota in 1953 to meet her grandfather, who had arrived in 1913. She was planning to return to the University of Helsinki, where she had been admitted, but fell in love with an American and decided to stay. “That’s kind of the typical immigrant story,” Ivonen says. “Most of them intended to go back, but something happened.”<p><p>Heather Surla (right) and her friends help themselves to Karelian pies and other delicacies at Kaleva Hall.Photo: Robert Downs<p><p>Finnish immigrants looked to assimilate while still preserving their heritage, and those that celebrated Finnish culture near Virginia did it through a place called Kaleva Hall.<p><p>The hall has been the centre of Finnish activity in Virginia for more than 100 years. Constructed in 1906 by the Finnish Temperance Society, the hall has acted as a boarding house, a dance hall, a gathering place for the Finnish socialist party and the site of Sunday services for the Unitarian Church (which was also founded by Finns).<p><p>The hall was especially important to those who spoke little English. Plays and dances routinely filled its stage, and throughout the 20th century it remained a place to socialise, read or spend a Saturday night.<p><p>“My mother wants on her gravestone with my father: ‘They danced a thousand miles,’” says Belinda Brunfelt, a third-generation Finn. “When I was a child, there were Finnish dances here every weekend.”<p><p>Now, second- and third-generation Finns are carrying on the practices that their elders taught them. While it gets harder with every generation to pass traditions on, many Finnish descendents are making sure their customs continue. Kaleva Hall forms a home for the local chapter of the Knights and Ladies of Kaleva, a Finnish American service and social organisation.<p><p>Third-generation Finnish American Belinda Brunfelt, shown here playing the kantele, says, “When I was a child, there were Finnish dances here every weekend.”Photo: Robert Downs<p><p>Up north, the Christmas season officially begins with a ceremony at Kaleva Hall, where a man dressed as the mayor of Turku reads the proclamation of Christmas Peace – in both Finnish and English. This mirrors the official declaration ceremony, which happens in Turku on Christmas Eve Day.<p><p>On Christmas Eve, graveyards are illuminated by the glow of candles wrapped in bowls of carved ice. Revellers freeze buckets of water until almost completely solid, then dump the remaining liquid from the middle. Candles are placed inside the hollow ice bowl and the flickering orbs illuminate the cemeteries.<p><p>Some try to read their own fortune on New Year’s Eve. In a ladle they melt a bit of tin, lower the hot liquid it into water and interpret the metal shapes that emerge from the incompatible mixture as the tin instantly cools and solidifies. The Ladies of Kaleva see their glasses of murky water half full: “Our futures are always bright,” Ivonen says.<p><p>Sharon Panula demonstrates the craft of “lastu,” in which special-ordered pieces of wood from Finland are soaked, cut and shaped into ornaments.Photo: Robert Downs<p><p>Sharon Panula is a full-blooded Finnish American, and practices the art of lastu, or wood shaving. She makes mobiles out of special strapping ordered from Finland, soaking the wood in warm water until it is pliable enough to be shaped. Panula sells her beautiful hanging creations at craft sales to benefit the Ladies of Kaleva.<p><p>Belinda Brunfelt plays the Finnish national instrument, the kantele, best described as a type of zither or harp. Her collection of kanteles isn’t limited to just her five-, 10- and 15-string models – she also owns a 39-string chromatic concert kantele. She special-orders strings from Finland to keep her instruments sounding good. “The concert kantele is pretty darn hard to play,” she says after plucking a melancholy tune.<p><p>John Wilbert began performing Finnish and other Nordic dances more than 30 years ago, and has performed with groups from Seattle, Minneapolis, Los Angeles, Toronto and Washington, D.C. He holds dual Finnish and American citizenship, and is looking into buying an apartment in Turku.<p><p>Many of the Ladies of Kaleva are skilled cooks of Finnish foods. Heather Surla plans to open a Finnish bakery called Aiti’s Kitchen in Virginia within the next year (äiti means “mother”). Since her grandmother’s death last winter, she has taken over the baking of pulla – a bready pastry she refers to as Finnish Biscuit – for the entire family.<p><p>We asked Heather Surla and her Finnish American friends in Virginia, Minnesota for a couple of their favourite recipes for Christmastime or other times of year. (For more see thisisFINLAND’s Christmas Cuisine page)<p><p>Makes 8 loaves – recipe may be halved or quartered for smaller batches.<p><p>4 cups (9.5 dl) milk, scalded 2 cups (4.5 dl) sugar 4 teaspoons salt 1 tablespoon cardamom – measured, then ground 1 1/4 cup (3 dl) oleo (margarine suitable for baking) 4 tablespoons yeast 16–18 cups (38–42.5 dl) bread flour 4 eggs, beaten<p><p>Measure sugar, salt and cardamom into large bowl. Add scalded milk. While the mixture cools, mix yeast into a half cup warm water with 1 teaspoon sugar.<p><p>Melt oleo. Add beaten eggs to milk mixture. Beat with electric mixer. Add yeast and 8 cups flour to milk and egg mixture. Let rest five minutes. Add half of melted oleo. Beat.<p><p>Add 8 cups of flour by hand. Add remaining melted oleo. Knead 5–8 minutes. Cover and let rise for 90 minutes in warm place. Punch down. Let rise 30 minutes.<p><p>Grease eight nine-by-four-inch loaf pans. Divide dough into 8 equal pieces. Roll and braid into 8 loaves. Put in pans, let rise until dough reaches top of pans.<p><p>Bake at 350 degrees Fahrenheit (175 degrees Celsius) for 25–30 minutes. While cooling on rack, brush with mixture of hot coffee and sugar. Sprinkle with sugar. May be frozen. Great toasted.<p><p>1 pound (450 grammes) beef, cut into 1-inch (2.5-cm) cubes 1 pound (450 grammes) lamb, cut into 1-inch (2.5-cm) cubes 1 pound (450 grammes) pork, cut into 1-inch (2.5-cm) cubes 5 medium onions 1 teaspoon salt 1 teaspoon ground allspice 1–2 bay leaves<p><p>In large, heavy casserole with a lid, layer meats with the onion, salt and allspice. Top with the bay leaves. Cover tightly and bake at 375 degrees Fahrenheit (190 degrees Celsius) for five hours.<p><p>The meat will be very tender and will stew in its own juices. It is not necessary to add other broth or juice to the meat unless the dish is not well covered.<p><p>Remove bay leaves before serving. This broth is traditionally not thickened. Serve over boiled new potatoes.<p><p>By Robert Downs, November 2011<p><p><p><p> <p><p> <p><p>Centres of Finnish activity<p><p>Holiday traditions<p><p>The art of being Finnish<p><p>Finnish American recipes<p><p>Ruth’s Pulla (Finnish Biscuit)<p><p>Karjalanpaisti (Karelian Three-Meat Stew)<p>", "time": "2012-01-11T11:50:00+00:00", "type": "christmas"}
{"title": "Alternative Christmas gifts on the rise - thisisFINLAND", "url": "https://finland.fi/christmas/alternative-christmas-gifts-on-the-rise/", "review": "", "content": "<p><p><p> <p><p>Instead of buying conventional gifts for friends whose homes are already crammed with stuff, generous but practical Finns are increasingly sending useful or even life-saving gifts to people in need, through charitable schemes.<p><p>One such scheme is FinnChurchAid’s Alternative Gifts. “Last year donations totalled 1.4 million euros, with over half coming around Christmastime,” explains coordinator Else Hukkanen.<p><p>Popular gifts include goats (30 euros), school uniforms (8 euros), donations to a Women’s Bank supporting women’s livelihoods (20 euros), potentially life-saving medical packages (20 euros) and fruit-tree seedlings (18 euros). Donors receive cards or e-cards to send on to their friends informing them that a donation has been made on their behalf to provide a practical gift to someone who will truly benefit from such seasonal generosity.<p><p>FinnChurchAid distributes gifts among families in impoverished communities in countries such as Haiti, Cambodia and Somalia. “Of course we don’t ship gifts all the way from Finland, since purchasing them locally saves on transport costs and benefits local economies,” adds Hukkanen.<p><p><p><p>World Vision Finland runs the similar Ethical Gifts scheme. “Gifts go to communities in Kenya, Uganda, Sri Lanka, Peru, Columbia and India,” says communications officer Anna Pollari.<p><p>“Our gift catalogue selection is based on current needs in the villages and cities where we work. Local communities and our staff together assess what kinds of gifts are needed to create lasting, positive changes in the lives of children and families. Gifts ranging from cows (400 euros) to children’s library books (20 euros) are purchased locally, and the community decides where they are needed most.”<p><p>Pollari believes such presents triple the joy of giving, bringing pleasure to the person who pays for the gift, the person on whose behalf it is sent, and the child who receives the gift in a developing country. “Even small gifts can profoundly change someone’s life,” she says. “One young man called James from one of Nairobi’s slums, who received an ethical gift of vocational training worth 150 euros some time ago, owns a mobile phone and computer repair shop today. He’s now returning the favour by training other local youngsters.”<p><p><p><p>The Global Dry Toilet Association of Finland is asking donors to contribute 50 euros on behalf of a friend towards the cost of building compost toilets and providing hygiene education to alleviate sanitation problems in poor communities. “So far we’ve completed 160 toilet blocks for schools and villages in Zambia and Swaziland where people previously used open pits that can spread diarrhea and cholera,” explains project coordinator Sari Huuhtanen.<p><p>“The toilets are made with local materials and labour, but since dry compost toilets are widely used in Finland, we can contribute practical ideas on toilet design and the use of the resulting organic fertiliser, as well as funding obtained from private donors and the Ministry for Foreign Affairs,” she says.<p><p>“Christmas is when people most think of giving charitably, so we get most of our one-off donations then, to add to regular support from our ‘toilet godparent’ donors,” says Huuhtanen. Gift recipients receive initial e-cards explaining how the sum donated on their behalf will be spent, followed by progress updates later.<p><p>The organisers of these charitable schemes all emphasise that such gifts are much more gratifying than another knick-knack that will probably only gather dust in a cluttered cupboard. By Fran Weaver, December 2011<p><p><p><p> <p><p> <p><p>Gifts with a practical purpose<p><p>Give someone a toilet this season<p>", "time": "2011-12-09T10:06:00+00:00", "type": "christmas"}
{"title": "Learning to love Christmas Peace - thisisFINLAND", "url": "https://finland.fi/christmas/learning-to-love-christmas-peace/", "review": "", "content": "<p> <p><p>An American learns what the Finnish concept of Christmas Peace means, in the process discovering many ways of celebrating the holidays in Finland.<p><p>Coming from the US, a country where shops, restaurants and entertainment centres are open during Christmas, my first Finnish Christmas was a culture shock to say the least. When Christmas Peace is declared, they really mean it. At noon on Christmas Eve, Christmas Peace is officially proclaimed in a ceremony in Turku, a tradition dating back to the 13th century. Many Finns watch the event on TV as the bells of Turku Cathedral ring.<p><p>For many, the smells of gingerbread and star-shaped pastries bring back a flood of Christmas memories.Photo: Visitfinland<p><p>Back in 1982, my fellow foreign students and I were discussing what we would do on Christmas Eve. In those days, all public transportation stopped in the afternoon, and all shops, restaurants and businesses were closed. Fortunately, a group of Finnish students took us in their cars to an apartment in Espoo, outside Helsinki. Paul from Texas brought burritos, Georgi from Bulgaria brought wine, Adriana from Italy brought pasta, and I brought a “California salad” that I put together from leftovers I found in my fridge.<p><p>The Finns brought some traditional Christmas casseroles and voilà, we had our own feast. Georgi played the guitar, the Finns taught us some of their Christmas songs, and we had a lively discussion until late into the night. “That was certainly unselfish of you to give up your family Christmas for us,” Paul said. “Well, it wasn’t completely unselfish,” replied Timo. “We were just happy for an excuse to get away from the family for a while.”<p><p>Warm windows: It can be fun to admire everyone’s Christmas decorations and imagine the celebrations going on inside people’s houses.Photo: Jani Koskinen/Lehtikuva<p><p>The next few Christmases I spent with a friend or two. We would warm up smoked turkey and a few other goodies, drink a bit of Christmas cheer and take a long walk. It was amusing the see all the Christmas decorations and look in through the windows at the family gatherings. Actually, we were a bit envious.<p><p>One year I noticed that a couple of restaurants were opening their doors for Christmas Eve. I hadn’t anything special to do that night, so I wandered into one of these watering holes. I think there is nothing more pathetic than being alone in a bar at this special time, so I went home after just one hour. However, the next year a couple of friends joined me and we found a pub with live music, and then went to a restaurant with dancing and late night meals. It was a pleasant evening, but something seemed to be missing.<p><p>Those lucky enough to have a country cottage may retreat there for the duration of the holidays.Photo: Visitfinland<p><p>After I got married and had kids, things changed. I was now the person I had seen through the windows earlier when taking Christmas strolls. Now I was sending postcards, buying gifts, picking out a tree, hanging decorations, organising the menu, putting on the holiday music, playing seasonal games and making Christmas goodies with the kids.<p><p>Christmas Eves were often spent at the in-laws house in the countryside, where a proper Christmas sauna was waiting. A real Christmas table would be set, with a rosolli salad (not bad), various root casseroles (a little is enough), lutefisk (not really food), rice porridge (boring), freshly smoked ham (terrific), fish roe (yes), herring (tasty), home beer (it’s not actually alcoholic) and fruit compote (it’s edible). After the meal we’d take a walk in the forest so we had room for more food.<p><p>A hired Santa would later emerge to give the kids their presents. Then Christmas carols would be sung – mostly out of tune. After that followed the tradition of going to the graveyard and lighting candles at relatives’ graves (even when it was minus 25 degrees Celsius (minus 13 Fahrenheit). Later we cleaned up, had another sauna, watched special Christmas programmes, played cards, discussed nonsense and enjoyed strong Christmas drinks.<p><p>Those were interesting times, but now, I’m divorced and usually celebrate Christmas with my daughter, who lives with me. We don’t go to a huge amount of trouble decorating or making heavy meals – we do just as much as we like. And I enjoy that. Perhaps now I have learned the meaning of Christmas Peace.<p><p>By Russel Snyder<p><p>Student Christmas<p><p>Friendly Christmas<p><p>Family Christmas<p>", "time": "2011-12-05T21:19:00+00:00", "type": "christmas"}
{"title": "Show me the way to the next pikkujoulu - thisisFINLAND", "url": "https://finland.fi/christmas/show-me-the-way-to-the-next-pikkujoulu/", "review": "", "content": "<p><p><p> <p><p>During the weeks preceding Christmas, Finland seems overrun by party fever. This phenomenon is called the pikkujoulu (pre-Christmas party) season.<p><p>Years ago, when I walked into a December party, a smiling, young woman greeted me by putting a warm drink in my hand. It resembled glühwein, a mild winter concoction I sometimes had when living in Germany. The drink was so refreshing that I took several more. The rest of the night turned out rather blurry because that “harmless” drink they called glögi was spiked with vodka. A friend called me the next morning, and when told him I had a terrible headache, he laughed knowingly and said, “Welcome to the pikkujoulu season!”<p><p>The roots of the Finnish pre-Christmas party go back to celebrations of Advent during the 1800s. In the 1920s and ’30s students turned these celebrations into parties, and after the Second World War, the pre-Christmas party started catching on with the general population. Nowadays, almost every company, business, organisation and club holds its own pikkujoulu. The word means “little Christmas,” implying a head start on the holiday season. The simplest form may include non-spiked mulled wine, gingerbread cookies and sandwiches, and last only a couple of hours. The most extravagant pikkujoulu might take place on a cruise to Sweden with cabins, meals, drinks and sightseeing all included. However, the average party is somewhere in between, depending on the budget.<p><p>The Christmas season forms a time to celebrate with friends, family, coworkers and customers.Photo: Tim Bird<p><p>A typical pikkujoulu will include an abundance of Christmas food. I’ve been to a party with a whole roasted pig and a couple of huge, smoked salmons in the middle of the room waiting for hungry revellers. A grand buffet seems to be the preferred pre-Christmas fare, but for the more upscale celebrations, nothing less than a fancy sit-down meal will do.<p><p>As for entertainment, there will always be festive speeches, which are often followed by jokes or humorous sketches, and then some mock awards will be given out. After that, song books are passed out and happy Christmas hits are sung in Finnish, English or Swedish. Christmas karaoke has become quite popular, and any performer will garner hardy applause, no matter how terrible they sound. Then there could be a band, a stand-up comedian, a magician or a funny play. Of course every decent pikkujoulu must have a Santa Claus to give out little gag gifts.<p><p>For some attendees who seem to have an endless thirst, one of the main attractions of these parties is the alcoholic beverages. After enough liquid courage has been consumed, unsociable people suddenly become friendly, shy people tell off-colour jokes, cautious people may offer the boss some unsolicited advice, or someone may confess his or her romantic feelings for an unsuspecting coworker. All this behaviour will be forgotten the next day – or at least it won’t be talked about.<p><p>Businesses and organisations often hold their pre-Christmas parties in fancy restaurants or hotels.Photo: Tim Bird<p><p>With so many of these parties taking place during the Advent season, it has become a vital time for the hospitality business. Restaurants, hotels, resorts, clubs and other venues compete for pikkujoulu custom. Some put together attractive party packages well in advance, others offer discounts for large groups. Taxis and private limousines also enjoy greatly increased revenue, as do hairdressers, fashion shops and perhaps pharmacies (on the day after).<p><p>These days, Finns are not satisfied to attend just one pikkujoulu. Many will go to several or even a dozen different parties: some to socialise with colleagues, others to celebrate with friends and still others to network. The best advice, especially if you’re attending multiple events, is to count your drinks, watch your calories and avoid doing anything you’ll regret the next day. <p><p>By Russell Snyder<p><p> <p><p><p><p>Eat, drink and be merry<p><p>Important economic consequences<p>", "time": "2011-12-14T08:38:00+00:00", "type": "christmas"}
{"title": "Beginning to taste a lot like Christmas - thisisFINLAND", "url": "https://finland.fi/christmas/beginning-to-taste-a-lot-like-christmas/", "review": "", "content": "<p> <p><p>By Peter Marten, December 2010<p><p>Chef Hans Välimäki of Finland’s undisputed number one restaurant, Chez Dominique, teams up with Helsinki design hotel Klaus K to create Christmas Wonderland, a pop-up fine dining experience open only for the holiday season.<p><p>The Finns have a tradition of pre-Christmas parties called pikkujoulut, which translates to \"little Christmas.\" Much like the Christmas shopping period, the pikkujoulut season seems to edge a little bit earlier every year.<p><p>Starting in late November and lasting through most of December, you may have the opportunity to attend pre-Christmas lunches and evening events held by your office, your university department, your company, your business contacts, your clients, your sports teams and other organisations you belong to. All that wining and dining is fun, but it can also get exhausting, which means that people want to make their pikkujoulut stand out from the crowd.<p><p>This forms the background behind Christmas Wonderland, a here-today, gone-by-Christmas restaurant at Klaus K Hotel. Chez Dominique, the only restaurant in Finland with two Michelin stars, simply doesn’t have room to accommodate all the seasonal diners who would like to reserve tables, so the esteemed Välimäki has developed a pre-Christmas menu that is carried out just up the road in collaboration with Klaus K chef Fillip Forsberg.<p><p>Although the special menu is also available at the hotel’s Ilmatar restaurant, the Christmas Wonderland atmosphere is found upstairs in the stately Rake Hall. In the centre of this ballroom stands a circular, rotating gourmet buffet, and in the middle of that a real jukebox contributing a carnival-like good humour that somehow complements the seasonal but staid décor.<p><p>Photo: Mika Huisman<p><p>The food itself diverges from traditional Finnish Christmas fare. On the whole, the spirit of a transitory pop-up establishment also allows Välimäki to try things that may fall outside the scope of his \"day job\" at Chez Dominique. Baked ham forms the usual holiday mainstay, but Christmas Wonderland instead offers miso-glazed pork belly with ponzu sauce, which everyone at our table agreed was superb, almost seeming to melt in your mouth.<p><p>Forsberg describes how they developed the menu: \"Hans suggested something, and then we worked on it with him in Klaus K’s kitchen until we were satisfied. For some dishes it took a couple times before the result was as we’d imagined it.\"<p><p>For one of the other main courses, Christmas Wonderland visits Nordic neighbour Norway. The Norwegian-style Christmas cod forms a version of what some call lutefisk, served with delicate sauces that may well convert you to this acquired taste.<p><p>Traditional rice pudding forms one of the desserts on offer – the Finns just can’t go without it – along with chocolate mousse with marinated cherries, or how about cognac-and-plum charlotte? And the Christmas elves have even left a few gingerbread cookies out for you.<p><p>Chez Dominique’s Christmas Wonderland, until December 21, 2010<p><p> <p><p><p><p>Here today, gone by Christmas<p><p>Diverging developments<p><p>Link:<p>", "time": "2010-12-03T12:40:00+00:00", "type": "christmas"}
{"title": "The Finland emojis take off on Christmas adventures - thisisFINLAND", "url": "https://finland.fi/christmas/strangest-greetings-from-santa-and-23-other-extraordinary-finns/", "review": "", "content": "<p>They show the adventures of the Finland emojis, especially Baby in a Box and the legendary phone called Unbreakable.<p><p>And while these films are for kids, we bet grown-ups will enjoy them, too!<p><p>“Baby in a Box” refers to the maternity package, a box of baby clothes, care items and accessories sent to every new family in Finland to give the child a good start and help parents grow into their role. The box itself is designed to serve as a crib during the early months.<p><p>“Unbreakable” is an old-school Nokia 3310 phone, famously sturdy and now surrounded by an aura of nostalgia. You don’t have to be very old to remember playing games such as Snake on that tiny green screen.<p><p><p><p>Baby in a Box and Unbreakable help a swan who gets distracted by the Northern Lights and crashes into the bell tower of Helsinki Cathedral.<p><p>Who’s in this video: The swan is Finland’s national bird, so of course it has its own emoji (and swans just might be cuter than cats). And Finland is *the* place to experience the spectacular dance of Aurora Borealis, the Northern Lights. You usually get the best views up north, but you can sometimes catch them in southern Finland, too.<p><p><p><p>Hey, bear! You can’t take your long winter’s nap in the middle of the road! That could be dangerous!<p><p>Who’s in this video: Bears hibernate, sleeping the winter away – sometimes when it’s cold and dark outside, you feel they might be right!<p><p><p><p>What happens when two Finnish horses are playing ice hockey on a frozen lake and lose the puck? How will they get it back? And how does an ermine become involved?<p><p>Who’s in this video: Strong and stubborn, the Finnish horse is a trusted friend that has been a reliable companion in work and play for centuries. Of course Finnish horses know how to play ice hockey!<p><p><p><p>How can Santa Claus take off from northern Finland to deliver presents to everyone, if Rudolph’s bright red nose has a short-circuit?<p><p>Who’s in this video: The original Santa Claus, the one and only, comes from Finland, and makes his home in Korvatunturi, up north in Finnish Lapland, where there are lots of reindeer.<p><p>By ThisisFINLAND staff, November 2018<p><p>About our heroes<p><p>A swan is dazzled by the Northern Lights<p><p>A long winter’s nap<p><p>Playing pond hockey: Who’s got the puck?<p><p>Helping Santa deliver the presents<p>", "time": "2018-11-29T08:39:01+00:00", "type": "christmas"}
{"title": "Old-time magic at Christmas markets - thisisFINLAND", "url": "https://finland.fi/christmas/old-time-magic-at-christmas-markets/", "review": "", "content": "<p>During the festive season, merchants in the southern Finnish town of Porvoo and many other places across the country set up their stalls of homemade delicacies and traditional handicrafts, bringing the Christmas spirit to locals and visitors alike.<p><p>Warm, genuine, enchanting: these are some of the traits that reflect yuletide in Porvoo. A stroll through the old town, its streets hung with Christmas lights, and a visit to one of its markets form the perfect remedy for anyone allergic to commercial Christmas with its inflatable Santas and cheesy songs.<p><p>The highlights include a visit to the Old Time Christmas Market at the Volunteer Fire Department headquarters, as well as the traditional Porvoo Christmas Market on Raatihuoneentori (Town Hall Square) – both places attract throngs of visitors every year. The town’s Christmas market tradition stems from its character as a trading centre since medieval times.<p><p>Porvoo has centuries of experience in getting it right when it comes to markets.Photo: Porvoo tourist office<p><p>Porvoo Christmas markets aim to keep things local. “Every item we sell is from the region – home-crafted or organically grown by inhabitants of Porvoo,” says Joachim Silberstein, chairman of the Old Porvoo Residents’ Association, which manages the Old Time Christmas Market, held on December 8 and 9 in 2018. Dressed in the fashion of bygone times, the vendors sell regional handicrafts and homemade edibles.<p><p>Porvoo Christmas Market, on December 8 and 9, offers a similar range of charming local products, with a particular emphasis on traditional Finnish Christmas cuisine.<p><p>The Old Station Depot and its café offer a market-style shopping experience throughout the Christmas season. Its 300 square metres contain such an impressive range of weird and wonderful items that it’s easy to believe owner Pertti Haajanen, who claims to have a Christmas present “for anyone who thinks he or she already has everything.”<p><p>Those who don’t mind having a little more can choose among everything from vintage Christmas cards and antique porcelain to fresh organic bread and flavoured truffles.<p><p>These vintage cards are among the seasonal wares offered at Porvoo’s Old Station Depot. Photo: Angelina Palmén<p><p>Porvoo has no internationally famous landmarks, but can boast about being a historical small town bustling with life to this very day. Silberstein playfully encourages visitors to have a peek through someone’s seasonally decorated window or stop a local for a quick chat.<p><p>“Porvoo’s old town is not a museum,” explains Silberstein. “It’s a community full of life. Its compact size and friendly and approachable people let market-goers get a real insight into people’s lives and traditional Finnish Christmas celebrations.”<p><p>These vintage cards are among the seasonal wares offered at Porvoo’s Old Station Depot. Photo: Angelina Palmén<p><p>By Angelina Palmén, updated November 2018<p><p><p><p> <p><p>The real deal<p><p>Christmas bustle<p><p>Christmas markets: when and where<p>", "time": "2014-11-20T11:15:00+00:00", "type": "christmas"}
{"title": "Santa's new gift to Lapland's economy - thisisFINLAND", "url": "https://finland.fi/christmas/santas-new-gift-to-laplands-economy/", "review": "", "content": "<p>He looks like Santa’s brother, so it’s appropriate that Jussi Eiramo is completing a new tourist project in Finnish Lapland that will charm the world’s children – and generate some economic magic.<p><p>“In this hectic and harsh world, we need fairy tales. In some of us it may be deep down, in others it’s not as deep, but we all have the Christmas spirit.” These may sound like the words of an innocent, but when they’re spoken by a jovial, white-bearded gentleman in the middle of Lapland they seem to carry more weight.<p><p>The white-bearded gentleman in question is not who you think it is, although you suspect that Father Christmas and Lapland entrepreneur Jussi Eiramo might well be twins. Eiramo comes across as part Santa-in-overalls, part veteran hippy and part shrewd businessman as he puts the finishing touches on his new Santa’s Resort, just a 20-minute drive from Ivalo Airport in northern Lapland.<p><p>The new resort realises Jussi’s latest business dream, adding to the nearby Kakslauttanen Hotel and Igloo complex. At Kakslauttanen you can choose between sumptuously furnished log cabins and snow igloos for your Arctic accommodation, or lie back in luxuriously heated glass igloos with a clear view of the sparkling starlit heavens or awe-inspiring Northern Lights.<p><p><p><p>The fruit of a multimillion-euro investment, Santa’s Resort is not the first business attempt in Finnish Lapland based on the Christmas legend. For decades, dozens of charter flights packed with families in search of snow and reindeer have been packing the runway at Rovaniemi Airport, right on the Arctic Circle.<p><p>The shops, tours and services at the well-established Santa Claus Village and underground Santa Park in Rovaniemi are important sources of local employment. Kakslauttanen may be 200 kilometres further north, but Eiramo envisions similar year-round popularity for his venture.<p><p>“I don’t think we will be competing with the Rovaniemi Santa Claus Village,” says Jari Virtanen, who heads Kakslauttanen’s marketing. “I think we’re going to complement each other.”<p><p>Eiramo’s vision took more than a decade to become reality, and he hopes planning and building bureaucracy for any similar future projects might be expedited for the sake of the local economy. “The project has provided employment for about 30 people, from builders and contractors to artists and designers,” says Virtanen. “We used local labour as much as possible, so the financial gains remain in this area.<p><p>“When it’s fully open the resort will offer work to up to 15 people, and more during the high season.” This figure does not include the jobs generated for bus drivers, tour guides and other tourist service providers. Onsite accommodation is not included in the resort plans – not yet – but the cabins and igloos of Kakslauttanen and the hotels of the Saariselkä holiday village are handily placed.<p><p><p><p>“The Celebration House at the heart of the resort offers a long-awaited and sufficiently large space where it’s possible to arrange big meetings and conferences as well as other events, such as concerts,” Eiramo says. “There was a great need for this kind of space in this part of Lapland.”<p><p>“We strongly believe that the project will benefit Ivalo Airport, as well as the rest of the area,” says Virtanen. “It looks like there are tour operators new to our area who are planning to start charter flights to Ivalo, and there could be a wider effect on neighbouring areas of Norway and Russia.”<p><p>Eiramo concludes on a charmingly, but convincingly authentic, idealistic note, offering up the resort as a neutral venue at which to iron out the difficult issues of the day:<p><p>“The Finnish government wants to make Finland a superpower in brokering world peace. Now Father Christmas can provide a calm and neutral place for this purpose, in the Celebration House in the middle of the peaceful Lapland natural environment. This is where you are going to find the real spirit that’s going to help you solve the conflicts of the world!”<p><p> <p><p>By Tim Bird, November 2010<p><p>In search of snow and reindeer<p><p>Peaceful celebration<p>", "time": "2009-12-02T12:57:00+00:00", "type": "christmas"}
{"title": "Even the modern Christmas season is a time of tradition in Finland - thisisFINLAND", "url": "https://finland.fi/christmas/a-time-of-tradition/", "review": "", "content": "<p>No matter how modern it may become, Christmas will also always be synonymous with age-old traditions. We take a look at the high points of the Finnish Christmas season, from early December to the day after the big day.<p><p>After the first weekend of Advent, the unveiling of outdoor Christmas decorations, and a multitude of pre-Christmas parties, the next important holiday in Finland is Independence Day, which coincides with the feast day of Saint Nicholas, December 6.<p><p>The next milestone in the lead-up to Christmas is December 13, Santa Lucia’s day. It’s celebrated with a beautiful, singing procession led by a girl dressed in white wearing a crown of candles. This observance originally came to Finland from Sweden, where it became linked with Christmas because it happens to fall in mid-December.<p><p>Lucia was originally a Sicilian maid who defied her father by refusing to marry the man he had chosen for her. She suffered a martyr’s death. The flames of the candles in the procession denote her martyrdom.<p><p>In a tradition that has roots in the 13th century, “Christmas Peace” is declared in Turku on December 24.Photo: Esko Keski-Oja/City of Turku<p><p>In the Nordic countries, the most important Christmas celebration takes place on Christmas Eve. Finnish traditions include the Christmas sauna and the preparation of Christmas dinner. The highlight of the evening comes when Santa knocks on the door and asks, “Are there any well-behaved children here?” Naturally, every home contains only good children and they all receive presents.<p><p>Since Christmas Eve forms the most important day of the Christmas season in Finland, it is fitting that at noon on the Eve, “Christmas Peace” is proclaimed in Turku, the oldest city in the country. The tradition dates back to the 13th century.<p><p>The bells of the 14th-century Turku Cathedral sound in many a Finnish home as people view the age-old ceremony on television. Then the festivities begin.<p><p>Christmas Day is a time for rest and relaxation, like reading books Santa Claus brought and eating food left over from Christmas Eve. People wait until Saint Stephen’s Day (Boxing Day), December 26, to pay visits to friends and relatives. And if the weather permits, people visit outdoor events arranged by heritage societies.<p><p>According to legend, Saint Stephen was a stable boy of King Herod, and in Finland, as elsewhere, Stephen became the patron saint of horses and horsemen. On Saint Stephen’s Day horses are included in the celebration of Christmas. In the past, horses pulled the sleighs when people visited friends and relatives, and sleigh rides can still be enjoyed at many a Saint Stephen’s Day event.<p><p>The Christmas tree is brought home on December 24 at the latest. A star is placed at the top of the tree and the branches are adorned with sweets, elves, stars and apples, the latter relating to Adam and Eve: In the Finnish calendar, Christmas Eve is the name day of both Adam and Eve. The rural gentry and wealthy townsfolk began to adopt Christmas trees in the 1820s. The earliest account of a Christmas tree inside a Finnish home dates from the year 1829, when Helsinki dignitary Baron Klinckowström placed eight of them in his reception rooms.<p><p>The Finnish Christmas tree tradition got its start in 1829 and became widespread in the late 1800s.Photo: Miemo Penttinen/Plugi<p><p>The population at large started adopting the tradition in the 1870s, first in the southwest and later in other regions. By the early 20th century, the Christmas tree was becoming a familiar sight in almost all Finnish homes.<p><p>There was a public outdoor Christmas tree in the town of Tampere in 1894. Helsinki authorities have placed a Christmas tree on Senate Square every year since 1930.<p><p>Helsinki has also donated a Christmas tree to Brussels every year since 1954, just as Oslo, Norway, sends one for Trafalgar Square in London.<p><p> <p><p>By Sinikka Salokorpi<p><p>Christmas Eve<p><p>Christmas Day and beyond<p><p>Don’t forget the tree<p>", "time": "2012-11-20T13:15:00+00:00", "type": "christmas"}
{"title": "Laying claim to Claus - thisisFINLAND", "url": "https://finland.fi/christmas/laying-claim-to-claus/", "review": "", "content": "<p><p><p>During her time living in America, a Finnish journalist gets philosophical while looking for the true home of Santa.<p><p>Less than 48 hours into November, my neighbourhood shopping mall in northern New Jersey replaced the pumpkins and polyester cobwebs of the Halloween season with ubiquitous rows of hanging twinkle lights. At the centre of the mall stands the centrepiece of commercial Christmas: a golden armchair surrounded by plastic pine trees, oversized gift boxes and stuffed reindeer dressed in two-piece suits.<p><p>“Mall Santa” occupies this throne and listens to the Christmas wishes of local children. For most, sitting in Mall Santa’s lap for a few fleeting minutes will be the extent of their contact with the personification of modern Christmas.<p><p>Scenes like this may give American Christmas its materialistic image, but they also reflect a characteristically mythical aspect of the local Santa. Travelling from the uninhabitable North Pole, as the American story has it, and delivering his gifts under the cover of the night, Claus is hardly a tangible figure in the US.<p><p>In Finland, however, reindeer are as real as cows or horses, and children don’t just recite their wishes to Santa Claus. He has a real-life address that receives mail and welcomes tourists. Instead of sneaking in through the chimney and leaving cookie crumbs as evidence of his visit, Santa knocks on doors and hands his presents to children in person. The realism of the Finnish Claus allows Finland to stand by its status as a Christmas capital.<p><p>Reindeer can’t survive at the North Pole, but Finnish Lapland forms part of their natural habitat.Photo: Martti Kainulainen/Lehtikuva<p><p>Finland didn’t claim itself as Santa’s country of residence until 1927, when radio personality Markus Rautio declared Korvatunturi, a mountain in Lapland, to be Santa’s home. His official postal address has since moved to Rovaniemi, a city near the Arctic Circle, but these days Santa Claus offers a marketable face for Finnish tourism. According to the Finnish Broadcasting Company YLE, nearly 150,000 European and Asian visitors visited Lapland last winter.<p><p>“As far as Santa Claus living in Finland, we can stand behind a few facts,” says Ilkka Länkinen, founder and CEO of Rovaniemi-based Pro Santa, a company that sends trained Santa Clauses around the world and is home to the Christmas village Joulukka. “Finnish is the only language in the world that has named the month of December after Christmas,” he notes. “Joulukuu literally translates to ‘Christmas month’. And even though Santa might keep an office at the North Pole, he can’t live there, because reindeer can’t survive there. In Lapland, they can make it through the winter.”<p><p>“The fact that we have a real Santa Claus workshop and a real Santa Claus whom tourists can meet year-round is important,” says Tommi Lappalainen, CEO of Santa Television, which markets Santa Claus multimedia items and offers a live webcam into Santa’s village in Rovaniemi during December.<p><p>Beyond shopping malls: Santa spreads holiday cheer at Hakkeijima Sea Paradise in Yokohama, Japan.Photo: Yoshikazu Tsuno/Lehtikuva<p><p>Anne Gaskell, CEO of Santa Speaking, a Nebraska-based service that allows parents to order personalized phone calls from Santa Claus, says that Santa should be viewed, above all, as a symbolic entity. She founded her business to add an element of magic to children’s relationship with Santa Claus – something that surpassed standing in line at a shopping mall. Santa is really “a spirit that teaches us to give and receive,” she says.<p><p>While guests from Asia and all over Europe take chartered flights to Santa Claus’s digs in Rovaniemi, the US holds firmly to its North Pole theory. In a manner of speaking, that may be the ideal location for the American Santa Claus. For a character so strictly rooted in symbolism and magic, the least habitable place on earth is a fitting address.<p><p>And the Finnish Claus – the real one who cushions his wooden sleigh with animal skins and steers his living, breathing flock of reindeer through a frozen landscape – may be a different character altogether.<p><p> <p><p>By Laura Palotie<p><p><p><p>No reindeer at the North Pole<p><p>Give and receive<p>", "time": "2013-12-02T10:55:00+00:00", "type": "christmas"}
{"title": "Creator of Santa Claus - thisisFINLAND", "url": "https://finland.fi/christmas/creator-of-santa-claus/", "review": "", "content": "<p><p><p> <p><p>Mauri Kunnas’s lovingly illustrated Santa Claus books are part of Christmas for countless kids in Finland and around the world. Their joyful stories echo the author’s childhood Christmases in a small Finnish town in the 1950s.<p><p>Mauri Kunnas is probably Finland’s most widely read living author, as his children’s picture books, published in Finland by Otava, have sold nearly seven million copies around the world. The original Santa Claus book has been translated into 28 languages.<p><p>Many of Kunnas’s most popular books feature Christmas festivities in a timeless snowy setting that is home to a laid-back Santa Claus and hordes of fun-loving little elf children.<p><p>“I’ve always loved Christmas,” he explains. “It’s an especially big thing in Finland, where the festival is really much older than Christianity.”<p><p>He emphasises that his elf characters have their roots in ancient Nordic folklore. “Even if we don’t always realise it, there’s still something very paganistic about the way we mark this very darkest time of the year in Finland – like the way we go to the cemetery on Christmas Eve to visit the graves of our ancestors.”<p><p>Mauri Kunnas bases many settings in his books on his own childhood home and village.Photo: Ville Juurikkala/Otava<p><p>Kunnas grew up in a big wooden house in a small town in southwestern Finland, and he points out that Santa’s home and village in his Christmas books are closely based on scenes from his own childhood. “Here these elves are playing on exactly the same kind of skating rink where I used to play with my friends. And this Santa’s workshop is like my father’s carpentry workshop in our basement – these shelves and wooden toys are just as I remember them!” he says, laughing.<p><p>Kunnas’s cheery but slightly doddery Father Christmas is a mixture of the mysterious scruffy wanderer of Finnish folk traditions and the more internationally recognisable Santa. Kunnas points out that the American Santa stereotype is largely derived from 1930s Coca-Cola advertisements illustrated by Haddon Sundblom, whose parents came from Finland and Sweden.<p><p>“Christmas hasn’t really changed so much for children since my childhood – though the sacks of presents Santa brings are much bigger today!” he says.<p><p>Although Santa traditionally visits Finnish family homes during the waking hours of Christmas Eve, Kunnas never really met him as a child. “He visited us once when I was small, but all I saw of him was his feet, as I was hiding under the bed in terror,” he remembers.<p><p>Kunnas identifies more closely with Little Willie, a tiny, kind-hearted elf who features as the central character in Twelve Gifts for Santa Claus, the author’s own favourite book from his Christmas catalogue.<p><p>Santa Claus and the Magic Drum (left) is a Kunnas Christmas classic, while Joulu (Christmas) is a brand new book for very young readers.© Otava Publishing<p><p>As Christmas approaches again, Santa Claus and Kunnas’s other Christmas stories will be eagerly retrieved from cellars and cupboards in homes around the world. Though there is something quintessentially Finnish about their settings and stories, translated versions have sold like hot Christmas cakes in languages from Chinese to Welsh.<p><p>Kunnas insists that he mainly writes and draws for himself, and he seems astonished that his books have proven so popular with children and parents from such different cultures. But these lovingly illustrated stories are so full of fun, warmth and humorous detail that their success comes as no surprise.<p><p>In addition to his Christmas favourites, Kunnas has written and illustrated dozens of fictional and educational children’s books, including imaginative adaptations of historic legends and literary works, featuring dogs and other animals instead of people. His best-selling Canine Kalevala is widely credited with making stories from the Finnish national epic Kalevala familiar to modern Finnish youngsters.<p><p>Having just fulfilled a long-held ambition by completing a colourful new version of Robin Hood, Kunnas already has plenty of ideas for future projects – even if planning, writing and painstakingly illustrating a book can take the better part of a year.<p><p>One of these ideas is to create a history of Finland for children, based on a journey back up the ancestral family tree of Doghill Martha, a popular character from Kunnas’s Doghill Farm series. Another dream, linked to Kunnas’s fondness for 1960s pop music, is to one day produce a book documenting the rise of a familiar-sounding band – the Beagles.<p><p>By Fran Weaver, December 2009<p><p><p><p>Childhood memories<p><p>Scary Santa<p><p>History, literature and music<p>", "time": "2013-12-03T12:24:00+00:00", "type": "christmas"}
