{"title": "Finland in facts - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/finland-in-facts-2/", "review": "", "content": "<p>This is FINLAND infographics.<p><p><p><p>Updated July 2018<p>", "time": "2016-02-15T09:35:59+00:00", "type": "facts-stats-and-info"}
{"title": "Shine with facts about Finland - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/finland-in-facts/", "review": "", "content": "<p>You won’t be ready for a PhD on Finland, but this page will give you enough info to impress at least your pals.<p><p>Sources: Statistics Finland, National Board of Customs, Population Register Center, State Provincial Office of Lapland, Localfinland.fi<p><p>Updated July 2018<p><p>People<p><p>State &amp; Government<p><p>Society &amp; Economy<p><p>Geography &amp; Climate<p>", "time": "2015-10-26T22:00:00+00:00", "type": "facts-stats-and-info"}
{"title": "Finnish healthcare goes multicultural - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/finnish-healthcare-goes-multicultural/", "review": "", "content": "<p>Demand for healthcare personnel is growing, leading to a more international workforce as institutions welcome an increasing number of employees from abroad.<p><p>Hanna Aschan, Manager of Nursing at Helsinki University Central Hospital (HUCH), believes there will soon be a great need for more skilled and trained healthcare personnel. The work will have to be reorganized and existing work communities primed to welcome staff from other countries.<p><p>“I should think initially they might be experienced, well-trained nursing staff from nearby countries such as the Baltic republics, Russia and maybe Poland, and also from Asia,” says Hanna Aschan.<p><p>So far, direct recruitment from abroad for HUCH units has mostly involved Finnish expatriates.<p><p>“Qualifications should not be a problem with persons coming from European countries, because training systems have been harmonized. What may be much more difficult are cultural differences, familiarity with legislation, and of course language skills.”<p><p>For those with basic nursing qualifications, the supplementary training required to qualify them to work in Finland is provided. Hanna Aschan describes this training as quite a challenge and their supervisors also need additional training and skills in managing an increasingly international work community.<p><p>Nurses in Finland are well trained and well qualified.Photo: Kari Ylitalo<p><p>Language plays a crucial role in healthcare, at least for personnel dealing directly with patients. Under Finnish law, patients must be able to obtain service in their own mother tongue. Finland is officially a bilingual country, and thus nurses in bilingual regions, such as the greater Helsinki area, must be able to speak Finnish and Swedish. Inability to communicate could compromise patient safety. In current nursing culture, reading and writing skills in the patient’s language are just as important as oral communication.<p><p>“Still, it is probably only a matter of time before we have to start being more flexible about requiring employees of foreign origin to speak Swedish. We also have to take into account the need to know other languages in dealing with patients. We have to show more appreciation for the fact that an employee who has taken the trouble to learn Finnish may also already speak English, Russian, Portuguese, French, Spanish and a couple of other languages,” says Hanna Aschan.<p><p>Cultural differences are visible at the workplace. Employees may have different views about, say, punctuality, hygiene, temperament and how to approach certain topics of conversation. Religious views and traditions may also impose restrictions or procedural differences. For people who come from outside the Western cultural sphere, the Finnish way of life may pose challenges.<p><p>“In a multicultural work environment, matters such as dress and diet can pose a challenge for patients, for employees with different ethnic backgrounds, and for Finns in general. We should remember that there are people who are Finnish born and bred but do not look like ethnic Finns at all.”<p><p>As Hanna Aschan sees it, Finland’s perceived attractiveness often depends on the country the person is coming from. Finnish pay levels are low by western European standards, and housing costs in the Helsinki area are quite high. On the other hand, Finland can offer safety, a clean environment, good social benefits, expertise, and nature all around.<p><p>“You already hear people saying that in Finland the sky is blue, compared with grey everywhere else,” says Hanna Aschan.<p><p>She believes that a lot of immigrants would like to stay in Finland as long as their basic needs are in order, that is to say their work is appreciated, their salary is good enough, they find a suitable place to live, their partner, too, has a job, and there’s a school place for their children.<p><p> <p><p>By Salla Korpela, December 2007, updated July 2008<p><p>Language is a safety factor in healthcare<p>", "time": "2012-08-01T13:26:00+00:00", "type": "facts-stats-and-info"}
{"title": "Work - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/work/", "review": "", "content": "<p>Finland is a great country to work in! These useful websites contain all you need to know about working in Finland.<p><p> <p><p>How to find a job<p><p>See also<p>", "time": "2010-05-13T12:56:00+00:00", "type": "facts-stats-and-info"}
{"title": "National programmes to support ageing workers - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/national-programmes-to-support-ageing-workers/", "review": "", "content": "<p>Three Finnish ministries – the Ministry of Social Affairs and Health, the Ministry of Employment and the Economy, and the Ministry of Education – all run national programmes to support well-being at work, enhance skills and boost working capacity right up to retirement age.<p><p>Funding from projects within the programmes has helped the maintenance of adult education, good practices for working life, better occupational healthcare, well-being at work, and procedures to further gender equality. In addition, money has been made available for outside projects, such as schemes at individual workplaces.<p><p> <p><p>In autumn 2006, the German Bertelsmann Foundation awarded its annual prize to the Finnish National Programme for Ageing Workers, and specialized programmes based on it, all of which are carried out by the Ministry of Social Affairs and Health, Ministry of Labour and Ministry of Education. The objective of these programmes is to extend the working life of employees, improve working conditions, and enhance people’s qualifications thus boosting their chances of finding employment.<p><p>In its citation the Foundation underlined the Finns’ excellent ability to adjust to changing circumstances and to practise broad-based cooperation. Implementation of the national strategy involves the government, trade unions, employers and various ministries. It has produced impressive results: the employment rate among Finnish workers aged 55–59 is 10 percent higher than the European average, and retirement now starts on average 1.2 years later than ten years ago.<p><p>The Bertelsmann Foundation is Germany’s biggest socially active foundation, backed by Bertelsmann AG, one of the world’s biggest media enterprises. The Foundation has awarded its annual Carl Bertelsmann prize for innovative and exemplary acknowledgement and solution of social problems since 1988.<p><p>The 150,000 euro award has been used to finance projects to increase well-being at work.<p><p> <p><p>By Salla Korpela, January 2008<p><p>Bertelsmann award for Finland<p><p>Finland’s approach wins international recognition<p>", "time": "2009-04-29T20:05:00+00:00", "type": "facts-stats-and-info"}
{"title": "How about getting a job in Finland? - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/how-about-getting-a-job-in-finland/", "review": "", "content": "<p>Finland has woken up to the fact that when the post-war baby-boom age groups retire, it will face a labour shortage that its own younger generation will be unable to fill.<p><p>If all the jobs that will be vacated in healthcare services over the next few decades had to be filled by Finns only, then one in four of Finland’s young people would have to train to be nurses. Since that situation is obviously not feasible, there is a clear need to recruit people from abroad in the coming years, especially in the service and healthcare sectors.<p><p>The idea of taking either a short-term or a permanent job in Finland, or actually settling here, is not as extraordinary as it was a mere 20 ago. The attractions of working in Finland include good working conditions and high employment security. Even the intriguing Finnish language poses no barrier to newcomers willing to make an effort, although admittedly it may slow them down a bit at first.<p><p>Despite the effect of economic ups and downs on the labour market, employers in Finland will need more skilled hands in the long run.Photo: Pentti Sormunen/Plugi<p><p>Finland has been, and still is to some extent, a culturally, ethnically and linguistically homogeneous country. However, this is gradually changing, with the growth of the European Union facilitating greater labour mobility. In 2014 the number of people moving to Finland totalled 31,510, almost double the number who emigrated (16,020).<p><p>Politically, Finland has also made a clear transition from a policy on aliens to on immigrants, and themes such as work-related immigration and social integration are part of the alignments of today’s government program. Despite the current economic crisis and its effects on the labour market, Finnish employers will need more skilled hands in the long run.<p><p>Finnish employers have participated in job fairs across Europe. Healthcare is one sector where demand is greater than supply.Photo: Plugi <p><p>Mobility is currently encouraged, especially within Europe. When European citizens wish to move abroad to work, they are assisted by EURES, the European Employment Services network. More than 800 advisers in public employment services in the EU Member States are involved in EURES. In Finland representatives can be found at Centres for Economic Development, Transport and the Environment in major towns. These experts help companies looking for workers from outside Finland and people in Finland seeking jobs abroad to find the necessary contacts and channels.<p><p>In recent years, hospitals all over Finland have actively encouraged Finnish expatriates in Sweden to return home. Furthermore, it has become common for numerous countries to arrange recruitment fairs. Poland, Slovakia, the Czech Republic and Hungary are some of the countries where Finnish employers have attended fairs.<p><p>“Those who come to talk to potential Finnish employers at fair stands include young people in particular, who may have studied in Finland through programmes such as the Erasmus exchange programme. They have pleasant memories of Finland and often speak some Finnish, too,” says ministerial adviser Tiina Oinonen of the Ministry of Employment and the Economy, who has been involved in EURES for a number of years.<p><p>Though immigrants are supported in many ways, coming to work in Finland does of course require a certain spirit of enterprise and an open mind. The most important issue, and the biggest, is language. There are very few jobs where it is possible to work without knowing any Finnish at all, and for reasons of occupational safety alone it is vital to be able to communicate.<p><p>In healthcare and any other field, knowing Finnish is an advantage. This may call for intensive learning, but experience shows that it’s doable.Photo: Tarja Hoikkala/Vastavalo<p><p>Local authorities – and indeed many employers too – provide immigrants and their families with language training, either free or at very low cost. There are individual differences in how fast people learn a new language, of course, but Oinonen reckons that with six months of intensive effort one should learn enough to get by at the average workplace. The level of Finnish skills necessary depends greatly on the nature of the work.<p><p>Finland places great value on vocational training, and statutory qualification requirements exist in many fields and positions. Anyone who has studied and gained a qualification outside Finland would therefore do well to check in advance that their qualifications are officially recognised in Finland.<p><p>Immigrants are entitled by law to integration services, with local authorities and employment and economic development offices carrying the prime responsibility for organising them.<p><p>So what does Finland have to offer workers from abroad? Why is it worth coming to Finland?<p><p>“Finland can offer good, high-quality working conditions, employees have a secure status, children and adolescents enjoy good educational opportunities, public services run smoothly and we have many successful, internationally respected companies,” Oinonen states.<p><p>And then of course there is our wonderful northern countryside with its multitude of recreational and sporting opportunities, a lively cultural life, a wide range of inexpensive study choices, clean and comfortable housing, and a society that really functions well in every way. Welcome to Finland!<p><p> <p><p> <p><p> <p><p>By Salla Korpela, updated October 2015<p><p>Labour mobility on the rise<p><p>Healthcare professionals needed<p><p>Open your mind to Finnish<p><p>Finland has much to offer<p><p>Quick facts<p><p>10 steps to working and living in Finland<p>", "time": "2014-07-30T13:09:00+00:00", "type": "facts-stats-and-info"}
{"title": "The Finnish flag - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/the-finnish-flag/", "review": "", "content": "<p>The Finnish flag with “the blue of our lakes and the white snow of our winters”, as a poet described these symbolic colours in 1870, was made official in a law enacted on May 29, 1918, less than six months after Finland had achieved independence.<p><p>The flag features a blue cross on a white background. It takes two forms, the national (civil) flag and the state flag.<p><p><p><p>The national flag is rectangular in shape and its dimensions are: height l l and width 18 units of measurement; width of cross 3 units, colour PMS294C; height of fields 4 units, length of fields at the hoist 5 units and of fields at the fly 10 units. Every Finnish citizen enjoys the right to fly the national flag. With certain exceptions, the national flag is flown by Finnish vessels as their national ensign.<p><p>Dimensions.<p><p>The state flag is either rectangular or three-pointed. The coat of arms of Finland is inset in the square formed by the intersecting arms of the cross. The square has a yellow border, the width of which is one-fortieth of the width of the cross. State departments and establishments fly the rectangular state flag. The Defence Forces use the three-pointed version of the flag, which is one unit of measurement longer than the national flag or the rectangular state flag. The President of the Republic uses a three-pointed version of the state flag, in the canton of which a blue and yellow Cross of Freedom is featured.<p><p>Updated January 2019<p><p>The national flag<p><p>The state flag<p><p> <p><p>Finnish official flag-raising days in 2019<p>", "time": "2015-02-18T09:29:00+00:00", "type": "facts-stats-and-info"}
{"title": "A long and fit working life - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/a-long-and-fit-working-life/", "review": "", "content": "<p>With the population ageing and the baby-boom generation starting to retire, more attention is being given to employee well-being in Finnish working life. How can employees be encouraged to stay on at work right up to pensionable age, while staying fit and active? Solutions are being found at national and workplace level. Even better, action to boost well-being at work is proving to be an investment that benefits companies and their staff.<p><p>A few years ago, Lassila &amp; Tikanoja Plc, a company engaged in environmental and property maintenance, woke up to the fact that incapacity to work was causing the company enormous costs and that the challenge posed by an ageing workforce would be a key competitive factor in the future.<p><p>“Direct staff-related costs account for about half of our total expenditure, so ensuring the working capacity of our personnel is an absolutely crucial element in our future success,” explains director Jorma Mikkonen.<p><p>In Finland, responsibility for dealing with and paying for occupational health and work disability is shared among many different actors. Big companies are required by law to provide for occupational health services, the Social Insurance Institution (KELA) deals with per diems and benefits that come under general social security, and companies handle pensions through their own pension foundations or one of several pension insurance companies. Every person resident in Finland is entitled to municipal healthcare services. The various cash flows and cost sources are complicated and difficult to follow within both society as a whole and individual companies. Research by Guy Ahonen published in 2004 indicated that work disability generated about 10 billion euros in costs every year, 2.5 billion of this in the 500 biggest companies.<p><p>Jorma Mikkonen: economic losses from work disability were enormous.Photo: Lassila &amp; Tikanoja<p><p>“Here at Lassila &amp; Tikanoja, we started to calculate the economic impact of work disability in 2005. It was a huge job digging out all the actual costs, but one well worth doing. We found that the company’s economic losses from work disability were about 20 million euros a year. That’s an enormous sum – nearly 40% of our net profit,” says Mikkonen.<p><p>The contributions for employment-related pensions paid by Finnish employers are at 11 levels, the lowest being 20% of total payroll and the highest 31%. The percentage a company has to pay depends on the level of its work disability costs during the two previous years. That means action to promote employee health and working ability can have a substantial impact on business costs.<p><p>“With our cost structure, there is a drift of about 14 million euros in pension contributions,” explains Mikkonen. “So the conclusion to be drawn was obvious: investing in maintaining and raising work capacity was definitely worthwhile.”<p><p>Lassila &amp; Tikanoja has devised a work capacity management programme called Sirius, aimed at ensuring that as many employees as possible stay fit and healthy right up to normal retirement age.<p><p>“Today, companies are financially responsible for staff work disability, yet have no effective way of managing what this costs. Expensive decisions are made elsewhere, and companies just have to pay up. At L&amp;T we launched a programme that allows us to actively influence these costs,” Mikkonen continues.<p><p>The processes of work capacity management are anchored in an accounting approach that treats realized costs as investments and constantly measures the financial impact of action taken.<p><p>The range of measures available to Sirius is extensive. One of the programme’s most important dimensions was a new agreement under which the nationwide company’s entire occupational health services were put into the hands of a single provider. This speeds up and simplifies employee tests and treatments, spreads good practices efficiently, and generates a central bank of information about staff healthcare challenges and needs.<p><p>Another important investment is in work safety and ergonomics.<p><p>“Nowadays, we pay serious attention to correct working positions and lifting and handling technique. For instance, if the driver of a waste collection truck jumps down from the cab onto a slippery street dozens of times a day, his joints aren’t going to last him till he retires. He has to take a bit longer and use steps,” explains Mikkonen.<p><p>The company supports sports and leisure activities that help prevent health problems and keep employees fit. Supervisors are encouraged to intervene as soon as possible in problems with intoxicants and mental health, for instance, and to help employees find suitable treatment and rehabilitation. Employees unable to do their previous jobs because of waning strength or injury are actively helped to find other work within the company and if necessary retrained for it.<p><p>“Employees who can no longer cope with their previous jobs are treated at L &amp; T as ‘key clients’ and we do everything we can to find them, or specially tailor for them, suitable work. Relocation is always a more financially sound option for the company than premature retirement. Many companies don’t seem to realize this,” says Mikkonen.<p><p>For such cases, the company has special Sirius instructors who help employees to get used to new tasks and arrange support services when necessary. The plans are formulated jointly by the employee, the supervisor and a doctor. Most employees are keen to make the move to different work. Lassila &amp; Tikanoja has even developed completely new services manned partly or entirely by staff with some impairment.<p><p>The margin earned on these services does not need to be very great, because the company is already making a significant profit from the fact that they are still workers and not pensioners.<p><p>For special situations there is also a crisis fund called ‘Medi-Heli’ after an emergency helicopter service of the same name. If necessary, this can used when swift decisions are needed to save work capacity and health, for instance to pay for fast private-sector surgery on an injury sustained in an accident.<p><p>“In the Sirius programme, the most important factor is the change in attitude. Top management monitor how the programme is used and its effects extend to every supervisor and worker. We used to think of money spent on occupational health as a cost, but now it’s viewed as an investment. The financial indicators see it that way, too: an additional spending of 2 to 3 million euros on staff work capacity can yield 10 million in cost savings, and that has a significant impact on competitiveness and profits,” Mikkonen sums up.<p><p>Labour shortage will become a problem. No company can afford to waste able hands. For comparison, Mikkonen says that Lassila &amp; Tikanoja can easily spend 60 million euros a year on machinery and equipment, and no-one questions the sum.<p><p>Half of the workforce will be retiring during the next 10 years. Finnish labour is a shrinking natural resource that should be better taken care of.<p><p>“People shouldn’t be treated like machines that are used until they break down and then replaced. This isn’t obvious if you look at things by the financial quarter, but we are investing in well-being in the long term.”<p><p>Markku’s injured leg doesn’t stop him working <p><p>Back to work after lengthy sick leave<p><p>L &amp; T maintenance man Markku Pihlakari was injured about four years ago in a fall when a ladder slipped from under him. His leg was operated on several times and he went through rehabilitation, but he was unable to return to outdoor work such as snow clearing and gritting because the leg is too stiff to enable him to operate the machinery. After a long sick leave Markku was found a completely different job in charge of the loading bays at a large shopping centre.<p><p>“I have to make sure the loading bays are kept clean and in order, and advise the cleaners and shop staff on waste handling,” Markku explains.<p><p>The Sello shopping centre houses over 160 shops. It has to deal with enormous volumes of goods, and if the whole system is to work efficiently and safely it is vital for nothing to be left lying around. It’s Markku’s job to ensure this, and both customers and the fire inspector are satisfied.<p><p>“People aren’t disposables, and Lassila &amp; Tikanoja understand that. It’s good to see a company that meets its responsibilities and looks after its people.” says Markku Pihlakari.<p><p>The Finnish listed company Lassila &amp; Tikanoja Plc specializes in environmental maintenance and support services for real estate and properties. Its turnover is in excess of 500 million euros and it employs some 9,500 people. L&amp;T also operates in Sweden, Latvia, Russia and Norway.<p><p>By Salla Korpela, January 2008<p><p>Containing the cost of disability<p><p>Fit on retirement<p><p>L &amp; T places staff in suitable jobs<p><p>Work capacity aid targeted beyond the ongoing quarter<p><p>Lassila &amp; Tikanoja Plc<p>", "time": "2010-09-24T13:39:00+00:00", "type": "facts-stats-and-info"}
{"title": "Study and work info - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/study-and-work-info/", "review": "", "content": "<p> <p><p>Studying<p><p>Get INTO it<p><p>Working<p>", "time": "2000-09-01T04:49:07+00:00", "type": "facts-stats-and-info"}
{"title": "Coat of arms - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/coat-of-arms/", "review": "", "content": "<p>The following is a brief description of Finland’s national coat of arms, its symbolism and history. The account is based on the official blazon and the most widely approved explanation.<p><p>When King Gustav I of Sweden (died 1560) gave his son John the title of duke of Finland in 1556, the territory also received its own coat of arms, which was probably approved by the king in 1557, although as far as we know Duke John never used it. In addition to national emblems, this coat of arms (Figure 1) included two other symbols referring to northern and southern Finland, in actual fact the areas of Satakunta and Varsinais Suomi (Finland Proper). These two symbols were later retained in the arms of these two provinces.<p><p>After ascending the Swedish throne, King John III adopted the title of “Grand Duke of Finland and Karelia” in the year 1581. It was probably at this time or a little later that Finland received a second coat of arms, which is somewhat like the present one. This coat of arms is generally thought to have been modelled on a shield sculpted for the tombstone of King Gustav I at the Uppsala Cathedral (completed 1591). This monument was designed during the reign of John’s elder brother, Erik XIV, who was king from 1560 to 1568, but it was only completed some thirty years later during John’s reign. The shield was probably designed by the Dutch artist Willem Boyen, who served under both Gustav I and Erik XIV.<p><p>There is no way to know whether Finland’s second coat of arms was purely the product of Willem Boyen’s own imagination or whether it was based on Erik XIV’s wishes or some other unknown historical tradition. It is known, however, that Erik XIV was himself interested in heraldry. This matter has been the subject of considerable academic debate among scholars and laymen.<p><p>At any rate, the general consensus has been that the symbol of the lion is derived from the arms of the Folkung family, which are included in the royal arms of Sweden. The two swords were borrowed from the Karelian coat of arms, which was publicly displayed for the first known time on a banner at the funeral of King Gustav I in 1560.<p><p>The placing of the curved Russian sabre beneath the lion’s paws is undoubtedly a reflection of the political situation at this time. Sweden and Russia were almost constantly at war, and the Swedes made use of this propaganda device to imply that they had the upper hand over their enemies. The nine roses are decorative, although they have falsely been interpreted as referring to Finland’s nine historical provinces. It is worth noting that the number of roses has varied over the centuries.<p><p>When Finland gained independence in 1917, the “lions arms” became the coat of arms of the new nation. Before this it had served as the common symbol for all the Swedish territory to the east of the Gulf of Bothnia; and from 1809 to 1917 it served as the coat of arms for the Grand Duchy of Finland, which was under Russian rule during this period.<p><p>The Finnish coat of arms appears on the state flag, official seals, coins, banknotes and postage stamps. On the President’s car it takes the place of an ordinary registration plate.<p><p>It was not until 1978 that legislation was passed concerning Finland’s coat of arms. This legislation gives the official blazon and prohibits the sale of the national coat of arms, subject to fine.<p><p>The national coat of arms displays a crowned lion standing on a red field. The lion holds a raised sword in its right gauntleted fore leg and is trampling a curved sabre. The lion, the crown and the sword and sabre handles are gold, as are the gauntlet joints. The blades and the gauntlet are silver. The field is adorned by nine silver roses.<p><p> <p><p>By Maunu Harmo, former president of Finnish Society of Heraldry, last updated March 2011<p><p>National Coat of Arms<p>", "time": "2013-10-01T11:51:00+00:00", "type": "facts-stats-and-info"}
{"title": "The Finnish national anthem - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/the-finnish-national-anthem/", "review": "", "content": "<p>The Finnish national anthem, with words by Johan Ludvig Runeberg and music by Fredrik Pacius, was first performed in 1848 by students celebrating Flora Day (May 13) in a meadow belonging to Kumtähti Manor in Helsinki.<p><p>J.L. Runeberg, headmaster of Borgå Lyceum in Porvoo, had written the original text in Swedish, called “Vårt land” (Our Land), two years earlier. The poem was published in autumn 1846 as the prologue to Runeberg’s Fänrik Ståls sägner (The Tales of Ensign Stål), a collection of 35 heroic ballads set in the days of the War of Finland in 1808–09. As a result of this war, Sweden ceded Finland to Russia in the 1809 Treaty of Hamina.<p><p>Runeberg’s aim was to stir Finnish patriotic feeling with his epic. He is said to have been inspired to write “Vårt land” by Mihaly Vörösmarty’s “Szózat,” the Hungarian national anthem published in 1836. Until well into the 20th century, Finns responded strongly to the idealistic and political idealism of Fänrik Ståls sägner and “Vårt land.” Runeberg was promptly elevated to the status of national poet.<p><p>Runeberg was a conservative and moderate nationalist, and loyal to the powers that be. The main concern of the authorities was to prevent the emergence of radical ideas; the revolutionary spirit of the Marseillaise was finding some support in Finland at the time. “Vårt land” helped appease the patriotic yearnings of the students, and the bloodshed seen in other parts of Europe was averted in Finland.<p><p>Several composers had already attempted to set Runeberg’s lofty poem to music before Fredrik Pacius, a German-born composer and music lecturer at the University of Helsinki, but his was the first version to gain widespread popularity. The composer himself conducted the university choir in a slow, majestic first performance, andante maestoso, which moved the crowd to tears. Pacius’s tune was later also adopted for “Mu isamaa” (My Country), the Estonian national anthem from 1918 to 1940 and again since 1990.<p><p>Historians like to say that Finland was born on Flora Day, May 13, 1848. Fredrik Cygnaeus, chairman of the student body, made the main speech at the celebration, concluding with the toast “To Finland.” The student body had a flag, representing a laurel-crowned lion on a white field, made specially for the celebration; this can be said to have been the first Finnish flag. At the end the audience, several hundred strong, jubilantly joined in with “Vårt land.” For the first time, the idea of a distinct Finnish national identity had been put forward.<p><p>“Vårt land” rapidly won general acceptance as an expression of patriotic sentiment, especially after Paavo Cajander published his polished Finnish translation (“Maamme”) towards the end of the 19th century.<p><p>Words by J.L.Runeberg 1846 Music by Fredrik Pacius 1848 Translation by Clement Burbank Shaw<p><p>Our land, our land, our fatherland, Sound loud, O name of worth! No mount that meets the heaven’s band. No hidden vale, no wavewashed strand. Is loved, as is our native North. Our own forefathers’ earth.<p><p>Thy blossom, in the bud laid low, Yet ripened shall upspring. See! From our love once more shall grow Thy light, thy joy, thy hope, thy glow! And clearer yet one day shall ring The song our land shall sing.<p><p>Oi maamme, Suomi, synnyinmaa! Soi, sana kultainen! Ei laaksoa, ei kukkulaa, ei vettä rantaa rakkaampaa kuin kotimaa tää pohjoinen. Maa kallis isien.<p><p>Sun kukoistukses kuorestaan kerrankin puhkeaa; viel’ lempemme saa nousemaan sun toivos, riemus loistossaan, ja kerran laulus, synnyinmaa korkeemman kaiun saa.<p><p>Vårt land, vårt land, vårt fosterland, ljud högt, o dyra ord! Ej lyfts en höjd mot himlens rand, ej sänks en dal, ej sköljs en strand, mer älskad än vår bygd i nord, än våra fäders jord!<p><p>Din blomning , sluten än i knopp, Skall mogna ur sitt tvång; Se, ur vår kärlek skall gå opp Ditt ljus, din glans, din fröjd, ditt hopp. Och högre klinga skall en gång Vår fosterländska sång.<p><p>Maamme (Yle Elävä arkisto)<p><p> <p><p>“Maamme” – The Finnish National Anthem<p><p><p><p><p><p>Our Land<p><p>Maamme<p><p>Vårt land<p><p>Listen:<p>", "time": "2011-03-29T07:42:00+00:00", "type": "facts-stats-and-info"}
{"title": "Study - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/study/", "review": "", "content": "<p> Are you considering studying in Finland? Great choice!<p><p>Take a look at these sites to get you started:<p><p> <p><p>See also<p>", "time": "2000-05-13T12:48:00+00:00", "type": "facts-stats-and-info"}
{"title": "Practical info for businesses - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/practical-info-for-businesses/", "review": "", "content": "<p>Who can help me do business in Finland?<p><p>Invest in Finland offers a full set of professional, hands-on investment services that are always tailored according to a company’s specific needs. The services cover every stage of setting up a business in Finland, ranging from initial data collection and opportunity analysis to networking and the actual business launch.<p><p>I’m interested in doing business with Finnish companies. How should I proceed?<p><p>The best way to forge business contacts with Finnish companies is to contact Finpro.<p><p>How do I find info on rules and regulations?<p><p>Enterprise Finland: Info on assistance available for establishing and developing businesses.<p><p>Suomi.fi: Public services portal with info about developing a company; international trade; and public sector services for businesses.<p><p>See more on the Infopankki (Info Bank) website.<p><p>What kind of public funding is available for companies?<p><p> <p><p>Resources<p>", "time": "2000-05-13T12:40:00+00:00", "type": "facts-stats-and-info"}
{"title": "Move - thisisFINLAND", "url": "https://finland.fi/facts-stats-and-info/move/", "review": "", "content": "<p>Thinking about taking the plunge, making the move? Here are the addresses you need to help you plan.<p><p> <p><p>More than 167,000 foreign citizens reside permanently in Finland. Check how many come from your country in the Annual Report on Migration and Asylum Policy.<p><p> <p><p>Things to do<p><p>See STATS<p>", "time": "2000-04-28T21:00:00+00:00", "type": "facts-stats-and-info"}
