{"title": "Inflation reduces slightly to 1.2% in December", "url": "http://www.dailyfinland.fi/business/8797/Inflation-reduces-slightly-to-1.2-in-December", "review": "", "content": "<p>The year-on-year change in consumer prices calculated by Statistics Finland was 1.2 per cent in December, according to Statistics Finland.<p> <p>In November, inflation stood at 1.3 per cent. Inflation slowed down above all because the rising of liquid fuel and electricity prices eased off. In 2018, the average inflation rate was 1.1 per cent.<p> <p>Consumer prices were raised most in December by increases in the prices of cigarettes, electricity and fuels and capital repair on detached house from one year ago.<p> <p>The rising of consumer prices from one year back was curbed most by reductions in the prices of child day care, mobile phones, used cars, televisions and detached houses. From November to December, the month-on-month change of consumer prices was -0.1 per cent.<p> <p>Each mid-month, Statistics Finland's interviewers collect altogether around 50,000 prices on nearly 470 commodities from approximately 2,700 outlets for the Consumer Price Index. In addition, some 1,000 items of price data are gathered by centralised collection.<p>", "time": "15 Jan 2019, 00:33", "type": "business"}
{"title": "How Might Brexit Affect Finland?", "url": "http://www.dailyfinland.fi/business/8793/How-Might-Brexit-Affect-Finland", "review": "", "content": "<p>Brexit remains one of the most talked-about topics in Europe, with the UK’s decision to leave the EU inciting a lot of debate and bringing up questions that are difficult to answer.<p> <p>Most of the coverage focuses on Britain’s chances of success when it strikes out alone, devoid of the support and close cooperation it enjoyed as a member state of the union in the past. However, it is equally important to consider how Brexit’s ripples will be felt in other countries and assess the obstacles and opportunities that will be created.<p> <p>Finland is just one EU nation that will undoubtedly notice changes in the wake of Brexit, but what shape will such shifts take and will it be for the better or the worse?<p> <p><strong>Influencing Public Opinion</strong><p> <p>One of the most interesting effects of the Brexit vote in 2016 and the subsequent disasters that have plagued the negotiation process following the triggering of Article 50 is the change in public opinion on the topic of Europe in other member states.<p> <p>In Finland, for example, those aged under 30 are overwhelmingly in favour of remaining part of the union, with 81 per cent of this age group giving their support <a href=\"https://yle.fi/uutiset/osasto/news/survey_majority_of_youth_back_eu/10135287\">in a recent study</a>.<p> <p>In another report, 70 per cent of all Finnish people questioned said that they believed they had benefited from being EU members. Rather than increasing nationalistic feelings, Brexit seems to have cemented the idea that it is better for Finland to be a small fish in a large school, rather than a lone sprat swimming independently.<p> <p><strong>Impacting Goods &amp; Services</strong><p> <p>The UK and Finland have a solid economic relationship today, with the former providing a range of products and services including cars and technology, while the latter <a href=\"https://tradingeconomics.com/finland/exports/united-kingdom\">splits its offerings</a> between paper, wood, mineral fuels and machinery.<p> <p>In the event of no Brexit deal being reached before the March 29<sup>th</sup> deadline, continuing trade along the same lines might become incredibly difficult.<p> <p>One area which should avoid the effects is online gambling. Games and slots like Gemix can be<a href=\"https://www.casumo.com/fi/pelaa/gemix/\"> played online at Casumo</a> and other UK-licensed sites from a number of European nations, and there is no reason to assume that such services will cease to be available after Brexit.<p> <p>Gambling in the UK is a widely embraced, albeit heavily regulated industry and should prove robust in the face of any economic upset that is inevitably going to be a short term result of Brexit in any form.<p> <p><strong>Travel &amp; Work</strong><p> <p>Membership of the EU affords residents of participating nations the opportunity to easily travel and work in other countries without needing to worry about paying for expensive visas or encounter complications as part of the customs process. While assurances about how this will play out after Brexit have been made by some politicians, a lot is still up in the air about this issue.<p> <p>What seems virtually guaranteed is that there will be tighter restrictions on who can enter and leave the UK, both as a result of the country’s own imposition of new immigration rules and due to the likelihood that the EU will have its own bureaucratic layer to add to proceedings.<p> <p>In short, anyone hoping to visit Britain as a tourist may face higher costs getting there, even if the weaker value of the pound will mean that your Euros will go a lot further once converted. Whether Finnish nationals hoping to move to the UK to work will be able to do so with the same ease and freedom as today is unlikely, adding to the overall lack of clarity that makes up the Brexit picture at the moment.<p>", "time": "14 Jan 2019, 17:28", "type": "business"}
{"title": "Wages, salaries grow by 4.4% in Sep-Nov", "url": "http://www.dailyfinland.fi/business/8791/Wages-salaries-grow-by-4.4-in-Sep-Nov", "review": "", "content": "<p>The wages and salaries sum of the whole economy was 4.4 per cent greater in the September to November period than in the corresponding period twelve months earlier, according to Statistics Finland.<p> <p>In November, the wages and salaries sum of the whole economy grew by 6.3 per cent from the year before. One year previously in September to November, the wages and salaries sum of the whole economy increased by 3.4 per cent.<p> <p>In September to November, the wages and salaries sum increased faster than the whole economy in the industries of private health and social work (6.5%), construction (6.3%) and other services (5.7%).<p> <p>The increase in the wages and salaries sum was most moderate in the industries of manufacturing (2.6%) and private education (1.8%).<p> <p>The wages and salaries sum in the private sector was 5.0 per cent greater in September to November than twelve months earlier. The wages and salaries sum of the public sector was 3.8 per cent higher than in the corresponding period one year previously. In November, the wages and salaries sum in the private sector increased by 7.8 per cent and in the public sector by 4.2 per cent from one year earlier. In September to November one year ago, the wages and salaries sum grew by 4.9 per cent in the private sector and by 0.7 per cent in the public sector from the previous year.<p>", "time": "14 Jan 2019, 04:09", "type": "business"}
{"title": "Industrial output grows in November", "url": "http://www.dailyfinland.fi/business/8762/Industrial-output-grows-in-November", "review": "", "content": "<p>Seasonally adjusted industrial output (TOL BCD) grew by 0.4 per cent in November from the month before.<p> <p>According to Statistics Finland, industrial output adjusted for working days was 1.6 per cent higher in November 2018 than in November 2017. Adjusted for working days, industrial output went up by 3.9 per cent in January to November from one year back.<p> <p>Seasonally adjusted industrial output grew in several main industries in November. Seasonally adjusted industrial output grew most in mining and quarrying, by 4.6 per cent. In the chemical industry, output grew by 1.3 per cent. Output decreased most, by 6.7 per cent, in the electrical and electronics industry.<p>", "time": "12 Jan 2019, 03:05", "type": "business"}
{"title": "Audi car sales down 3.5% worldwide in 2018", "url": "http://www.dailyfinland.fi/business/8744/Audi-car-sales-down-3.5-worldwide-in-2018", "review": "", "content": "<p>Audi delivered around 1,812,500 automobiles to customers worldwide in 2018, 3.5 percent less than the year before, the German luxury car manufacturer announced on Thursday.<p> <p> Audi CEO Bram Schot said that his company was now \"preparing for new challenges after a challenging year.\"<p> <p> In Europe, Audi sales have fallen by 13.6 percent over the past twelve months. According to Audi, the car manufacturer had replaced almost a third of its deliveries with important model changeovers for the A1, A6, A7 and Q3 models since the start of the year.<p> <p> \"As expected, 2018 has proven extremely challenging with the largest model and technology campaign in Audi's history -- coinciding with the switch to the new WLTP (Worldwide Harmonized Light Vehicle Test) cycle,\" said Schot.<p> <p> Total Audi sales were boosted by a growing business in China, where the Ingolstadt-based carmaker reaffirmed its position as the \"most successful premium brand for the 30th year in succession\" and closed the year with a new record 663,049 automobiles sold, representing an increase of 10.9 percent.<p> <p> Audi is aiming to set an important milestone in the second half of this year for the electrification of the Chinese model range by introducing the first electric car produced in China, the Audi Q2 L e-tron.<p> <p> Speaking to Xinhua on Thursday, an Audi spokesperson said that the car made in China is expected to be \"launched in the second half of 2019\". The new A6 L, which is also produced locally in China, will be made available in January.<p> <p> Audi sales in North America remained almost stable. For the first time in the history of Audi, SUV sales accounted for 57 percent of total deliveries in America.<p>", "time": "11 Jan 2019, 00:45", "type": "business"}
{"title": "China grants export licence to Finnish infant formula", "url": "http://www.dailyfinland.fi/business/8729/China-grants-export-licence-to-Finnish-infant-formula", "review": "", "content": "<p>China has granted for the first time an export licence to establishments of a Finnish company that manufactures infant formula, said a press release issued by the Ministry of Agriculture and Forestry on Wednesday.<p> <p>Export licence to China is a significant step forward in food trade between Finland and China. The licence was granted during the visit of Permanent Secretary Jaana Husu-Kallio in Beijing on 8 January 2019.<p> <p>China offers an enormous market for infant formula. So far Finland has exported milk and whey to China, where these have been processed into infant formula. Now the products can be manufactured and packaged in Finland for retail to be sold directly to Chinese consumers. Of the dairy products Finland also exports butter and small volumes of cheeses to China.<p> <p>“This is a significant milestone in the history of Finnish food exports. Infant formulas are high value added products where the Finnish clean and safe raw material and production practices have the prominent role they truly deserve”, said Minister of Agriculture and Forestry Jari Leppä.<p> <p>Opening the export licences has been prepared as a collaborative effort by the export team of the Finnish Food Authority (until the end of 2018 the Finnish Food Safety Authority Evira).<p> <p>The Chinese authorities have been provided with comprehensive analyses of the manufacture of infant formulas in Finland, and the authorities have visited Finland to inspect the establishments producing infant formulas to verify that they comply with the Chinese requirements.<p>", "time": "10 Jan 2019, 03:30", "type": "business"}
{"title": "UPM bids for pulp terminal in deep sea port in Uruguay", "url": "http://www.dailyfinland.fi/business/8731/UPM-bids-for-pulp-terminal-in-deep-sea-port-in-Uruguay", "review": "", "content": "<p>Finnish forest industry company UPM is taking part in the international public tendering process in the port of Montevideo organized by the National Ports Administration (ANP) of Uruguay, said an official press release.<p> <p>The scope of the concession tender is the building and operation of a port terminal specialized in the storage and shipping of pulp, chemicals and other inputs related to pulp production with a capacity to handle approximately 2 million tonnes of pulp annually.<p> <p>The tender includes the design, financing, engineering, construction, operation and maintenance of the pulp terminal. The tenure of the concession would be for 50 years.<p> <p>The tender is made in the context of UPM's current study on the potential of building a new pulp mill in Uruguay. The investment agreement with the Government of Uruguay was signed in 2017.<p> <p>As part of the agreement the Government will promote concession for a terminal specializing in pulp in the Montevideo port with rail access. The possible pulp mill would have an annual capacity of approximately 2 million tonnes of eucalyptus market pulp. The preliminary estimate for a pulp mill investment on site is approximately EUR 2 billion.<p> <p>Two preparation phases need to be successfully completed before UPM would be in a position to make a final investment decision on the pulp mill. The second preparation phase is currently proceeding. Achieving significant progress in the implementation of the agreed infrastructure initiatives by the Government of Uruguay and any relevant items are to be agreed prior to the possible final investment decision. If these two preparation phases are concluded successfully, UPM will initiate the company's regular process of analysing and preparing an investment decision.<p> <p>If awarded a concession in the Montevideo port, UPM's financial commitment in the form of a performance bond would be USD 20 million at this stage. At the time of the potential final investment decision on the pulp mill project UPM would proceed with the port investment decision and start of the construction of the port facilities. The preliminary UPM investment estimate for the port facilities would be approximately USD 260 million.<p>", "time": "10 Jan 2019, 03:55", "type": "business"}
{"title": "ETLA for easier recruitment of foreign labour for growth", "url": "http://www.dailyfinland.fi/business/8702/ETLA-for-easier-recruitment-of-foreign-labour-for-growth", "review": "", "content": "<p>The Research Institute of the Finnish Economy (ETLA) predicted on Tuesday that Finland could maintain a two percent economic growth during the next parliamentary period 2019 to 2023.<p> <p>But it would require cutback in unemployment benefits, cancelation of the general right to sabbaticals, and easier recruitment of foreign labour, the institute noted in a media release.<p> <p>In its recommendations to the government that would start after the April general election, the institute suggested that the right of long term employees to take up to a year off should be discontinued. In the current system created in the late 1990s, compensation during the sabbatical has nearly matched the unemployment benefits.<p> <p>ETLA also suggested that the right of people over 60 to get extended unemployment benefits until retirement should be stopped.<p> <p>The institute urged that the recruitment of persons from outside the European Union (EU) and European Economic Area (EEA) should be eased through giving up the labour market evaluation requirement. In the current system, the unfeasibility of finding a worker from within the EU and EEA must be verified.<p> <p>ETLA also suggested that in the future, income transfers collected in taxation should be used to help the lowest income segment. For the rest of the nation, the maintenance of a certain consumption level should rather be based on insurance or borrowing, ETLA envisioned.<p> <p>ETLA, one of the leading economic research institute in Finland, is closely associated with the industrial and commercial business scene.<p>", "time": "08 Jan 2019, 23:51", "type": "business"}
{"title": "Telia to discontinue landline services", "url": "http://www.dailyfinland.fi/business/8708/Telia-to-discontinue-landline-services", "review": "", "content": "<p>The Nordic telecoms operator Telia on Tuesday announced to stop new connections of landline services and discontinue the existing landline gradually.<p> <p>The existing landline services will be converted into mobile lines, said a press release.<p> <p>Telia currently operates about 30,000 landline telephone including few thousand of these connections used by private persons.<p> <p>The authority, however, will communicate with the affected subscribers and offer alternative connections during the transitional period.<p> <p>\"The number of landlines and subscribers has steadily decreased in recent years. Moreover, the technology behind landline telephones became outdated,\" said Technology Director of Telia Finland, Jari Collin.<p>", "time": "09 Jan 2019, 03:29", "type": "business"}
{"title": "Global economic growth to slow to 2.9% in 2019: WB", "url": "http://www.dailyfinland.fi/business/8706/Global-economic-growth-to-slow-to-2.9-in-2019-WB", "review": "", "content": "<p>Global economic growth is projected to slow to 2.9 percent in 2019 from a downwardly revised 3 percent in 2018 amid rising downside risks, the World Bank said on Tuesday. <p> <p> In its newly-released Global Economic Prospects report, the World Bank said the outlook for the global economy \"has darkened\" as global financing conditions have tightened, trade tensions \"have intensified,\" and some large emerging market and developing economies have experienced significant financial market stress.<p> <p> \"Faced with these headwinds, the recovery in emerging market and developing economies has lost momentum,\" the report said, expecting emerging market and developing economies to grow at 4.2 percent in 2019, 0.5 percentage points lower than previously projected in June.<p> <p> Growth in advanced economies is estimated to slow to 2 percent in 2019 from 2.2 percent in 2018, as major central banks continue to withdraw monetary policy accommodation, according to the report.<p> <p> \"Downside risks have become more acute and include the possibility of disorderly financial market movements and an escalation of trade disputes,\" the report said, warning that intensifying trade tensions could result in weaker global growth and disrupt globally interconnected value chains.<p>", "time": "09 Jan 2019, 01:00", "type": "business"}
{"title": "Balance of trade posts €60m deficit in November", "url": "http://www.dailyfinland.fi/business/8710/Balance-of-trade-posts-€60m-deficit-in-November", "review": "", "content": "<p>The trade balance showed a deficit of 60 million euros in November, according to the preliminary statistics of international trade provided by Finnish Customs.<p> <p>Calculated from January to November there was a deficit of 2.2 billion euros, said a press release on Tuesday.<p> <p>Under the same period year 2017, the balance of trade showed a deficit of 2.4 billion euros. In 2017, the trade balance for November showed a deficit of 238 million euros.<p> <p>The value of Finnish exports increased by nine per cent and the value of imports by five per cent in November year-on-year.<p> <p>The value of Finnish exports in November was almost 5.8 billion euros and the value of imports was slightly over 5.8 billion euros. Calculated from the beginning of the year, both exports and imports increased by seven per cent year-on-year.<p> <p>Exports to EU member states increased by nine per cent in November and exports to non-EU countries by eight per cent. Imports from EU-countries increased by two per cent and imports from non-EU countries by ten per cent in November.<p> <p>Calculated from the beginning of the year, exports to EU increased by six per cent and exports to non-EU countries by nine per cent. During the same period, the value of imports from EU member states rose by four per cent and from other countries by ten per cent.<p>", "time": "09 Jan 2019, 03:41", "type": "business"}
{"title": "New car registration slides by 23.7% in December", "url": "http://www.dailyfinland.fi/business/8696/New-car-registration-slides-by-23.7-in-December", "review": "", "content": "<p>A total of 10,735 new motor vehicles were registered in December 2018, of which 7,607 were automobiles, according to Statistics Finland.<p> <p>First registrations decreased by 29.5 per cent from the corresponding month of the previous year.<p> <p>In December the number of new private cars registered was 6,159, which was 23.7 per cent down from the year before.<p> <p>The share of new diesel-driven passenger cars was 27.6 per cent.<p> <p>These data are based on the Vehicular and Driver Data Register of the Finnish Transport and Communications Agency (Traficom). The numbers are exclusive of the vehicles on the Åland Islands.<p> <p>In the January to December period of 2018 a total of 191,803 vehicles were first registered. Compared to the year before, there was decrease of 0.6 per cent.<p> <p>The number of private cars first registered in the January to December period was 120,499, which is 1.6 per cent up from the year before.<p> <p>The most common passenger car makes first registered in the January to December period were Toyota, Volkswagen and Skoda.<p>", "time": "08 Jan 2019, 01:42", "type": "business"}
