{"title": "300 nominations received for Int´l Gender Equality Prize", "url": "http://www.dailyfinland.fi/culture/8682/300-nominations-received-for-Int´l-Gender-Equality-Prize", "review": "", "content": "<p>More than three hundred nominations from all over the world were received for the International Gender Equality Prize to be awarded in autumn 2019, said a government press release.<p> <p>The call for proposals for the next recipient of the Prize closed on December 31, 2018.<p> <p>The prize is awarded to a person or organisation that has advanced gender equality in a globally significant way.<p> <p>“We are pleased with the number of proposals we received and would like to extend our thanks to all those who submitted an entry,” said Jorma Korhonen, Secretary of the jury from the Prime Minister’s Office.<p> <p>Entries submitted by the general public will be sent for evaluation to a jury, which will then make its recommendation for the recipient to the Government. The Government will make the final decision on the recipient of the prize.<p> <p>“The jury is looking forward to learning about the promoters of gender equality who have been proposed by people from various parts of the world,” Korhonen said.<p> <p>The members of the jury for 2019 are Pekka Haavisto, Member of Parliament and chair of the jury; Eva Biaudet, President of the National Council of Women of Finland; Katja Iversen, President and CEO of Women Deliver; Anneli Jäätteenmäki, Member of the European Parliament; and Dean Peacock, co-founder and Co-Executive Director of South African NGO Sonke Gender Justice.<p> <p>The prize amounts to EUR 300,000 and the recipient will direct it to a cause, organisation or person that promotes gender equality. <p> <p>The International Gender Equality Prize is awarded once every two years in cooperation with the City of Tampere.<p>", "time": "07 Jan 2019, 02:00", "type": "culture"}
{"title": "Posti´s stamp wins world's best stamp award", "url": "http://www.dailyfinland.fi/culture/8667/Posti´s-stamp-wins-worlds-best-stamp-award", "review": "", "content": "<p>A Finnish postal stamp of Posti has won the first prize in the competition of world´s Best Stamps Award announced in Spain, reported national broadcaster Yle.<p> <p>The stamp portraying a summer scene in the Turku archipelago shows a reflection of islands and clouds on a sunny day was also selected the most beautiful stamp of 2017 by Finns in a competition organized by national postal and logistic services operator Posti.<p> <p>\" The stamp represents the calm and tranquility of Finnish nature,” said the Yle report, quoting the jury of the International Nexofil Awards as saying.<p> <p>Stiina Hovi designed the stamp named \"Calm and Tranquil\" based on a photograph of Jari Hakala´s \"Archipelago Clouds\" taken in Nagu (Nauvo) in southwest part of the country.<p> <p>Philatelists from a total of 37 countries participated in the contest and the jury awarded prizes to the best stamps in 10 categories. <p> <p>The prize for the best original shape went to an Austrian stamp contoured like an oak and made of the tree's veneer. Meanwhile, New Zealand won the award for the most innovative stamp. Its “Grow your own – Sustainable: Carrots” stamp includes carrot seeds for planting, the Yle report added.<p> <p> <p>", "time": "06 Jan 2019, 00:10", "type": "culture"}
{"title": "Finns welcome New Year amid festivity, joy", "url": "http://www.dailyfinland.fi/culture/8610/Finns-welcome-New-Year-amid-festivity-joy", "review": "", "content": "<p>The celebrations of New Year 2019 have begun across the country amid festivity and joy.<p> <p>The New Year celebrations attracted several thousands of people who welcome the 2019 moment after midnight through fireworks displays almost every part of the country.<p> <p>The main crowd was reported at the Citizens’ Square in the capital where about 80, 000 people gathered to welcome the new year.<p> <p>The local municipalities organized fireworks displays in every city to mark the farewell of the old year and welcome the new year.<p> <p>In addition to this, people from all strata were seen to buy fireworks from the local markets and displayed by their own initiatives.<p> <p>Well-known artists took to the stage to perform during the celebrations in Helsinki which reached a fever pitch when the fireworks lighted the sky.<p> <p>Around 20,000 people gathered to witness the fireworks display in the coastal city of Turku.<p> <p>Earlier, police allowed display of Fireworks from 6:00 pm to 2:00 am on the new year eve and early new year.<p> <p>The New Year´s fireworks, however, was affected by stormy weather as per the forecast made by Finnish Meteorological Institute.<p> <p>Today is public holiday. All government, semi-government and private offices will remain closed on the occasion of the New Year.<p>", "time": "01 Jan 2019, 05:22", "type": "culture"}
{"title": "Espoo to celebrate New Year with laser show", "url": "http://www.dailyfinland.fi/culture/8565/Espoo-to-celebrate-New-Year-with-laser-show", "review": "", "content": "<p>While the public voice for banning fireworks is rising, the city of Espoo in southern Finland will be the first city in the country to celebrate the New Year with laser light show instead of firecrackers, media reported on Friday.<p> <p>In Finland, New Year is usually celebrated with fireworks provided by municipalities, but this is thought to be old-fashioned by the city of Espoo, Lea Rintala, director of Culture Services Unit of Espoo, told Finnish national broadcaster Yle.<p> <p>\"We are a sustainable development city and rockets don't really suit well with that. However, over the years we have received some feedback about this, so we are now trialing a laser show,\" Rintala was quoted as saying.<p> <p>She added that the news of the alternative to fireworks has already generated a surprising amount of interest.<p> <p>The laser show will start in downtown Espoo at 18:20 local time on the New Year's eve. The show will cover an area including the Espoo cathedral, the nearby Church Park and the river bank. Other light shows may also take place in other parts of the city during the year, according to Rintala.<p> <p>The southwest city of Finland Turku is considering to follow Espoo's footsteps, said Yle.<p> <p>The public demand for banning consumers from using fireworks is constantly rising in recent couple of years in Finland, aiming to reduce the cases of injuries, air pollution and stress and anxiety in animals caused by fireworks.<p> <p>A citizens' initiative to prohibit the use of fireworks by private individuals was launched in early December this year and has gathered the support of nearly 40,000 individuals so far.<p> <p>If the initiative will collect a total of 50,000 signatories by June, 2019, the Finnish MPs have to consider legislative changes on use of fireworks. <p> <p>According to Yle, Norway banned the use of fireworks by private individuals years ago. Sweden will require a permit for the use of certain kinds of stick-mounted fireworks from the beginning of next year.<p>", "time": "28 Dec 2018, 20:47", "type": "culture"}
{"title": "Finland breaks free from legally enforced tranquility", "url": "http://www.dailyfinland.fi/culture/8533/Finland-breaks-free-from-legally-enforced-tranquility", "review": "", "content": "<p>Legally enforced Christmas tranquility is fast slipping away from Finland.<p> <p>As a latest sign of the change, the stores of the national alcohol monopoly are allowed to keep their doors open on Christmas Eve on Monday all over Finland, for the first time following a change in the national alcohol act.<p> <p>And in the capital city Helsinki, trams and buses of the city transit system keep operating as on any weekend.<p> <p>Until a few years ago, Finland used to halt to a standstill during the Christmas holiday. Shops were then ordered by law to stay closed after 3 pm on Christmas Eve. As part of the tradition, although not ordered by law, city public transit stopped service from the afternoon of Christmas Eve and long haul trains and buses offered only a skeleton service.<p> <p>The change started in Christmas in 2017 when shops could stay open as the Shopping Hours Act had been totally deleted from the statute book.<p> <p>There are now evident regional differences in transit over Christmas as the decisions depend on municipal authorities in charge of transportation. In Helsinki, services are running like an ordinary weekend, except a five-hour-pause on the morning of Christmas Day. In the second largest town Tampere, buses run until 8 pm and offer a full-day-service time on Christmas Day. But the city of Jyvaskyla in central Finland still chooses to halt transit at 1 pm and only to resume on the morning of Boxing Day.<p> <p>A Finnish language daily Helsingin Sanomat noted in its editorial that now in Finland tranquility at Christmas is \"based on the personal choice of the people, and no longer on the limits defined by legislation.\"<p> <p>\"Finns have learned as well that it is not a compulsory requirement to go to a shop, even if it is open, but there is no sense denying others the right to go to a shop.\"<p> <p>The liberalization of shop opening hours has not affected the labor laws and union tariffs. This means people working at Christmas get hefty extras, at least double salaries. But city taxicabs will lose their best revenue evening of the year as they used to be the only mode of transportation working.<p> <p>Tourists arriving in Finland at Christmas time used to be amazed to see cities almost closed down. The tourist industry was able to get exemptions from the regulations, but they were strictly restricted to certain streets and locations. Gas station mini-markets were allowed to stay open and attracted customers who had run out of any necessities, such as milk, from other areas.<p> <p>Needless to say, the tradition of Boxing Day sales never came to Finland as shopping on Boxing Day was inadmissible until 2017.<p> <p>During earlier decades, news organizations also closed down at Christmas. Until the early 1990s, there were no radio newscasts from early Christmas Eve until Christmas Day morning. In the last newscast on Christmas Eve afternoon, usually the minister of the interior addressed the nation and thanked those \"who had to work\" such as people in hospitals, rescue services and the police.<p> <p>The media situation changed after Christmas 1989 when the then prime minister Harri Holkeri complained he had been obliged to listen to foreign radios to get coverage of the ongoing violent changes in eastern Europe.<p>", "time": "24 Dec 2018, 22:24", "type": "culture"}
{"title": "Christmas Eve today sets mood for Christmas tomorrow", "url": "http://www.dailyfinland.fi/culture/8529/Christmas-Eve-today-sets-mood-for-Christmas-tomorrow", "review": "", "content": "<p>All-out preparations have been made in the country to celebrate Christmas Eve today and Christmas on Tuesday in a festive mood.<p> <p>All government, semi-government and private offices and most of the business centres will remain closed on the occasion.<p> <p>On Christmas Eve some shops may remain open until noon.<p> <p>The alcohol shop Alko will be closed on Christmas Eve, Christmas Day and Boxing Day., Main postal offices will also remain closed on Christmas Eve, Christmas Day and Boxing Day with the exception of the Helsinki main postal office which will remain open until noon on Christmas Eve.<p> <p>It is, however, important to note that the majority of postal offices, shops and other businesses operate according to their own timetable during the festive season. The opening hours of postal offices can be found on the Posti website.<p> <p>The railway traffic will also slow down during the festive season.<p> <p>VR Group commuter and long-distance trains will run sparingly on Christmas Eve and Christmas Day. On Christmas Eve, trains will come to a complete standstill by 6.00 pm. On Christmas Day, the trains will be on move again as from 10.00 am.<p> <p>Both commuter and long-distance trains will run mainly by the Sunday timetable on Boxing Day and on Epiphany.<p> <p>Also the bus services will not be running some shifts during the Christmas holidays. The exact schedules can be checked at the websites of the VR Group and bus services.<p>", "time": "24 Dec 2018, 01:27", "type": "culture"}
{"title": "Santa’s elves on the go ahead of Christmas", "url": "http://www.dailyfinland.fi/culture/8505/Santas-elves-on-the-go-ahead-of-Christmas", "review": "", "content": "<p>Rovaniemi is the home of Santa Claus – nature’s northernmost resort where green leaves turn white under the spell of snow during winter and people from across the world throng the Santa Clause Village to have a feel of the magic of his home.<p> <p>It is that time of the year again when all roads lead to Santa’s home. A few days ahead of Christmas and Santa’s departure on the annual world tour to distribute gifts and greet people, everyone at the Santa Clause Village are fully engaged; even the reindeers and flakes of snow could not hide their excitement.<p> <p>The home of Santa is full to its brim with gifts of different sizes. All the elves at the Arctic Circle are busy in various activities to make people’s visits memorable. Apart from catching some glimpses of the Santa’s home magic and exploring the souvenir shops, children and adults alike are involved in all sorts of activities in the village.<p> <p>One of the elves named Vanilla said Santa’s village is where people come to meet Santa and she was helping Santa ensure that all the Christmas preparations are done on time. She said at the moment everyone is extremely busy with visitors and they receive thousands of letters every day.<p> <p>The happy elves, despite having busy schedules of assisting Santa, do have time for relaxation. After a busy day, Vanilla likes to taste Christmas delicacies – snacks and chocolate – and end it all with a nap.<p> <p>Riitta the Elf, however, reports that after a busy day she usually relax by running in the forest and does the same while going back home. She said in winter she also loves to swim in the cold river. It renews her energy to keep up with the pace of work at Santa’s office.<p> <p>According to Riitta, who works in the post office, Santa usually gets up to 5,000 visitors and 30,000 letters a day during the Christmas season. He receives about 500,000 letters a year but most of them come before the Christmas day. Riitta helps Santa’s visitors with information about postcards and other postal services.<p> <p>According to the two elves, at Santa’s village the Christmas season continues beyond December up to spring. This extension of the Christmas season is the result of the Russian Christmas which usually comes up between January 1 and January 8 and the Chinese New Year which falls between February and March bringing flurries of activities to Santa’s home.<p> <p>The elves usually try to speak many foreign languages. The list of languages includes English, Estonian, Finnish, Italian, Chinese, Japanese, German, and Swedish. Their language skills help them communicate with the visitors and make their visits to Santa’s village memorable.<p> <p>The Santa’s elves love their work and are always excited by Christmas music and meeting people from all over the world, most especially by the feelings kids have when they see Santa for the first time. Their activities do not come to an end after the Christmas season, because they then start preparations for the next Christmas.<p>", "time": "22 Dec 2018, 20:15", "type": "culture"}
{"title": "British newspaper focuses raise of Rovaniemi from dark", "url": "http://www.dailyfinland.fi/culture/8458/British-newspaper-focuses-raise-of-Rovaniemi-from-dark", "review": "", "content": "<p>British newspaper the Guardian on Wednesday published a news focusing how Rovaniemi was razed to the ground by the German army in the second world war. It also pointed out the role of noted architect Alvar Aalto to rebuild it to a reindeer-shaped street grid.<p> <p>“As soon as you land at Rovaniemi airport in Lapland you see a reindeer. Not a real one, admittedly, but somebody in a Rudolf suit cheerily greeting passengers who have just arrived. A couple of miles from “Santa’s official airport” lies Santa Claus Village, an amusement park complete with elves, real reindeers, huskies, shops and restaurants that draws more than 600,000 visitors a year to this isolated spot at the edge of the Arctic Circle,” said the Guardian report.<p> <p>The report said that there are reindeer everywhere in Rovaniemi: humans dressed as them at the airport, real ones pulling sleighs at Santa Claus Village and statues of them throughout the city centre.<p> <p>“But the biggest is one few tourists notice: the reindeer head embedded in the Finnish city’s street plan. This was the work of Finland’s greatest architect, Alvar Aalto, when he rebuilt the Lapland’s capital after it was burned to the ground by the retreating German army during the second world war,” said the report.<p> <p><a href=\"http://www.theguardian.com/cities/2018/dec/19/the-dark-history-of-santas-city-how-rovaniemi-rose-from-the-ashes-alvar-aalto?CMP=share_btn_fb&amp;fbclid=IwAR3jRN31tz_P5waRD3ENhUBiGQUaJ4zbBPFPjhoVaaQpgkjLjDnVlcW9TA4\" target=\"_blank\">Click Guardian</a> to read the detail original report.<p>", "time": "20 Dec 2018, 01:04", "type": "culture"}
{"title": "Academy releases 91st Oscars shortlists", "url": "http://www.dailyfinland.fi/culture/8446/Academy-releases-91st-Oscars-shortlists", "review": "", "content": "<p>The Academy of Motion Picture Arts and Sciences on Monday announced shortlists in consideration for the 91st Academy Awards in nine categories, including foreign language films, documentaries, music, visual effects and shorts.<p> <p> It is the first time for the organization to release those shortlists in consideration for Academy Awards, also known as the Oscars, on the same day.<p> <p> Nine films will advance to the next round of voting in the Foreign Language Film category. A total of 87 films, including three Chinese-language films, had originally been considered in the category. <p> <p> According to the Academy, Los Angeles-based Academy members from all branches screened the original submissions in the category between mid-October and Dec. 10. The group's top six choices, augmented by three additional selections voted by the Academy's Foreign Language Film Award Executive Committee, constitute the shortlist.<p> <p> Failing to qualify for the next round were the action comedy film \"Hidden Man,\" which was selected as the Chinese entry of the mainland; the military action film \"Operation Red Sea,\" which was submitted in the category by Hong Kong, China; and the dark comedy film \"Great Buddha+,\" which was selected as the entry of Taiwan, China.<p> <p> The Foreign Language Film race was narrowed down to nine films, including Colombia's \"Birds of Passage,\" Denmark's \"The Guilty,\" Germany's \"Never Look Away,\" Japan's \"Shoplifters,\" Kazakhstan's \"Ayka,\" Lebanon's \"Capernaum,\" Mexico's \"Roma,\" Poland's \"Cold War\" and South Korea's \"Burning.\"<p> <p> Front-runners in the Foreign Language Film category include Alfonso Cuaron's critically lauded \"Roma,\" which won the top prize at the Venice Film Festival; Japan's \"Shoplifters,\" which won the Palme d'Or at the Cannes Film Festival; and Poland's \"Cold War,\" which won the Best Director prize at Cannes.<p> <p> Academy members eligible to participate in the nominations round of voting will view the shortlisted films. Members must see all nine films before casting their ballots.<p> <p> Fifteen films will advance in the Documentary Feature category from a total of 166 films that were originally submitted. \"Three Identical Strangers,\" \"Won't You Be My Neighbor?\" and \"RBG\" are among the highly acclaimed films in this category.<p> <p> Out of 104 films originally submitted in the Documentary Short Subject category, 10 will advance to the next round of voting. Seven films will advance in the Makeup and Hairstyling category. Fifteen scores will advance in the Original Score category and 15 songs will advance in the Original Song category. Ten films will advance in the Animated Short Film category, the Live Action Short Film category and the Visual Effects category respectively.<p> <p> Nominations for the 91st Academy Awards will be announced on Jan. 22, 2019. The awards ceremony is set for Feb. 24, 2019, at the Dolby Theater in Hollywood in the western U.S. state of California.<p>", "time": "18 Dec 2018, 23:22", "type": "culture"}
{"title": "Christmas \"milk tree\" in Athens sends message of solidarity", "url": "http://www.dailyfinland.fi/culture/8376/Christmas-", "review": "", "content": "<p>A unique Christmas tree, made up entirely of milk cans, was set up on Friday for the ninth consecutive year by the NGO \"Doctors of the World\" in the center of Athens.<p> <p> Children and adults visited the Christmas tent of the local NGO outside the University of Athens central building, bought ornaments and participated in various activities, contributing to the collection of milk, canned food and medicine for their fellow citizens in need.<p> <p> \"The idea started nine years ago from a little girl who was in our office and waited to be examined. When I asked her what special present she was expecting from Santa Claus she replied a glass of milk. So we decided to make a Christmas tree of milk and this story has evolved into one of the most tender Christmas customs of the city. This year we are doing the same thing,\" Nikitas Kanakis, the NGO's president, told Greek national news agency AMNA.<p> <p> The mini Christmas festival, which takes place every year in the second week of December, includes various artistic activities, such as painting workshops for children as well as face painting.<p> <p> \"We ask people to bring milk; we set up the tree together, and at the same time it is a great celebration, a party. It is also an opportunity to get to know each other and, most importantly, to remind and remember that solidarity is a beautiful thing and that children should be our priority. It is a Christmas celebration of the Doctors of the World on the road,\" Kanakis explained. <p> <p> In its first year, the \"milk tree\" was adorned with 5,000 cans of milk.<p> <p> Later on, as more and more people learned about the initiative, the organization collected on average more than 55,000 cans and more than four tons of other food products. This year, the organizers hope to break the record.<p> <p> The Greek branch of Doctors of the World was founded in 1990. A medical humanitarian non-governmental organization, the branch is a member of Medecins Du Monde International.<p>", "time": "14 Dec 2018, 23:34", "type": "culture"}
{"title": "Rovaniemi eateries plan Christmas delicacies", "url": "http://www.dailyfinland.fi/culture/8322/Rovaniemi-eateries-plan-Christmas-delicacies", "review": "", "content": "<p>The month of Christmas is already here. As is traditional with Finnish eateries, restaurants in Rovaniemi are planning special delicacies to serve their customers in the weeks ahead and after the Christmas Day.<p> <p>Authority of the Scandic Pohjanhovi, said they have prepared Christmas meals for the clients for the busy Christmas season.<p> <p>“We offer a versatile buffet with traditional Finnish Christmas foods and treats,” Johanna Uimonen, Communications Manager of Scandic Hotels told Daily Finland.<p> <p>The restaurant offers Christmas lunch buffet on weekdays (from Monday to Friday) already started from December 10 to December 20. The buffet will be available from 11.30 am to 2:00 pm.<p> <p>“Traditional food is essential part of the Finnish Christmas celebration. These just cannot be left out. Each year our chefs will find new delicacies or flavours to the Christmas table,” said Uimonen replying to a query about the reason behind to choose these foods to the Christmas food menu.<p> <p>“The all-time Christmas time favorite is the Finnish fish buffet with salmon, herrings, lavaret and roes with sour cream and onion. Other favorites are Christmas ham and the casseroles of potato, carrot and swede” Uimonen added.<br/> The restaurant will also arrange Christmas dinner on December 24.<p> <p>On Christmas Eve all the hotel guests join to the Christmas dinner. During the Christmas time Scandic Pohjanhovi has guests from all over the world. Most of them enjoy the Christmas dinner and especially the fish buffet is one of the favorites, she said.<p> <p>Hotel Santa Claus and Sokos hotel Vaakuna Rovaniemi will have special arrangements made, too, for Christmas lunch and dinner.<p> <p>Nili restaurant is one of the legendary restaurants in Rovaniemi devoted to serving Lappish delicacies using purely local ingredients during the Christmas.<p> <p> <p>", "time": "11 Dec 2018, 21:27", "type": "culture"}
{"title": "Mukwege, Murad receive 2018 Nobel Peace Prize", "url": "http://www.dailyfinland.fi/culture/8308/Mukwege-Murad-receive-2018-Nobel-Peace-Prize", "review": "", "content": "<p>Congolese gynecologist Denis Mukwege and Iraq's Yazidi human rights activist Nadia Murad received the 2018 Nobel Peace Prize on Monday at the award ceremony here in Norway, for \"their efforts to end the use of sexual violence as a weapon of war and armed conflict.\"<p> <p> At the ceremony held at the Oslo City Hall, Mukwege, 63, and Murad, 25, received medals and diplomas of the award.<p> <p> The two laureates \"have made significant contributions to combating this type of war crime by focusing attention on the suffering inflicted on women in Iraq, the Democratic Republic of the Congo and everywhere else in the world where sexual violence is used as a weapon,\" said Berit Reiss-Andersen, chair of the Norwegian Nobel Committee.<p> <p> \"The war waged on women through the use of sexual violence has been a hidden war,\" she said, adding \"When the time has come for peace negotiations and transitional justice, these crimes have rarely been on the agenda.\"<p> <p> In their Nobel lectures, both Murad and Mukwege narrated their experiences in their war-torn countries and urged the international community to help the victims of sexual violence in wars and armed conflicts.<p> <p> Mukwege has spent large parts of his adult life helping the victims of sexual violence in the Democratic Republic of Congo as most of the abuses have been committed in the context of a long-lasting civil war, according to the Norwegian Nobel Committee.<p> <p> Murad, a survivor of sexual slavery by the Islamic State in Iraq, \"has shown uncommon courage in recounting her own sufferings and speaking up on behalf of other victims,\" the committee said.<p>", "time": "10 Dec 2018, 22:19", "type": "culture"}
