{"title": "HU receives 3899  Int`l masters applications this year", "url": "http://www.dailyfinland.fi/education/8773/HU-receives-3899--Int`l-masters-applications-this-year", "review": "", "content": "<p>The University of Helsinki received 3,899 applications for its international master’s programmes this year, said a press release issued by the University.<p> <p>The application round ended on Friday. The number of applications this year is 33% higher than the previous year.<p> <p>Decisions on admissions will be made at the turn of March and April. The session will begin in autumn 2019.<p> <p>The most popular programme was the Master’s Programme in Environmental Change and Global Sustainability.<p> <p>The number of applicants has been significantly growing for two consecutive years, after the number went down in the first year following introducing tuition fees for the students from outside the EU and EEA countries.<p> <p>The tuition fees for applicants from outside the EU and EEA countries, introduced in 2017.<p> <p>The percentage of non-EU and non-EEA applicants was 63% (58% in 2018). Before the adoption of tuition fees, approximately three quarters of all applications came from outside the EU and EEA. Finnish applicants accounted for 24% (28% in 2018).<p> <p>Applications were received from 130 countries. After Finland, the most applications were submitted from Nigeria, Ghana and India.<p> <p>The largest number of applications, 317, was submitted to the Master’s Programme in Environmental Change and Global Sustainability. In second place with 278 applications was the Master’s Programme in Data Science. The third place went to the Master’s Programme in Global Politics and Communication, which received 269 applications.<p> <p>During the same round, applications were also accepted for the Bachelor’s Programme in Science, the first international bachelor’s programme at the University of Helsinki. Additional applications for this programme will be received at a later date, as part of the applicants are applying through the joint application procedure.<p> <p> <p>", "time": "13 Jan 2019, 03:26", "type": "education"}
{"title": "Jukka Kola selected Turku University Rector", "url": "http://www.dailyfinland.fi/education/8772/Jukka-Kola-selected-Turku-University-Rector", "review": "", "content": "<p>The Board of the University of Turku on Friday selected Professor Jukka Kola as the Rector for the five-year term starting on 1 August 2019, said a press release.<p> <p>A total of 15 academics applied for the position of the Rector of the University of Turku. Eight of them were invited for an interview and four applicants continued to further interviews in the recruitment process.<p> <p>The University Board organised an open interview and discussion event with the top applicants in December.<p> <p>Furthermore, a recruitment consultant conducted aptitude assessments on the top candidates.<p> <p>In the selection process, the University Board emphasised especially extensive knowledge of the academia as well as insight into research and education policy, proven experience in leadership, networks, and strong academic background.<p> <p>The University Board decided unanimously to select Doctor of Science in agriculture and forestry, Professor Jukka Kola as the new Rector.<p> <p>Kola has versatile and extensive experience in leadership. Among other things, he has served as the Rector of the University of Helsinki. In addition, he has extensive international networks and profound knowledge of the university field, different collaboration sectors, and funding channels.<p> <p>“The Board was convinced by Professor Kola’s strong expertise in university operations. Furthermore, the decision was influenced by his vision for the role of the University of Turku as an even stronger multidisciplinary and international research university,” said Chair of the University Board Ritva Viljanen.<p> <p>Kola is now a professor at the University of Helsinki. He has previously held the posts of Rector 2013–2018, Vice Rector 2010–2013, and Dean 2007–2009 and 2004–2006 at the University of Helsinki.<p> <p>He has been a professor since 1999.<p> <p>The term of the current Rector Kalervo Väänänen ends on 31 July 2019.<p>", "time": "13 Jan 2019, 01:51", "type": "education"}
{"title": "Music playschool enhances children’s linguistic skills", "url": "http://www.dailyfinland.fi/education/8749/Music-playschool-enhances-childrens-linguistic-skills", "review": "", "content": "<p>Weekly music playschool significantly improved the development of children’s vocabulary skills, according to the research conducted at the University of Helsinki.<p> <p>Several studies have suggested that intensive musical training enhances children's linguistic skills, said a press release issued by the University.<p> <p>It also said that such training, however, is not available to all children.<p> <p>Researchers at Cognitive Brain Research Unit in the University of Helsinki studied in a community setting whether a low-cost, weekly music playschool provided to 5–6-year-old children in kindergartens affects their linguistic abilities.<p> <p>The children (N=66) were tested four times over two school-years with phoneme processing and vocabulary subtests, along with tests for perceptual reasoning skills and inhibitory control.<p> <p>According to the results, published in Scientific Reports, music playschool significantly improved the development of children’s phoneme processing and vocabulary skills, compared to their peers either attending to similarly organized dance lessons or not attending to either activity.<p> <p>\"Our data suggest that even playful group music activities – if attended to for several years – have a positive effect on preschoolers’ linguistic skills,\" said the first author of the research, Tanja Linnavalli. <p> <p>\"Therefore we promote the concept of implementing regular music playschool lessons given by professional teachers in early childhood education.\"<p> <p>Tanja Linnavalli will defend the doctoral dissertation entitled Effects of musical experience on children's language and brain development in the Faculty of Arts, University of Helsinki, on January 17.<p>", "time": "11 Jan 2019, 03:56", "type": "education"}
{"title": "Secular rights, Christian traditions clash in schools", "url": "http://www.dailyfinland.fi/education/8475/Secular-rights-Christian-traditions-clash-in-schools", "review": "", "content": "<p>Finnish parents are increasingly demanding that the festive season events in schools should not include religious speeches or songs.<p> <p>The issue got national attention on Wednesday as Olli-Pekka Heinonen, director general of the National Board of Education, deplored a statement by a senior official of the Board who said \"some parents are allergic to religion.\"<p> <p>Christian religion is taught in Finnish schools as a subject, separately for Lutherans and Greek Orthodox believers, but children of non-members can choose \"studies of life values\" instead. School Christmas celebrations, however, are for everyone.<p> <p>In its latest update of regulations, the National Board of Education defined last January that school festivities \"can include elements referring to religion...These traditions are part of the Finnish culture. The singing of one hymn or psalm does not make the event religious.\" The ruling is based on the views of parliamentary constitutional committee expressed in 2014.<p> <p>An association named \"People without Religion in Finland\" maintains \"a tattler website\" helping parents to file their complaints about religious intrusion in schools. Kaisa Robinson, chairman of the association, told national broadcaster Yle that often the issue is \"not one hymn\", but the whole event is religiously slanted.<p> <p>Over the years, membership in the Lutheran Church has been declining in the country. While over 90 percent of the national population were its members in the late 1980s, the figure dropped to 70 percent in December this year, the Church Research Center said this week.<p> <p>The church was disconnected from the state in 1994, but the Finnish taxation service continues collecting church taxes as part of the general taxation process.<p> <p>The old tie between the state and the church is also reflected in the Declaration of Christmas Peace which is broadcast nationally from the Old Turku Town Hall on Christmas Eve.<p> <p>The text dates back to the reign of Queen Christina of Sweden in the early 17th century, but it is accompanied by a Finnish military band playing the Finnish national anthem, a well-known military march and the hymn \"A mighty fortress is our God\" from the 16th century.<p> <p>Christian themes have largely disappeared from commercially printed Christmas cards. Sanna Lukkari, a product manager at a leading book store chain, told national broadcaster Yle this week that \"Christmas in the forest\" is increasingly featured on Christmas cards. The cards picture foxes, bears, elks and rabbits celebrating Christmas around a tree, eating and giving gifts. Even Santa Claus has been giving way to elves as they are easier to adapt into the forest scenes.<p> <p>Nonetheless, classical and often religious Christmas music is filling concert halls and churches all through December.<p>", "time": "21 Dec 2018, 02:00", "type": "education"}
{"title": "Researchers devise green method of gold extraction from scrap", "url": "http://www.dailyfinland.fi/education/8467/Researchers-devise-green-method-of-gold-extraction-from-scrap", "review": "", "content": "<p>With the help of a new solvent method, gold can be extracted from recycled materials in a more eco-friendly way, reports a research.<p> <p>The recovery of minerals from recycled materials, or so-called ‘urban mining’, is an expanding industrial branch. The amount of gold in scrapped electronics, for example, may be up to 10-100 times that of ore, said a press release issued by the University of Helsinki quoting an article published in the scientific journal Angewandte Chemie .<p> <p>“Small amounts of gold are often used in the electronics industry, and recovering it is important from the viewpoint of recycling,” said Professor Timo Repo of the Department of Chemistry at the University of Helsinki who has developed the new method.<p> <p>Now, researchers have succeeded in using an organic solvent to extract gold, using sulphuric acid as an auxiliary and hydrogen peroxide as an oxidant. So far, the method has only been tested in lab conditions.<p> <p>“Once the basic phenomenon has been observed, it opens up possibilities for a wider set of applications,” said Eeva Heliövaara, a doctoral student at the University of Helsinki and a co-author of the article.<p> <p>There are small amounts of gold in computers, phones, and many other devices, which end up being burned along with the scrapped devices.<p> <p>The gold is separated chemically from the ashes, but the chemicals being used currently are very damaging to the environment. In developing countries, the gold is recovered with the help of quicksilver in inhumane conditions in sweatshops. Another environmentally risky method is dissolving the scrap materials with the help of cyanide.<p>", "time": "20 Dec 2018, 03:54", "type": "education"}
{"title": "72% newly matriculated students pause study", "url": "http://www.dailyfinland.fi/education/8413/72-newly-matriculated-students-pause-study", "review": "", "content": "<p>About 72 per cent of the students who passed the matriculation examination in 2017 did not continue studies leading to a qualification or degree in the same year, according to the Statistics Finland.<p> <p>In 10 years till 2017, the share of those left outside further studies among newly matriculated students had grown by 15 percentage points.<p> <p>Seventy-five per cent of the matriculated students applied for further studies. Of comprehensive school graduates, 53 per cent immediately continued in upper secondary general education and 41 per cent in vocational education.<p> <p>Nearly 16 per cent of newly matriculated students in 2017 immediately continued in university education, nine per cent in university of applied sciences education and three per cent in vocational education. Seventy-five per cent of the newly matriculated female students and 68 per cent of the male students remained outside education.<p> <p>Matriculated male students continued more often than women in university and university of applied sciences education as 31 per cent of the men and 21 per cent of the women started tertiary level studies. Two per cent of men and four per cent of women started vocational education in the year of passing the matriculation examination.<p> <p>Three out of four newly matriculated students applied for further education in the year of passing the examination. Seventy-three per cent of newly matriculated students in 2017 applied for tertiary education comprising 75 per cent of the women and 72 per cent of the men. Forty-two per cent of the newly matriculated students applied only for university education, 17 per cent applied only for university of applied sciences education, and 14 per cent applied simultaneously for university of applied sciences and university education. In all, 1.5 per cent of newly matriculated students applied for upper secondary vocational education.<p> <p>Many of the matriculated students have a gap year or years before further studies<p> <p>Immediate continuation of studies among newly matriculated students has become more difficult than in the year before. Many newly matriculated students have to have a gap year or years before finding a place for further studies, even though most apply for further studies right after passing the matriculation examination.<p>", "time": "17 Dec 2018, 04:32", "type": "education"}
{"title": "93% of Finnish residents bilingual", "url": "http://www.dailyfinland.fi/education/8349/93-of-Finnish-residents-bilingual", "review": "", "content": "<p>At least one foreign language is spoken by 93 per cent of the population aged 18 to 64, according to the Statistics Finland.<p> <p>The number is the same as was five years previously. The dependence between the level of education and knowledge of foreign languages has decreased and language skills have increased from 1995 most among those with merely basic level of qualifications, the share having grown by 37 percentage points by 2017.<p> <p>Those with longer basic education knew foreign languages more often than those with shorter basic education. When nearly all of those with tertiary-level academic degrees knew at least one foreign language, this was so for 91 per cent of those with upper secondary level educational qualifications and for 87 per cent of those with basic-level qualifications.<p> <p>The dependence between the level of education and knowledge of foreign languages has decreased considerably over 22 years. During that time, those with only basic-level qualifications have improved their language skills the most, by 37 percentage points. The language skills of those with upper secondary-level educational qualifications also increased steadily from 1995 to 2012, by nearly 20 percentage points. In 2017, the difference between the language skills of those with basic-level qualifications and tertiary-level qualifications was only 10 percentage points.<p> <p>Knowledge of languages grew from 1995 until 2012, when 93 per cent of the population aged 18 to 64 said they knew some foreign language at least a little. In 1995 and 2000, ten percentage points fewer men than women said they knew foreign languages. The difference had halved by 2017. In 2017, there were as many foreign language speakers as five years ago – 93 per cent of the population aged 18 to 64.<p> <p>Nearly all persons aged below 45 knew at least one foreign language (96 to 97 per cent). Among older people, 92 per cent of those aged 45 to 54 and 83 per cent of those aged 55 to 64 knew at least one foreign language.<p> <p>The most spoken foreign languages were English, Swedish, and German. Nine out of 10 persons aged 18 to 64 said they knew English, seven out of 10 Swedish and three out of 10 German.<p>", "time": "13 Dec 2018, 03:34", "type": "education"}
{"title": "Helsinki Varsity to establish AI research centre in HK", "url": "http://www.dailyfinland.fi/education/8175/Helsinki-Varsity-to-establish-AI-research-centre-in-HK", "review": "", "content": "<p>The University of Helsinki is planning to open the Hong Kong–Helsinki Oasis for Innovation and Technology (H2O), focusing on Artificial Intelligence (AI) for smart and sustainable cities in Hong Kong together with local and international partners, said a press release .<p> <p>Vice-Rector Hanna Snellman has kicked off the H2O initiative at the Finland–Hong Kong Smart Mobility &amp; Communication Day in Hong Kong. H2O will pave the way for unprecedented opportunities in innovation and cultural exposure across the two regions for professionals and students alike.<p> <p>Chancellor Kaarle Hämeri from the University of Helsinki said the H2O centre is a great opportunity for the university to address global challenges such as urbanisation, climate change and sustainable development.<p> <p>“All of these challenges can be addressed with the help of digitalisation and AI. This work needs wide networks and partnership actions, which we will develop in global research and innovation platforms. The H2O initiative is clearly our spearhead in advancing our global impact,\" said Hämeri.<p> <p>H2O will enter the bidding for the Hong Kong Innovation and Technology Commission’s AIR@InnoHK cluster, which is to fund 10 AI/Robotics research centres connected to top universities from all over the world.<p>", "time": "01 Dec 2018, 02:22", "type": "education"}
{"title": "Next govt must develop expertise: Niemelä", "url": "http://www.dailyfinland.fi/education/8159/Next-govt-must-develop-expertise-Niemelä", "review": "", "content": "<p>University of Helsinki Rector Jari Niemelä on Thursday said the next government must focus on increasing expertise.<p> <p>He made the remarks on occasion of launching #siksitiede, a campaign promoting science by the University of Helsinki, said a press release.<p> <p>The campaign describes to politicians in particular and Finns in general what research and research-based teaching are needed for, in addition to highlighting the general duty of universities to promote education and learning.<p> <p>“Finland has no other option but to found its future on top-level expertise, which makes the task at hand considerable: whereas the current figure is 41 per cent, no less than half of young adults must in the future complete a higher education degree. Institutions of higher education must also be more widely accessible to all in order to increase expertise among the entire population and the amount of high-quality digital teaching. Achieving these goals requires resources, making it necessary to increase investments in education and research,” said Niemelä.<p> <p>The University of Helsinki has published its vision for the science and higher education policy needed for the next government term of 2019–2023 for universities to be able to continue engendering education and wellbeing.<p> <p>There is plenty of work to do, since improvement of the level of education among young age groups has stalled. Internationally speaking, such a phenomenon is exceptional.<p> <p>“To begin with, scientific knowledge directly generates innovations, as well as products and services with marketing potential, while society also benefits from new information on a more general level, for example, when developing the comprehensive school system or protecting the Baltic Sea. Without science our society stagnates,” said Niemelä.<p>", "time": "30 Nov 2018, 03:02", "type": "education"}
{"title": "Aalto-Helsinki team gets iGEM gold medal", "url": "http://www.dailyfinland.fi/education/8037/Aalto-Helsinki-team-gets-iGEM-gold-medal", "review": "", "content": "<p>The Aalto-Helsinki team brought home gold medal from this year’s iGEM Giant Jamboree received for developing a potential solution to water pollution by textile dyeing, said the University of Helsinki in a press release.<p> <p>iGEM (International Genetically Engineered Machine) is an annual synthetic biology competition organised by the non-profit iGEM Foundation.<p> <p>Over 300 teams and almost 6,000 students from universities across the globe participate in the competition every year with innovations and solutions to tackle a wide range of issues from diseases to environmental pollution using the tools of synthetic biology.<p> <p>The teams also help standardise the field by contributing biological parts BioBricks and conducting measurements. During the fall, all the iGEM teams gather in Boston in a Giant Jamboree to share their ideas and accomplishments with others and the world.<p> <p>In October, the Aalto-Helsinki team made of 10 students in the fields of biosciences, design, sustainability, business and physics in the Aalto and Helsinki universities brought home the gold medal from the Giant Jamboree 2018. The Finnish team also received a nomination for the Best Product Design in the special track award category.<p> <p>The Aalto-Helsinki team had been working from this spring to fall to develop a potential solution to an international environmental problem: Textile dyeing polluting water systems. In many countries with large-scale textile industry, such as India and Bangladesh, part of the synthetic dyes used in the plants end up in nearby rivers and lakes. Many of these synthetic dyes are both hazardous to health and slow to biodegrade.<p> <p>The solution invented by the Aalto-Helsinki team is christened Silkolor, a sustainable approach to the dyeing industry using fusion proteins. As such, Silkolor is an attempt to revolutionise the textile dyeing process by producing pre-dyed silk fibres and biodegradable protein-based dyes, which could be used in the future as a more environment-friendly alternative to current dyeing practices.<p> <p>This is for the fifth time that the Aalto-Helsinki team has participated in the iGEM Competition, every year with a new team. They still represent the only team from Finland. Currently, Aalto-Helsinki is recruiting students from their home universities to form the next year’s team.<p>", "time": "22 Nov 2018, 03:16", "type": "education"}
{"title": "560,500 kids in comprehensive schools in 2018", "url": "http://www.dailyfinland.fi/education/7988/560500-kids-in-comprehensive-schools-in-2018", "review": "", "content": "<p>Comprehensive schools have 560,500 pupils in 2018, according to the Statistics Finland.<p> <p>The number of students in comprehensive schools has increased by 0.7 per cent from that in the year before.<p> <p>Forty-nine per cent of the pupils in comprehensive schools were girls and 51 per cent were boys.<p> <p>In all, 11.0 per cent of the comprehensive school students have received intensified support in autumn 2018 and 8.0 per cent special support. More details about this topic in the statistics on special education are to be released in June 2019.<p> <p>The number of pre-primary education students was 61,500 of whom 10,000 were in pre-primary education in schools and 51,500 in day-care centres.<p> <p>There were 2,341 active comprehensive schools in autumn 2018, showing a decrease of 43 schools than in the year before. Municipalities run 95 per cent of the comprehensive schools.<p>", "time": "18 Nov 2018, 03:33", "type": "education"}
{"title": "Finns least skilled in English in Norden", "url": "http://www.dailyfinland.fi/education/7809/Finns-least-skilled-in-English-in-Norden", "review": "", "content": "<p>Finland ranked eighth in the world in English skill, which is the lowest in the Nordic countries, according to the EF English Proficiency Index 2018.<p> <p>Another Nordic country, Sweden, ranked top on the list with 70.72 points, followed by the Netherlands (70.31), Norway (68.38), Denmark (67.34), Luxembourg (66.33), Finland (65.86), Slovenia (64.84), and Germany (63.74).<p> <p>Libya ranked at the bottom of the list of 88 countries across the world, followed by Iraq, Uzbekistan, Cambodia, Afghanistan, Saudi Arabia, Myanmar, Algeria, Kazakhstan, and Oman. <p> <p>Finland secured the worst rank this year in the EF English Proficiency Index. Finland secured fourth position in 2012 and 2014. The ranking has been published every year since 2011.<p> <p>The index has been prepared on 1.3 million adults’ English proficiency and English is not native language in the 88 countries surveyed.<p>", "time": "07 Nov 2018, 02:22", "type": "education"}
