{"title": "54% social, health care workers face violence at work", "url": "http://www.dailyfinland.fi/health/8790/54-social-health-care-workers-face-violence-at-work", "review": "", "content": "<p>About 54 percent workers of social and health care services experienced violence or the threat of violence at work place, reported National broadcaster Yle quoting a survey conducted by the National Institute for Health and Welfare (THL).<p> <p>The survey conducted interviews with 24,000 workers in northern and eastern Karelia, southern Savo, Päijät-Häme, northern Ostrobothnia and Kainuu.<p> <p>Meanwhile 80 percent of employees working with the elderly and 70 percent of the workers of emergency service had directly experienced violence or been threatened.<p> <p>About 15 percent of the respondents experienced sexual harassment by their clients.<p> <p>Narcotics are involved in a majority of violent encounters but sometimes patients become belligerent as a result of a somatic illness, said the Yle report, adding that in such cases a patient may be triggered by low blood sugar or the aftermath of an epileptic seizure. Even the shortage of oxygen supplied to the brain following a heart attack could explain violent behaviour.<p>", "time": "14 Jan 2019, 04:06", "type": "health"}
{"title": "Smoking, drinking linked to different brain areas", "url": "http://www.dailyfinland.fi/health/8783/Smoking-drinking-linked-to-different-brain-areas", "review": "", "content": "<p>A recent international study found that different brain areas are associated with smoking and drinking which may shed light on the prevention and treatment of alcohol and nicotine abuse.<p> <p> Researchers from China's Fudan University, the University of Warwick in the U.K., and other research institutions analyzed brain functional magnetic resonance images from two brain scan databases from the United States and Europe.<p> <p> They reported on the latest issue of journal eLife that the medial orbitofrontal cortex, a brain area associated with rewards, has higher functional connectivity in drinkers. It suggests that drinkers are attracted to alcohol for the experience of pleasure caused by the reward system in the brain.<p> <p> Meanwhile, smokers had low functional brain connectivity in general, especially in the lateral orbitofrontal cortex, a brain region linked to impulsive behavior. It suggests that smokers need the stimulating effect of nicotine to increase their overall brain connectivity.<p> <p> The study also found that the changes in functional brain connectivity were detectable even when participants smoked only a few cigarettes or drank a small amount of alcohol every day.<p> <p> Feng Jianfeng, a corresponding author of the study and director of the Institute of Science and Technology for Brain-Inspired Intelligence, Fudan University, said the study could have important public health implications as both drinking and smoking affect a large part of the global population.<p> <p> According to the World Health Organization, over 1.1 billion people smoke tobacco in the world, and more than 7 million people die each year due to the use of tobacco. Around 2.3 billion people worldwide are current drinkers, and excessive drinking killed more than 3 million people in 2016.<p>", "time": "14 Jan 2019, 02:02", "type": "health"}
{"title": "Nat´l probe gives dismal picture of healthy eating", "url": "http://www.dailyfinland.fi/health/8721/Nat´l-probe-gives-dismal-picture-of-healthy-eating", "review": "", "content": "<p>The eating habits of Finland's adult men and women have become increasingly divergent, with women eating healthier, but both fall short of the health guidelines, a survey published on Wednesday showed.<p> <p>The survey was carried out by National Institute of Health and Wellbeing (THL) at five-year intervals.<p> <p>It indicated that adult Finns eat far too much red or processed meat, with 79 percent of men exceeding the recommended half-a-kilo red or processed meat per week, and 26 percent of women consuming the meat in excess.<p> <p>The official Finnish recommended diet includes at least half a kilo of vegetables, fruit or berries every day, but only 14 percent of men and 22 percent of women meet that requirement.<p> <p>Progress was confirmed in the consumption of fiber and vitamin D. Saccarose intake declined, the institute press release stated.<p> <p>Thirty-five percent of Finns eat too much fat, and 70 percent get too little carbohydrates and fiber.<p> <p>The supply of protein matches the norms. Most of it is animal protein from meat, fish or milk. Nine out of 10 Finnish adults get too much salt.<p> <p>The survey revealed extensive use of commercial food supplements. Over half of men and two thirds of women use them. Research director Liisa Valsta noted in the press release that such usage is mostly unnecessary, versatile selection of food is recommended instead.<p> <p>The survey applied EU criteria and was carried in 50 localities among people aged 18-74.<p>", "time": "10 Jan 2019, 01:40", "type": "health"}
{"title": "Childhood abuse increases risk of suicide in adulthood", "url": "http://www.dailyfinland.fi/health/8725/Childhood-abuse-increases-risk-of-suicide-in-adulthood", "review": "", "content": "<p>Adults who as children experienced physical, sexual, and emotional abuse or neglect are at least two to three times more likely to attempt suicide in later life, the largest research review ever carried out on the topic revealed Wednesday.<p> <p> Psychologists at the University of Manchester and University of South Wales published their findings after an analysis of 68 studies from around the world involving 262,000 adults aged 18 years or older, who were exposed to childhood abuse and neglect.<p> <p> They found that suicide attempts were three times more likely for people who experienced sexual abuse as a child, and two and a half times more likely for those who experienced physical abuse as a child, or who experienced emotional abuse or neglect as a child.<p> <p> Their research published in the latest edition of Psychological Medicine showed children who experienced multiple abuse are as much as five times higher to attempt suicide. People not in contact with mental health clinicians were found to be at the highest level of risk.<p> <p> Dr. Maria Panagioti, from the University of Manchester, also based at a patient safety translational research center in the city, led the research team.<p> <p> She said: \"Around one adult in every three has experienced abuse as a child. This study conclusively gives us solid evidence that childhood abuse and neglect is associated with increased likelihood that they will be at risk of suicide as adults.\"<p> <p> Panagioti said current treatment for people with suicidal behavior usually centers around cognitive behavioral therapy, adding: \"But that assumes people will seek help themselves. This research identifies that people who are not under the care of clinicians are at risk.\"<p> <p> She said a new approach is needed to identify these people, and to focus efforts on effective community intervention.<p> <p> Dr. Ioannis Angelakis from the University of South Wales said: \"These findings not only provided a clear picture of the connection between abuse or neglect in childhood and suicide attempts later on in life, but also recognised that efficient interventions should take a broader community-based approach.\"<p>", "time": "10 Jan 2019, 02:27", "type": "health"}
{"title": "New mouse model of Hirschs­prung’s disease developed", "url": "http://www.dailyfinland.fi/health/8699/New-mouse-model-of-Hirschs­prungs-disease-developed", "review": "", "content": "<p>Researchers at the University of Helsinki have developed a new mouse model of Hirschsprung’s disease and associated enterocolitis and shed light on the disease progression, said a press release issued by the University.<p> <p>About one in every 5,000 babies is born without enteric neurons in distal colon resulting in Hirschsprung’s disease. Because of the lacking neurons, contents of the gut cannot pass normally resulting in constipation and enlargement of colon.<p> <p>The condition is treated with a surgical removal of the affected gut part, but the patients remain at high risk of enterocolitis, or inflammation of the gut. This is the major life-threatening complication of Hirschsprung’s disease.<p> <p>About half of the Hirschsprung’s disease cases are caused by mutations in a gene called RET. RET is a receptor, a large protein molecule, which is located at the surface of the cell to receive signals from other cells.<p> <p>During development, a complex formed by two proteins called GDNF and GFRa1 binds to RET and activates signaling required for normal development of the enteric neurons.<p> <p>For developing new treatments, animal models of the disease are most often a prerequisite. This work lead by Associate Professor Jaan-Olle Andressoo described generation and characterization of the first viable mouse model of Hirschsprung’s disease and associated enterocolitis with a defect in GDNF/GFRa1/RET signaling thus representing most patients.<p> <p>This is important because so far animal studies of Hirschsprung’s disease have used model systems that represent a minority of the genetic mutations in Hirschsprung’s disease.<p> <p>Using the new mouse model scientists at the University of Helsinki were now able to shed further light on the chronology of events in enterocolitis. They found that mucin producing goblet cells, a specific type of cells responsible for lubricating the inner surface of the gut, may be a potential target for preventative treatment.<p> <p>Scientists also conclude that reduced expression of GFRa1 can contribute to susceptibility to Hirschsprung’s disease. The new mouse model will serve as a useful tool for enhancing understanding of the disease and for defining treatment in the future.<p> <p>The research work was started at the Institute of Biotechnology, HiLIFE, University of Helsinki, and performed in collaboration with the group of Professor Mart Saarma.<p>", "time": "08 Jan 2019, 02:57", "type": "health"}
{"title": "Researchers shed light on evolution of metabolism", "url": "http://www.dailyfinland.fi/health/8641/Researchers-shed-light-on-evolution-of-metabolism", "review": "", "content": "<p>Researchers at the University of Helsinki have found out that the ability to use sugar as food varies strongly between closely related species and identified the genetic basis of this variation.<p> <p>Diet choice of animal species is highly variable. Some are specialists feeding only on one food source, such as a sugar-rich fruit or protein-rich meat. Other species, like humans, are generalists that can feed on different kinds of food sources, said a press release.<p> <p>Because of these differences, animal species ingest different amounts of macronutrients, like carbohydrates and amino acids. It is conceivable that the metabolism has to match the diet choice of each species. However, we understand poorly the evolution of animal metabolism – what are the underlying genetic changes and how these changes define the optimal nutrient composition for a given species.<p> <p>The research group led by Associate Professor Ville Hietakangas at the University of Helsinki have studied the evolution of metabolism by using two very closely related fruit fly species. The first one of them is a generalist, Drosophila simulans, which feeds on varying fruits and vegetables, which typically contain a high amount of sugars. The second one is Drosophila sechellia, which has specialized to feed on one fruit, Noni, Morinda citrifolia, which has low sugar content.<p> <p>“We found pretty dramatic metabolic differences between these species. D. sechellia larvae, that are not exposed on sugar in nature, were not able to grow when placed on a sugar-rich diet, while D. simulans had no problems handling dietary sugar,” said Hietakangas.<p> <p>The close relatedness of the fruit fly species allowed the scientist interbreed the species, to make hybrids that were largely genetically like D. sechellia, but contained those genomic regions of D. simulans that were needed for sugar tolerance.<p> <p>“The ability to analyze hybrid animals was the key advantage of our study. This way we could not only rely on correlating the findings but were able to identify genetic changes that were causally important. We also could tell that sugar tolerance comes with a cost. D. simulans and the sugar tolerant hybrids survived poorly on a low nutrient diet. This suggests that D. sechellia has evolved to survive on a low nutrient environment, which has required rewiring the metabolism in a way that has made feeding on high sugar impossible,” said Hietakangas.<p> <p>This study opens up many interesting questions, also related to humans. In the future, it will be interesting to explore whether human populations that have different dietary histories, for example experiencing extremely limited nutrition for many generations, may respond differently to modern diets rich in sugars.<p>", "time": "04 Jan 2019, 04:26", "type": "health"}
{"title": "Finland’s birth rate still low in Jan-Nov 2018", "url": "http://www.dailyfinland.fi/health/8540/Finlands-birth-rate-still-low-in-Jan-Nov-2018", "review": "", "content": "<p>A total of 43,786 children babies were born in the country in the January-November period of 2018 posting a 2,712 fewer births than that in the corresponding period of last year, said the Statistics Finland.<p> <p>On the other side, the number of deaths in the same period in Finland was 49,475 or 495 more than that in the one year earlier. Finland’s population at end-November 2918 was standing at 5,522,015.<p> <p>The total population, however, increased by 8,885 persons in the January-November period as influx of migration gain exceeded emigration of 14,574 immigration in the period. The number of births, too, was 5,689 lower than that of deaths in that period which resulted in a slight rise on the country’s total population.<p> <p>According to the Preliminary Statistics in November 2018, 29,616 persons immigrated to Finland compared to 15,042 emigrated from Finland.<p> <p>The number of immigrants was 7 times higher and the number of emigrants 714 lower than those figures recorded in the corresponding period of the previous year. In all, 7,924 of the immigrants and 10,105 of the emigrants were Finnish citizens.<p>", "time": "26 Dec 2018, 01:40", "type": "health"}
{"title": "Mobile phone texting can help smokers quit smoking", "url": "http://www.dailyfinland.fi/health/8466/Mobile-phone-texting-can-help-smokers-quit-smoking", "review": "", "content": "<p>A study by Chinese researchers showed that texting on mobile phones could help smokers quit smoking.<p> <p> The study published on Tuesday in the journal PLOS Medicine showed among smokers who received a 12-week-long mobile phone-based intervention quitted smoking, 6.5 percent stopped smoking by the end of the study.<p> <p> The researchers from the Second Xiangya Hospital of Central South University in China said the intervention could have greater reach and higher feasibility than in-person treatments.<p> <p> It has great potential to improve population health and should be considered for large-scale use in China, according to the study.<p> <p> They conducted a randomized controlled trial across China from August 2016 to May 2017, recruiting a total of 1,369 adult smokers. Participants were randomly assigned to a 12-week intervention consisting of either high-frequency or low-frequency messaging, or to a control group that received text messages unrelated to quitting.<p> <p> The text messages were aimed at improving self-efficacy and behavioral capability for quitting, according to the study.<p> <p> Twelve weeks later, 6.5 percent of them turned continuous smoking abstinence in the high-frequency group while 6 percent quitted smoking in the low-frequency group. 1.9 percent of them stopped smoking in control group.<p> <p> China has the highest global prevalence of cigarette smokers, accounting for more than 40 percent of the total cigarette consumption in the world.<p>", "time": "20 Dec 2018, 02:56", "type": "health"}
{"title": "Mechanism of neonatal diabetes discovered", "url": "http://www.dailyfinland.fi/health/8428/Mechanism-of-neonatal-diabetes-discovered", "review": "", "content": "<p>Researchers at the University of Helsinki have described mechanisms linking chronic cellular stress to poor development of the insulin-producing cells.<p> <p>Insulin is secreted from the beta cells located in the pancreas and it is crucial for the maintenance of normal blood sugar levels, said the University of Helsinki in a press release referring to a study.<p> <p>Deficiency of insulin leads to diabetes, characterised by elevated blood sugar. Diabetes most commonly presents in childhood as Type 1 diabetes and in adults as Type 2 diabetes.<p> <p>Sometimes diabetes is diagnosed already in very small babies, during the first six months of life. In these cases, mutations in the gene encoding insulin are often found. <p> <p>These mutations are only found in one copy of the gene; that means that half of the insulin produced is normal, which should be enough to secure normal blood sugar.<p> <p>However, this is not the case: insulin secretion stops totally after a few months. It is believed that this is caused by a toxic effect of the mutant insulin inside the cell, but the exact mechanisms are understood poorly.<p> <p>Mutant insulin is known to cause a chronic stress reaction in the beta cell, and it has been thought that this leads to the death of the cell. It is important to understand the detailed consequences of beta-cell stress, because this may help in developing drugs for preventing both rare and common forms of diabetes.<p> <p>“We now had the chance to test this with real patient-derived cells,” said Professor Timo Otonkoski of the University of Helsinki.<p> <p>Researchers created a human disease model using stem cells from people carrying insulin gene mutations; then they corrected cells using a gene editing technique called CRISPR.<p> <p>The mutant and corrected stem cells were then induced to turn into insulin-secreting beta cells and the researchers followed the function of the cells after transplanting them in mice.<p> <p>“The main finding of the study was that these cells do not die from the chronic stress, but their growth and development is disturbed. These effects are mediated through processes that could potentially be targeted by drugs,” said Diego Balboa.<p> <p>“In this study, we describe mechanisms linking chronic cellular stress to the poor development of the insulin-producing cells. A strongly reduced number of beta-cells will cause diabetes immediately, but even a milder defect will increase the risk of diabetes later in life. Understanding the molecular mechanisms of these processes may help in devising ways to preserve the mass and function of beta cells,” said Otonkoski.<p>", "time": "18 Dec 2018, 03:47", "type": "health"}
{"title": "2 episodic memory tests predict brain atrophy", "url": "http://www.dailyfinland.fi/health/8319/2-episodic-memory-tests-predict-brain-atrophy", "review": "", "content": "<p>Use of two episodic memory tests help in predicting brain atrophy and Alzheimer’s disease, as indicated by a study carried out by a team of the University of Helsinki and the University of California.<p> <p>The research suggest comprehensive use of memory tests could improve the diagnosis of mild cognitive impairment due to Alzheimer’s disease, said a press release issued by University of Helsinki.<p> <p>Mild cognitive impairment is a heterogeneous condition; it may be reversible or permanent, but it is also associated with a higher risk of dementia, Alzheimer’s disease in particular.<p> <p>Mild cognitive impairment refers to impairment of memory or other cognitive domains in a situation where the individual remains capable of independently conducting daily activities and not fulfilling the criteria of dementia.<p> <p>The study conducted at the University of Helsinki and the University of California, San Diego, found that the use of two memory tests assessing episodic memory made the diagnosing of mild cognitive impairment due to Alzheimer’s disease more precise.<p> <p>Memory tests helped identify those individuals with an increased risk of receiving an Alzheimer’s diagnosis within the next three years.<p> <p>“The use of two memory tests markedly improved the accuracy of the prognosis for an Alzheimer’s disease diagnosis and brain atrophy in the medial temporal lobes during a three-year follow-up period,” said Eero Vuoksimaa, an Academy of Finland research fellow at the University of Helsinki.<p> <p>“The results highlight the importance of neuropsychological assessment as a cost-effective method of diagnosing mild cognitive impairment due to Alzheimer’s disease,” Vuoksimaa added.<p> <p>The study utilised data collected in the United States under the Alzheimer’s Disease Neuroimaging Initiative (ADNI), comprising 230 cognitively normal individuals and 394 individuals with mild cognitive impairment on the basis of poor memory performance in one episodic memory measure, namely in story recall. Those with mild cognitive impairment were further divided into two groups based on whether their memory performance was impaired only in one (story recall) or two (story recall and word list recall) tests.<p> <p>The researchers investigated baseline differences between the groups in terms of Alzheimer’s disease cerebrospinal fluid biomarkers, finding that those who performed poorly in both episodic memory tests more closely resembled Alzheimer’s patients than those who only did poorly in the story recall test.<p> <p>“During the follow-up stage, brain atrophy in the medial temporal lobes of those who only performed poorly in the story recall test did not differ from the cognitively healthy participants, whereas in those who had poor performance in both the story and word list recall tests, brain atrophy was faster,” Vuoksimaa explained.<p> <p>Alzheimer’s disease was diagnosed in approximately half of the participants who performed poorly in both episodic memory tests within the three-year study period, whereas only 16% of those with a poor performance in only one memory test received diagnosis of Alzheimer’s Disease.<p>", "time": "11 Dec 2018, 04:06", "type": "health"}
{"title": "Sauna bathing reduces heart mortality risk for elderly", "url": "http://www.dailyfinland.fi/health/8264/Sauna-bathing-reduces-heart-mortality-risk-for-elderly", "review": "", "content": "<p>A study conducted by researchers from the University of Eastern Finland and the University of Jyväskylä has shown that frequent sauna bathing can lower the risk of death from cardiovascular disease (CVD) in middle aged and elderly people.<p> <p>The research, which has recently been published in the open access journal BMC Medicine, found that the mortality from CVD among people taking sauna four to seven times a week is 73 percent lower than those using sauna once a week, according to the press release issued by the University of Eastern Finland.<p> <p>The findings were based on self-reported questionnaire and death cases from cardiovascular causes recorded in documents of death. A total of 1,688 people living in eastern Finland were involved in the research.<p> <p>At the beginning of the study, the average age of the participants was 63 years old. Among them, 51.4 percent were woman and 49.5 percent were man. Data for the study were collected between 1998 and 2015.<p> <p>The long-term study found the number of cases of CVD mortality decreased as the length of time spent in the sauna per week increased. For those who spent over 45 minutes per week in a sauna, the number of cases was 5.1 per 1,000 person years, while the number was 9.6 for those who spent less than 15 minutes in the sauna per week.<p> <p>Jari Laukkanen, a professor at the University of Eastern Finland, said an important finding of the research was that more regular sauna use is associated with a lower risk of death from CVD in middle-aged to elderly women as well as in men, adding that previous studies were done mostly in men only.<p> <p>There are several possible reasons behind the association between sauna use and the lower risk of death from CVD. The research team has shown in previous studies that high sauna use is associated with lower blood pressure. In addition, sauna use is known to trigger an increase in heart rate, the same as in low to moderate intensity physical exercise, explained Laukkanen.<p> <p>However, the researchers pointed out that further research is needed to understand if the findings apply to other population outside the region.<p> <p>Sauna is an essential part of the Finnish culture. There are over 3 million saunas in Finland, a country with only 5.4 million population. It means that every household has at least one sauna in average. For generations, Finns have believed that sauna has many health benefits.<p>", "time": "08 Dec 2018, 00:59", "type": "health"}
{"title": "Fertility rates drop among all women's educational groups", "url": "http://www.dailyfinland.fi/health/8237/Fertility-rates-drop-among-all-womens-educational-groups", "review": "", "content": "<p>The total fertility rate has continued to decline in all women’s educational groups since 2010, when the current slide in the birth rate started, according to the Statistics Finland.<p> <p>The fertility rate of women with basic education has dropped 25 per cent and of those with tertiary education 24 per cent since 2010. The rate of decline has been slightly less, 20 per cent, among those with upper secondary education.<p> <p>The total fertility rate is commonly used in measuring fertility. It indicates how many children a woman might give birth to during her life time, if the fertility rates remain the same as in the base year.<p> <p>These data concern only mothers and fathers born in Finland. A share of qualifications taken abroad are missing from the Statistics Finland’s Register of Completed Education and Degrees, which resulted in the data on educational qualifications of many people born abroad are absent here.<p> <p>The nosedive in the total fertility rate has been similar for men as for women. However, the change from 2010 has been steeper in all men’s educational groups.<p> <p>For men with tertiary education, the total fertility rate has decreased 28 per cent and for those with basic education 27 per cent since 2010. The fertility rate has diminished slightly less among those with upper secondary level education, by 22 per cent.<p> <p>The childless women include those aged 25 to 29 and 35 to 39 born in Finland. But not all of those aged 25 to 29 have necessarily completed their highest educational qualifications yet and their number of children is not final either. But changes in the birth rate at that age reflect the general trend of decline in the birth rate.<p> <p>The birth rate in general has dropped considerably between 2010 and 2017. Measured by the total fertility rate, in those seven years it declined 20 per cent, from 1.87 children per woman to 1.49 children per woman. The total fertility rate can also be broken down by the number of children born.<p>", "time": "05 Dec 2018, 04:46", "type": "health"}
