{"title": "China's dev offers Finland more opportunities: Niinistö", "url": "http://www.dailyfinland.fi/national/8794/Chinas-dev-offers-Finland-more-opportunities-Niinistö", "review": "", "content": "<p>China's rapid development has created abundant opportunities for Finland, said President Sauli Niinistö in an interview with Xinhua before his state visit to China starting Sunday.<p> <p>With the 2022 Winter Olympics approaching, Finland is willing to share its knowledge of running sports events in winter as well as other areas like sporting equipment, said Niinistö.<p> <p>The president said he would exchange views with Chinese President Xi Jinping on regional and international issues of common concern.<p> <p>Earlier, the two heads of state agreed on building a more future-oriented new-type cooperative partnership between Finland and China. The two governments have worked out action plans to implement the consensus, Niinistö said.<p> <p>During the visit, Niinistö is scheduled to attend celebrations of the China-Finland Year of Winter Sports.<p> <p>Finnish government departments, sports organizations, and related enterprises are busy preparing for the upcoming activities. For example, Business Finland just announced the formation of its Finnish Winter Sports Cluster and is looking for strong Chinese partners.<p> <p>Niinistö said that among the members of the delegation is the mayor of Lahti, a city in central Finland which has hosted seven Nordic Ski World Championships. Niinistö called ice-hockey and cross-country skiing Finnish specialties, and said Finland wants to \"help China as much as possible\" in these fields.<p> <p>Since the 1990s, Niinistö has visited China several times. \"Every time I go to China, I find many amazing changes,\" he said. \"China has developed into one of the major powers of the world, becoming a technological power and helping more and more people (get) out of poverty.\"<p> <p>Niinistö noted the achievements in the economic cooperation between the two countries, saying the cooperation is based on equality.<p> <p>Improvements in the business environment and the development of free trade zones in China have offered more opportunities for Finnish companies to enter China, he said.<p> <p>Niinistö said Finnish companies, including the ones joining the visit, should understand how highly competitive China's massive market is. Small and medium-sized enterprises in Finland have limited resources, but if they can take the lead in a certain market segment, they can also succeed in the Chinese market, he said.<p> <p> Since the Belt and Road Initiative was proposed by China in 2013, there have been several new railway cargo service lines, direct flights and better sea freight services connecting China and Finland.<p> <p>The president believed the new connections \"give a lot of possibilities on concrete terms\" and also create more \"possibilities to understand each other.\"<p> <p>Niinistö said that Finland could play a role as dialogue facilitator between China and the European Union (EU). He added that the common challenges facing China and Finland will add new momentum to the relationship.<p>", "time": "14 Jan 2019, 17:58", "type": "news"}
{"title": "3 foreigners arrested in Helsinki on alleged sex crimes", "url": "http://www.dailyfinland.fi/national/8776/3-foreigners-arrested-in-Helsinki-on-alleged-sex-crimes", "review": "", "content": "<p>Helsinki police announced on Sunday it had detained three foreigners late Saturday as sex crime suspects. The announcement came after a series of alleged sex crimes by asylum seekers in Oulu, northern Finland, aroused debate in the Nordic nation.<p> <p>The investigation concerned alleged sexual abuse of minors and aggravated rape suspected to have taken place in an apartment during the last two months in Helsinki. In Finnish law, anyone under 16 is a child in terms of sexual abuse.<p> <p>The city of Oulu has got a pledge from the cabinet for additional government funding to cope with the crime situation. Prime Minister Juha Sipilä and two other ministers visited Oulu on Saturday. Sipilä repeated his message that asylum seekers must adhere to Finnish values and laws.<p> <p>Parliamentary party groups will review the situation on Tuesday. Antti Lindtman, chairman of the opposition social democratic parliamentary group, suggested on Sunday that a special police unit \"with enough resources\" should be established to fight internet based criminality.<p> <p>He demanded that a supplementary budget be accepted before this parliament is dissolving in March. The parliamentary election is due to take place in April.<p>", "time": "13 Jan 2019, 23:57", "type": "news"}
{"title": "Tougher punishment on immigrant sex offenders", "url": "http://www.dailyfinland.fi/national/8764/Tougher-punishment-on-immigrant-sex-offenders", "review": "", "content": "<p>Interior Minister Kai Mykkänen on Saturday repeated his call for tougher punishment on sex offenders who are immigrants or asylum seekers, after police uncovered four new cases of suspected sexual assault against minors in Oulu, northern Finland.<p> <p>Mykkänen reiterated his position that dual citizens who are found guilty of aggravated sexual offenses should have their Finnish citizenship deprived.<p> <p>\"If someone violates one of our basic values, the physical integrity of another individual, I consider that a national threat,\" said the minister in the morning program of national broadcaster Yle.<p> <p>He pointed out that it is unacceptable that someone who comes to Finland in search of safety only creates more insecurity, emphasizing that these crimes have no ground in Finland.<p> <p>The Oulu Police Department said on Friday that they launched a preliminary investigation into four new cases of suspected sexual abuse of girls under the age of 15. The announcement followed a previous round of investigations on similar offenses in November last year.<p> <p>After the first series of sexual crimes revealed last November, Mykkänen made similar suggestions, saying that immigrants and asylum seekers who commit sexual crimes should be deported or have their citizenship revoked.<p> <p>According to Mykkänen, the suspects in the latest cases came to Finland from North Africa and the Middle East. Some of them were Finnish citizens and some were waiting for asylum decisions.<p>", "time": "12 Jan 2019, 23:33", "type": "news"}
{"title": "Defence Forces to procure counter-battery radars", "url": "http://www.dailyfinland.fi/national/8774/Defence-Forces-to-procure-counter-battery-radars", "review": "", "content": "<p>The Defence Forces' Logistic Command on Friday got approval from Defence Minister Jussi Niinistö to procure counter-battery radars for the Defence Forces.<p> <p>The radar systems, training for the systems and spare parts will be ordered from the Israeli company ELTA Systems, said an official press release.<p> <p>The new systems will provide the Army with capabilities to locate the opponent's firing units and launch counter-battery activities. The new capability will develop the Army fires while counter-battery activities restrict the opponent's freedom to use fire power.<p> <p>In addition to target acquisition for counter-battery activities, the modern multi-role radars can be used, at the same time, also for fire observing and air surveillance.<p> <p>The Defence Forces invited international tenders and the selected system was tested in Finland in spring 2018. It excelled in the tendering process and in meeting the requirements.<p> <p>The radar system deliveries are scheduled for 2021; the contract also includes options for further procurements.<p> <p>Millog Oy and Telva Oy will be in charge of systems maintenance services. Millog Oy is the Defence Forces strategic partner in maintenance and Telva Oy represents ELTA Systems in Finland.<p>", "time": "13 Jan 2019, 03:31", "type": "news"}
{"title": "Air Force commander not to continue in office: minister", "url": "http://www.dailyfinland.fi/national/8752/Air-Force-commander-not-to-continue-in-office-minister", "review": "", "content": "<p>Commander of the Finnish Air Force, General Sampo Eskelinen, will not be seeking a renewal of his term, Defence Minister Jussi Niinistö confirmed to media on Friday.<p> <p>Eskelinen has been charged for negligence of duty as he allegedly did not react quick enough to the misconduct by a colonel in the autumn of 2017.<p> <p>Eskelinen started as the commander of the air force in June 2017 and his current term ends in March, although he could have decided to continue until 2022.<p> <p>Niinistö refused to speculate whether Eskelinen would have been reappointed if he had applied.<p> <p>The minister also reacted to reports that an initial probe may be launched by the State Prosecution Office into the role of the Commander of the Defence Forces, General Jarmo Linberg.<p> <p>Niinistö said Linberg would be able to continue in his duties as the commander during such an initial probe.<p> <p>\"But if actual investigation starts or charges will be raised, that is then another situation.\" said the minister, adding that Linberg has his full trust.<p> <p>President Sauli Niinistö is to appoint a new commander for the air force next week.<p>", "time": "11 Jan 2019, 23:22", "type": "news"}
{"title": "Racial relations in Oulu becomes tense", "url": "http://www.dailyfinland.fi/national/8754/Racial-relations-in-Oulu-becomes-tense", "review": "", "content": "<p>The racial relations in Oulu have become tense in the wake of the continued reporting about sexual abuse.<p> <p>Senior police officer Markus Kiiskinen told a Finnish language daily Helsingin Sanomat that police have noticed the change in atmosphere. No violence against foreigners has been reported, but they have been \"pushed\" in the streets.<p> <p>Kiiskinen said that purposefully wrong information is being spread in social media. The windows of the local mosque were crashed in December 2018, for the second time in the year.<p> <p>\"Groundless disapproval has been targeting people that have nothing to do with the incidents,\" he said.<p> <p>Kiiskinen noted that perhaps due to the atmosphere, asylum seekers are no longer seen sitting around in the leading shopping mall. \"Earlier it was their regular hangout.\"<p> <p>Meanwhile, in Oulu, police are investigating four new cases of sex crimes against girls under 15 years old, according to the police.<p> <p>The police confirmed the detention of three men of foreign extraction as suspects. The crimes took place during the summer of 2018.<p> <p>One of the victims has died, police told a Finnish language newspaper Kaleva, but added there was no crime attached to the death.<p> <p>The newly-announced crimes were the latest among a series of similar cases in the northern city. Late last year, Oulu police detained seven men for abuse of minor-aged girls. One suspect had left Finland and was arrested in Germany in early January.<p> <p>Oulu police is further investigating the role of four other foreign men in cases of sexual abuse. Girls between 12 and 15 had been approached in social media and promised tobacco and alcohol if they visit the men.<p> <p>Following the cases published on Friday, Prime Minister Juha Sipilä issued a statement where he noted that already the earlier cases aroused in him a sense of loathing. He said he understands the concern and shock by citizens.<p> <p>He said the asylum system's task is to help those in plight, but \"it cannot protect criminals\". He noted that legislation is being changed to make it easier to expel foreigners guilty of aggravated crimes. In his New Year's Eve statement, Sipilä also took up the situation in Oulu.<p>", "time": "12 Jan 2019, 00:11", "type": "news"}
{"title": "Finland, India boost cooperation in cyber security, space", "url": "http://www.dailyfinland.fi/national/8755/Finland-India-boost-cooperation-in-cyber-security-space", "review": "", "content": "<p>Finland and India signed two Memorandums of Understanding on Thursday with the view to strengthen cooperation in the cyber security sector and peaceful use of outer space.<p> <p>The Memorandums of Understanding were signed between State Secretary Matti Anttonen and India's Minister of State for External Affairs Vijay Kumar Singh, said a press release issued by the Ministry of Foreign Affairs on Friday.<p> <p>Permanent State Secretary Matti Anttonen visited India from January 8 to January 10.<p> <p>The National Cyber Security Centre of the Transport and Communications Agency of Finland (TrafiCom) and the Indian Computer Emergency Response Team (CERT-In) are responsible for the document dealing with cyber security.<p> <p>The Memorandum of Understanding is based on the parties' wish to engage in closer cooperation in cyber security matters. In networked societies, cyber threats faced by one sector usually affect also all other sectors.<p> <p>The aim of the cooperation is both to improve exchange of information between the parties on various cyber threats and to improve their capacity to prevent and resolve different cyber security incidents. Finland is known for its very high expertise in cyber security matters.<p> <p>The Ministry of Economic Affairs and Employment of Finland and the Indian Space Research Organisation (ISRO) are responsible for the Memorandum of Understanding on the space sector.<p> <p>The cooperation is based on India's capacity to offer cost-effective launches of small satellites and Finnish organisations' growing interest in satellite systems of their own. So far, three Finnish satellites have been launched from the Satish Dhawan Space Centre (SDSC) in India: Aalto-1 of the Aalto University in June 2017; Finland's first commercial satellite, Iceye Oy’s ICEYE-X1, in January 2018; and Reaktor Space Lab's Hello World satellite in late November 2018.<p>", "time": "12 Jan 2019, 01:06", "type": "news"}
{"title": "Turku stabber denies terrorist intent at appeal court", "url": "http://www.dailyfinland.fi/national/8758/Turku-stabber-denies-terrorist-intent-at-appeal-court", "review": "", "content": "<p>The defence of Moroccan Abderrahman Bouanane objected the definition of his attacks in August 2017 in Turku, western Finland as terrorism.<p> <p>The Turku court of appeals on Friday began processing his appeal. A lower court in Turku gave him a life sentence last year for killing two and injuring eight people with a terrorist intent. <p> <p>A deletion of the terrorist intent would not change the sentence. However, Bouanane's defence lawyer told a Finnish language newspaper Turun Sanomat that it could have a bearing on how soon Bouanane could get out of the prison.<p> <p>In Finland, life time convicts can get out after 12 years, or alternatively with a presidential pardon. But a terrorism reference in the sentence could delay the release, local media reported.<p> <p>Prosecutor Sampsa Hakala adhered to the terrorist intent though. \"He regarded himself as a soldier of ISIS when committing his actions, and we have proof that his motivation was terrorism,\" he said to Turun Sanomat.<p> <p>Bouanane was expected to participate in the session through a videolink in the Turku prison, but his lawyer said on Friday he would not appear during the whole process.<p> <p>The court will arrange a four-day trial in the prison in February. Turun Sanomat noted that the court could demand that Bouanane is available for questioning by the court.<p> <p>The Turku case has been the first in Finland where terrorist intent was used as a basis for sentencing. Hakala said that it has some nature of a precedent and thus the processing at appeals court level is in the interest of prosecution as well.<p>", "time": "12 Jan 2019, 02:12", "type": "news"}
{"title": "Immigrant violence pushes up populist support : poll", "url": "http://www.dailyfinland.fi/national/8747/Immigrant-violence-pushes-up-populist-support--poll", "review": "", "content": "<p>While the contention of the Sosialidemokraattinen Puolue (Social Democratic Party of Finland-SDP) and the Kansallinen Kokoomus (National Coalition Party-NCP) about the leading position remains narrow, a relatively large increase in the support of the populist Perussuomalaiset (Finns Party) captured the attention on Thursday.<p> <p>In a poll commissioned by the national broadcaster Yle, the Perussuomalaiset gained two percentage points and its support reached 10.2 percent. The party is now the fifth in the national support ranking, but both the party leader Jussi Halla-aho and observers attributed the increase to the recent news about violence associated with immigrants.<p> <p>It was also said the Perussuomalaiset has a clearer line in the climate and energy policies. \"These are developments we have warned about for years,\" Halla-aho said. At the end of December 2018, a survey commissioned by Alma Media indicated the same trend.<p> <p>Halla-aho predicted that his party would get a better result in the April election.<p> <p>An investigation is going on in Oulu, northern Finland into alleged raping by eight men of foreign descent. And another one is about Christmas Eve killing of a seven-year-old by his uncle. Police has defined him as a foreign citizen, but not given any nationality.<p> <p>The opposition social democrats were in the lead with 21.2 percent and it declined slightly. The Kokoomus increased support and was now only 0.8 percent behind the social democrats with 19.6 percent support.<p> <p>Local commentators have expressed the view that it is very unlikely that the Suomen Keskusta (Centre Party) would bounce back from its current 16.1 percent. This would indicate the position of the next prime minister would be subject to a duel between the SDP and the Kokoomus.<p> <p>Analysts have believed that labor relations and job security issues are likely to be prominent in the election debates. The four-year tenure of the current center right coalition under the centrist Prime Minister Juha Sipilä has seen many conflicts about labor issues.<p> <p>Experts have said that while labor legislation in Finland has traditionally been a tool to protect the employees, changes pursued by the current government have been aiming at easing the role of the employers and reducing the employer-risks in offering a job.<p> <p>The Vihreäliitto (Green League) is at 13.6 percent, which would give them their new record number of seats. Since Pekka Haavisto was elected as interim chairman following the resignation of Touko Aalto in November 2018, the backing of the greens started increasing but is leveling off now.<p> <p>At the peak of their support in late summer 2017, the greens were the second largest party with 17.6 percent, after the conservatives, and they themselves said they would aim at being the largest party. But their support declined then drastically.<p>", "time": "11 Jan 2019, 02:05", "type": "news"}
{"title": "Ex Iraqi soldier sentenced in Finland for war crimes", "url": "http://www.dailyfinland.fi/national/8735/Ex-Iraqi-soldier-sentenced-in-Finland-for-war-crimes", "review": "", "content": "<p>The Helsinki District Court sentenced on Thursday a former soldier of the Iraqi army in prison for war crimes, local media reported.<p> <p>According to the court, the 41-year-old Iraqi man treated the bodies of dead people in an inhuman and degrading way and offended their honor in Iraq in the spring of 2015, when he participated in battles against the militant group ISIS.<p> <p>The man was accused of posting two horrible videos on Facebook. In the first video, the man cut the head of a dead ISIS fighter, and in the second video, he posed in front of burning corpses.<p> <p>In the judgment, the court stated that the man's decapitation of a dead fighter, taking videos and photos and distributing them on the social media, are generally a violation of human dignity.<p> <p>The court, therefore, sentenced him to one and a half years of conditional imprisonment.<p> <p>The defendant admitted in the court that he cut off the head of a dead fighter and hung the head in his hand, but denied being involved in burning bodies and uploading or allowing others to upload the footage to Facebook.<p> <p>He also told court the cruelty of ISIS and the injustice he experienced. ISIS had kidnapped his four loved ones, according to the man.<p> <p>However, the court did not accept the man's reasoning and considered that he had committed war crimes, saying that the cruelty of ISIS' actions against the local population is not a justification for accepting inhuman and degrading treatment.<p>", "time": "10 Jan 2019, 21:54", "type": "news"}
{"title": "Only 1% municipal waste disposed to landfill sites", "url": "http://www.dailyfinland.fi/national/8728/Only-1-municipal-waste-disposed-to-landfill-sites", "review": "", "content": "<p>The total amount of municipal waste was 2,744,655 tonnes in 2017 and the amount has remained at the same level as in the last few years, according to Statistics Finland.<p> <p>Disposal of municipal waste at landfill sites has decreased strongly according to the prevailing development in recent years.<p> <p>In 2017, only around one per cent of municipal waste was disposed at landfill sites. It has been replaced by recovery of waste: both energy production and material recovery are competing for the recovery of former landfill waste. Recovery of municipal waste as energy has in recent years been the predominant recovery method.<p> <p>The use of municipal waste as a fuel for district heat production of built-up areas has become established and its role has grown there. Organic components included in energy-recovered municipal waste also curb greenhouse gas emissions in case they replace the use of fossil fuels.<p> <p>Slightly less municipal waste than before ends up in material-specific separate collection and through it to recycling.<p> <p>However, plastic, wood, paper and paperboard containing mixed components are also collected for energy recovery and are separated from other municipal waste. If we add up separately collected or separated waste components for recycling and energy recovery, the amount of waste separated from mixed waste into recovery has grown.<p> <p>In 2017, around 99 per cent of municipal waste was recovered, which is more than ever before. The share of material recovery fell to 39 per cent, but the share of energy recovery went up to 60 per cent. The material recovery rate is high particularly for fibre packaging and other collected fibre. Most of biowaste is composted or digested, in total around 370,000 tonnes. The digestion residue is used in soil improvement or landscaping, as is compost soil.<p> <p>The growth in the amount of municipal waste has evened out in recent years, varying between 2.7 and 2.8 million tonnes. Calculated per capita, the amount has stabilised at around 500 kilogrammes a year. In 2017, the ratio decreased by a few kilogrammes from the previous year and stood at 498 kilogrammes per capita.<p>", "time": "10 Jan 2019, 03:21", "type": "news"}
{"title": "Air Force commander charged over misconduct", "url": "http://www.dailyfinland.fi/national/8719/Air-Force-commander-charged-over-misconduct", "review": "", "content": "<p>The commander of the Finnish air force general Sampo Eskelinen and former commander of the Carelia Wing unit of the air force colonel Markus Päiviö have been charged for military misconduct, national broadcaster Yle reported.<p> <p>Päiviö is suspected of \"improper behavior\" and \"improper treatment of his subordinates\" during a maneuver in Lapland in September 2017, and Eskelinen is suspected of not initiating the investigations \"without delay\". Charges against Paivio also include alleged defamation.<p> <p>The defence forces told the media on Tuesday that Eskelinen will continue in his duties for the time being. \"A review of possible measures on him has been started,\" Max Arhippainen, information director of the defence forces said. He did not say how long it would take.<p> <p>Päiviö was transferred to other duties from the wing commander position in February 2018, but remains on active duty.<p> <p>Due to the high rank of the officers, the case is processed at the Helsinki High Court. No court date has been reported. Under Finnish law, the charges will become fully public when the trial begins.<p> <p> Both Eskelinen and Päiviö have denied the charges.<p>", "time": "09 Jan 2019, 22:40", "type": "news"}
{"title": "China's dev offers Finland more opportunities: Niinistö", "url": "http://www.dailyfinland.fi/national/8794/Chinas-dev-offers-Finland-more-opportunities-Niinistö", "review": "", "content": "<p>China's rapid development has created abundant opportunities for Finland, said President Sauli Niinistö in an interview with Xinhua before his state visit to China starting Sunday.<p> <p>With the 2022 Winter Olympics approaching, Finland is willing to share its knowledge of running sports events in winter as well as other areas like sporting equipment, said Niinistö.<p> <p>The president said he would exchange views with Chinese President Xi Jinping on regional and international issues of common concern.<p> <p>Earlier, the two heads of state agreed on building a more future-oriented new-type cooperative partnership between Finland and China. The two governments have worked out action plans to implement the consensus, Niinistö said.<p> <p>During the visit, Niinistö is scheduled to attend celebrations of the China-Finland Year of Winter Sports.<p> <p>Finnish government departments, sports organizations, and related enterprises are busy preparing for the upcoming activities. For example, Business Finland just announced the formation of its Finnish Winter Sports Cluster and is looking for strong Chinese partners.<p> <p>Niinistö said that among the members of the delegation is the mayor of Lahti, a city in central Finland which has hosted seven Nordic Ski World Championships. Niinistö called ice-hockey and cross-country skiing Finnish specialties, and said Finland wants to \"help China as much as possible\" in these fields.<p> <p>Since the 1990s, Niinistö has visited China several times. \"Every time I go to China, I find many amazing changes,\" he said. \"China has developed into one of the major powers of the world, becoming a technological power and helping more and more people (get) out of poverty.\"<p> <p>Niinistö noted the achievements in the economic cooperation between the two countries, saying the cooperation is based on equality.<p> <p>Improvements in the business environment and the development of free trade zones in China have offered more opportunities for Finnish companies to enter China, he said.<p> <p>Niinistö said Finnish companies, including the ones joining the visit, should understand how highly competitive China's massive market is. Small and medium-sized enterprises in Finland have limited resources, but if they can take the lead in a certain market segment, they can also succeed in the Chinese market, he said.<p> <p> Since the Belt and Road Initiative was proposed by China in 2013, there have been several new railway cargo service lines, direct flights and better sea freight services connecting China and Finland.<p> <p>The president believed the new connections \"give a lot of possibilities on concrete terms\" and also create more \"possibilities to understand each other.\"<p> <p>Niinistö said that Finland could play a role as dialogue facilitator between China and the European Union (EU). He added that the common challenges facing China and Finland will add new momentum to the relationship.<p>", "time": "14 Jan 2019, 17:58", "type": "news"}
{"title": "China's dev offers Finland more opportunities: Niinistö", "url": "http://www.dailyfinland.fi/national/8794/Chinas-dev-offers-Finland-more-opportunities-Niinistö", "review": "", "content": "<p>China's rapid development has created abundant opportunities for Finland, said President Sauli Niinistö in an interview with Xinhua before his state visit to China starting Sunday.<p> <p>With the 2022 Winter Olympics approaching, Finland is willing to share its knowledge of running sports events in winter as well as other areas like sporting equipment, said Niinistö.<p> <p>The president said he would exchange views with Chinese President Xi Jinping on regional and international issues of common concern.<p> <p>Earlier, the two heads of state agreed on building a more future-oriented new-type cooperative partnership between Finland and China. The two governments have worked out action plans to implement the consensus, Niinistö said.<p> <p>During the visit, Niinistö is scheduled to attend celebrations of the China-Finland Year of Winter Sports.<p> <p>Finnish government departments, sports organizations, and related enterprises are busy preparing for the upcoming activities. For example, Business Finland just announced the formation of its Finnish Winter Sports Cluster and is looking for strong Chinese partners.<p> <p>Niinistö said that among the members of the delegation is the mayor of Lahti, a city in central Finland which has hosted seven Nordic Ski World Championships. Niinistö called ice-hockey and cross-country skiing Finnish specialties, and said Finland wants to \"help China as much as possible\" in these fields.<p> <p>Since the 1990s, Niinistö has visited China several times. \"Every time I go to China, I find many amazing changes,\" he said. \"China has developed into one of the major powers of the world, becoming a technological power and helping more and more people (get) out of poverty.\"<p> <p>Niinistö noted the achievements in the economic cooperation between the two countries, saying the cooperation is based on equality.<p> <p>Improvements in the business environment and the development of free trade zones in China have offered more opportunities for Finnish companies to enter China, he said.<p> <p>Niinistö said Finnish companies, including the ones joining the visit, should understand how highly competitive China's massive market is. Small and medium-sized enterprises in Finland have limited resources, but if they can take the lead in a certain market segment, they can also succeed in the Chinese market, he said.<p> <p> Since the Belt and Road Initiative was proposed by China in 2013, there have been several new railway cargo service lines, direct flights and better sea freight services connecting China and Finland.<p> <p>The president believed the new connections \"give a lot of possibilities on concrete terms\" and also create more \"possibilities to understand each other.\"<p> <p>Niinistö said that Finland could play a role as dialogue facilitator between China and the European Union (EU). He added that the common challenges facing China and Finland will add new momentum to the relationship.<p>", "time": "14 Jan 2019, 17:58", "type": "news"}
