{"title": "Benzema adds to Real Madrid's injury woes", "url": "http://www.dailyfinland.fi/sports/8800/Benzema-adds-to-Real-Madrids-injury-woes", "review": "", "content": "<p>Real Madrid have confirmed that striker Karim Benzema broke the little finger on his right hand during their 2-1 win away to Real Betis on Sunday night.<p> <p> Benzema suffered the injury when he fell badly in the first half and didn't reappear at the start of the second, when he was replaced by B-team forward Cristo Gonzalez.<p> <p> A statement on Real Madrid's official website says that Benzema's return to action is \"pending on his recovery\", but with fellow attackers Gareth Bale, Marco Asensio and Mariano Diaz all having struggled for form or fitness so far this season, rumors suggest that Benzema's injury may prompt Real Madrid to sign another striker as cover during the ongoing transfer window.<p> <p> Meanwhile, Isco's situation at the club is becoming increasingly precarious due to his breakdown in relations with coach Santiago Solari.<p> <p> Despite Madrid's long injury list, Isco failed to play a single minute on Sunday evening, and Los Merengues may be tempted to use the midfielder as a makeweight in any deal to bring a new striker to the club, with Inter Milan's Argentinian forward Mauro Icardi thought to be high on Madrid's shortlist.<p>", "time": "15 Jan 2019, 01:48", "type": "sports"}
{"title": "Messi scores 400th league goal to help Barca reach halfway point", "url": "http://www.dailyfinland.fi/sports/8781/Messi-scores-400th-league-goal-to-help-Barca-reach-halfway-point", "review": "", "content": "<p>Leo Messi scored the 400th league goal to gift FC Barcelona the 'Winter Champions' in the Liga Santander with a 3-0 win over Eibar at home on Sunday.<p> <p> Messi netted Barca's second of the night after Luis Suarez had opened the scoring in the first half and Suarez rounded off the scoring shortly afterwards to confirm, not just Barca's win, but also to ensure they reach the midway point of the season with a five point lead over second placed Atletico Madrid.<p> <p> Earlier in the day, Antoine Griezmann's 57th minute penalty after the VAR controversially decreed there had been a deliberate handball in the Levante penalty area, was enough to give Atletico a typical win against the Valencia-based side in the Wanda Metropolitano Stadium on Sunday.<p> <p> Athletic Club Bilbao striker Inaki Williams hadn't scored a league goal in Athletic's San Mames Stadium in over two years (770 days), but then proved that, like buses, goals never gone one at a time.<p> <p> Williams scored two superb individual goals to give Athletic a 2-0 win at home to Sevilla, a result which dents Sevilla's title hopes and lifts Athletic clear of the relegation zone.<p> <p> Sevilla beat Athletic 3-1 in the Cup on Thursday, but the Basque side hardly allowed Sevilla a shot on goal as they continue their drastic improvement under Gaizka Garitano.<p> <p> Real Madrid coach Santiago Solari switched to a system with three central defenders for his side's visit to Betis and was rewarded with a 2-1 win, which came with a big slice of luck.<p> <p> Former Betis hero Dani Ceballos scored the winning goal two minutes from time with a free kick, which both the defensive wall and Betis keeper Pau Lopez should dealt with. However, Madrid also deserve credit for battling through despite a serve injury crisis which was made worse when Karmin Benzema had to leave the game after dislocating a finger.<p> <p> Luka Modric put Madrid ahead in the first half, but Sergio Canales equalized with 23 minutes left to play as Betis enjoyed 74 percent of the ball, before Ceballos and Pau combined to give Madrid 3 points.<p> <p> Saturday saw Getafe's excellent season continue with a 2-1 win away to struggling Villarreal.<p> <p> Veteran striker Jorge Molina opened the scoring for Getafe, but Villarreal drew level 15 minutes from time with a Leandro Cabrera's own goal.<p> <p> Angel Rodriguez's 89th minute goal sealed the win for Getafe, but not before drama in injury time when Villarreal twice hit the woodwork through Ramiro Funes Mori and Karl Toko Ekambi. The home side were then awarded a penalty only for Ekambi to fire over the bar.<p> <p> Borja Baston's goal early in the second half saw the points shared between Girona and Alaves. Cristhian Stuani's overhead kick put Girona ahead before the break, but in the 50th minute Baston latched onto a deflection to fire home from close range.<p> <p> Valencia's struggles continue after Ruben Alcaraz's brilliant free kick 8 minutes from time gave Valladolid a point in the Mestalla Stadium.<p> <p> Under pressure Valencia coach Marcelino Garcia Toral saw how Rodrigo Moreno missed a penalty before Dani Parejo's 72nd minute penalty looked to have given his side a much-needed win, but Alcaraz's spectacular strike condemned Valencia to their 11th draw of the campaign.<p> <p> Youssef El-Nesyri struck 15 minutes from time to give Leganes a vital home win against bottom of the table Huesca.<p> <p> On Friday Rayo Vallecano made it 3 straight wins with a 4-2 victory at home to Celta Vigo thanks to Raul de Tomas' hat-trick.<p>", "time": "14 Jan 2019, 01:11", "type": "sports"}
{"title": "Maradona released from hospital", "url": "http://www.dailyfinland.fi/sports/8775/Maradona-released-from-hospital", "review": "", "content": "<p>Argentine football great Diego Maradona has been released from hospital after undergoing surgery for internal bleeding, a spokesperson for the 1986 World Cup winner said on Sunday.<p> <p>The operation was scheduled earlier this month after doctors identified the problem during a routine medical check at the Olivos clinic on the outskirts of Argentina's capital Buenos Aires.<p> <p>\"Diego Maradona has just been discharged and is going home to continue his recuperation,\" Maradona's lawyer, Matias Morla, said in a social media post.<p> <p>According to local media, the bleeding was caused by a stomach hernia and was not serious.<p> <p>Maradona, 58, is expected to travel to Mexico within days to resume his work as head coach of Dorados de Sinaloa.<p> <p>The former Boca Juniors, Barcelona and Napoli forward has been beset by health problems since ending his playing career in 1997.<p> <p>In 2004, he was hospitalized with severe heart and respiratory problems related to a long battle with drug addiction. He has also undergone two gastric bypass operations to control his weight and received treatment for alcohol abuse.<p>", "time": "13 Jan 2019, 23:45", "type": "sports"}
{"title": "Ronaldo, Modric headline UEFA Team of the Year 2018", "url": "http://www.dailyfinland.fi/sports/8753/Ronaldo-Modric-headline-UEFA-Team-of-the-Year-2018", "review": "", "content": "<p>Portuguese star Cristiano Ronaldo has been included for a record 13th time in UEFA Team of the Year also featuring his former club teammate Luka Modric, the reigning Best FIFA Men's Player and Ballon d'Or winner.<p> <p>Ronaldo helped his former club Real Madrid to a third consecutive UEFA Champions League title last May.<p> <p>Besides Modric, who received the most votes with 115,440, Sergio Ramos, Raphael Varane and Marcelo are also included in the list, making Real Madrid the team with the most players for a third successive year.<p> <p>In the line-up based on a 4-3-3 formation, Marc-Andre ter Stegen from Barcelona stands in front of goal. The only non-Real Madrid defender in the team is Virgil van Dijk currently playing in Liverpool.<p> <p>The three midfielders are Modric, and Chelsea's star duo of N'Golo Kante and Eden Hazard.<p> <p>Ronaldo stands up in front along with Barcelona's Lionel Messi and Paris Saint-Germain's Kylian Mbappe, the youngest player in the list at the age of 20.<p> <p>Based on players' performances for a European club or national team in UEFA competitions during the 2018 calendar year, the initial shortlist of 50 players was released last December. Almost two million votes were cast by users registered with UEFA's website.<p>", "time": "11 Jan 2019, 23:32", "type": "sports"}
{"title": "China-Finland Year of Winter Sports begins", "url": "http://www.dailyfinland.fi/sports/8750/China-Finland-Year-of-Winter-Sports-begins", "review": "", "content": "<p>The year 2019 was designated as the China Finland Year of Winter Sports at the meeting of the Finnish and Chinese presidents in spring 2017, said a press release issued by the Ministry of Education and Culture.<p> <p>Finland is the first country with which China has agreed on this type of winter sports partnership. The thematic year and the preparations for the 2022 Winter Olympics in Beijing are expected to boost Chinese interest in Finnish winter sports expertise.<p> <p>According to Minister for European Affairs, Culture and Sport Sampo Terho, the thematic year presents excellent opportunities for Finland in terms of both winter sports expertise and the commercial aspects of the industry.<p> <p>“Because Finland is the first country with which China has agreed on this type of winter sports partnership, this gives Finland significant visibility and a competitive advantage compared to other winter sports countries leading up to the 2022 Beijing Olympics and Paralympics. Finland has a great deal of opportunities and a lot to offer, particularly when it comes to coaching, building venues for winter sports, sports technology, manufacturing sports equipment and teaching physical education in schools,” said Terho.<p> <p>The thematic year is focused on four main themes: 1) training and coaching, 2) sustainable development and equality, 3) travel and tourism and 4) competitive and performance sports.<p> <p>Terho will travel to Beijing to attend the opening of the thematic year, which will take place on 15 January 2019. The closing of the thematic year will be held in Rovaniemi in December.<p> <p>The thematic year is made up of more than 60 different events, with highlights including the Chinese New Year celebration in Helsinki in February, the “Women’s Month” of April, when Finland hosts both the Women’s World Ice Hockey Championships and the World Synchronized Skating Championships, and three events – Helsinki Education Week, the SMASH sports technology event and GoExpo Winter – taking place in November. As the “Country of Honour” at the 2019, World Winter Sports Expo in Beijing, Finland will have the opportunity to present its knowhow in various areas of winter sports.<p> <p>In addition to the thematic year, Business Finland has established the Winter Sports Cluster growth programme, which aims to develop cooperation and export opportunities for Finnish businesses with an eye towards the 2022 Winter Olympic and Paralympic games in Beijing.<p> <p>The Finnish and Chinese presidents agreed on the 2019 joint year of winter sports during President Xi Jinping’s state visit to Finland in April 2017.<p> <p>To coordinate the arrangements for the thematic year, Finland and China established a working group in charge of the joint programme during Sampo Terho’s visit to Peking and Harbin in March 2018.<p> <p>The year of winter sports is a joint initiative of various ministries, cities, the Finnish Olympic Committee, the Finnish Paralympic Committee, individual sports associations and sports institutes.<p>", "time": "11 Jan 2019, 03:59", "type": "sports"}
{"title": "Tite to remain Brazil boss until at least 2022", "url": "http://www.dailyfinland.fi/sports/8748/Tite-to-remain-Brazil-boss-until-at-least-2022", "review": "", "content": "<p>Brazil coach Tite will keep his job until at least the 2022 World Cup, regardless of the team's performance as hosts of this year's Copa America, the head of the country's football federation said on Thursday.<p> <p> \"[Tite] has a contract until the World Cup in Qatar in 2022 and he will stay in the job until then,\" federation president Rogerio Caboclo told reporters.<p> <p> Tite, whose real name is Adenor Leonardo Bacchi, replaced Brazil's 1994 World Cup-winning captain Dunga as national coach in 2016 when the team was in disarray.<p> <p> He led the five-time world champions to nine consecutive World Cup qualifying victories, earning the team favorite status before last year's edition of the showpiece tournament in Russia.<p> <p> However, the Selecao failed to hit top form and were eliminated by Belgium in the quarterfinals.<p> <p> Caboclo was speaking during a news conference to mark the start of ticket sales for the Copa America, which will be played in five Brazilian cities from June 14 to July 7.<p> <p> Ticket prices start at 60 reais (around 16 US dollars) for group stage matches and rise as high as 890 reais for the final at Rio's Maracana stadium.<p>", "time": "11 Jan 2019, 03:11", "type": "sports"}
{"title": "Finland beat Sweden in Doha friendly football", "url": "http://www.dailyfinland.fi/sports/8718/Finland-beat-Sweden-in-Doha-friendly-football", "review": "", "content": "<p>Finland beat neighbouring Sweden by a solitary goal in the international friendly soccer match held in Doha, the capital of Qatar on Tuesday.<p> <p>Eero Markkanen scored the goal to ensure the victory for Finland in the match, according to Finnish Football Association report.<p> <p>Meanwhile, the star player of Finland Riku Riski did not participate in the match and refused to join a training camp in Qatar pointing out ethical ground.<p> <p>He declined to join the training camp in Qatar because he is concerned about the human rights record in Qatar, reported National broadcaster Yle.<p> <p>\"I got the call and after that I discussed the issue with the team’s fixer and head coach,\" said the Yle report, quoting a Finnish language daily Helsingin Sanomat as Riski saying.<p> <p>Finland will meet their another neighbouring country Estonia on Friday. The match will be held at 14.00 O’clock Finnish time.<p>", "time": "09 Jan 2019, 14:58", "type": "sports"}
{"title": "Bayern sign France defender Pavard from Stuttgart", "url": "http://www.dailyfinland.fi/sports/8732/Bayern-sign-France-defender-Pavard-from-Stuttgart", "review": "", "content": "<p>Bayern Munich have signed France defender Benjamin Pavard from league rivals Stuttgart, the German record champions confirmed on Wednesday.<p> <p> \"We have signed Benjamin Pavard starting from July 1. He has penned a five-year deal. He is a young player and a World Cup winner. We are very proud that we were able to sign such a player for Bayern,\" sporting director Hasan Salihamidzic said.<p> <p> The 22-year-old centre back joined Stuttgart in August 2016 and made ever since 69 appearances, providing two goals and two assists. Pavard is since 2017 part of France's national team where he marked one goal in 16 caps.<p> <p> Nico Kovac's men sit currently on the second place of the standings. They kick off the second half of the Bundesliga season against Hoffenheim on January 18<p>", "time": "10 Jan 2019, 03:59", "type": "sports"}
{"title": "Salah retains African Footballer of the Year award", "url": "http://www.dailyfinland.fi/sports/8716/Salah-retains-African-Footballer-of-the-Year-award", "review": "", "content": "<p>Egyptian striker Mohamed Salah has been named African Footballer of the Year for the second year in a row.<p> <p> The Confederation of African Football (CAF) announced the result on Tuesday, the same day that it was officially announced that Egypt would replace Cameroon as the host nation of the the 2019 Africa Cup of Nations.<p> <p> 26-year-old Salah said that, as a child, he had dreamed of winning the award, and dedicated it to his country.<p> <p> Last season, Salah scored 44 goals to help Liverpool reach the 2018 Champions League final. The Egyptian has continued his goalscoring form this season with 16 goals from 28 appearances, and currently ranks third in the English Premier League goalscoring charts.<p> <p> Egypt has hosted the Africa Cup of Nations four times. The 2019 tournament will be held from June 15 to July 13, and it will be the first Africa Cup of Nations since the expansion from 16 to 24 teams.<p>", "time": "09 Jan 2019, 13:18", "type": "sports"}
{"title": "I don't always understand VAR: Real coach Solari", "url": "http://www.dailyfinland.fi/sports/8714/I-dont-always-understand-VAR-Real-coach-Solari", "review": "", "content": "<p>Real Madrid coach Santiago Solari on Tuesday asked for the rules regarding the use of the Video Assistant Referee (VAR) system to be clarified in Spain.<p> <p> Solari was speaking two days after his side were not awarded a penalty following a challenge by Real Sociedad goalkeeper, Geronimo Rulli on Vinicius Jr during Madrid's 2-0 home defeat to Real Sociedad on Sunday.<p> <p> Images are unclear whether or not a penalty should have been given, but Solari was annoyed the referee didn't stop the game to look at the images.<p> <p> \"For me, as a spectator, I don't understand the way it (VAR) works on occasions,\" commented Solari in a press conference ahead of Wednesday's Copa del Rey last 16 tie at home to Leganes.<p> <p> The VAR will be used for the first time in the Copa during the round of matches which will be played over the next week and Solari said he was happy to have the system used, but \"it all depends on the rules being clearer than the technology.\"<p> <p> \"They will perfect it,\" he said, adding that he was not complaining about the VAR, but the club was \"defending ourselves, which is our right.\"<p> <p> With Madrid 10 points behind Barca in the Liga Santander, the Copa del Rey perhaps offers their best hopes of a title this season.<p> <p> \"We place the same importance on every competition,\" said Solari, who didn't rule out handing a debut to new signing Brahim Diaz, who arrived on Monday.<p> <p> \"He looks very good and he's happy to be here,\" he commented about the 19-year-old.<p> <p> Finally he refused to discuss photographs which show Gareth Bale (who is currently injured) leaving the Bernabeu 10 minutes before the end of Sunday's defeat. \"We will solve these things in private,\" was all Solari would say.<p>", "time": "09 Jan 2019, 04:08", "type": "sports"}
{"title": "Ice skating ring at Lordi’s attracts amateur skaters", "url": "http://www.dailyfinland.fi/sports/8700/Ice-skating-ring-at-Lordis-attracts-amateur-skaters", "review": "", "content": "<p>The ice skating ring built at the Lordi’s square in Rovaniemi city centre has created an opportunity for ice skaters, whether expert or amateur.<p> <p>The skating ring attracts people, especially tourists and mostly amateur to practise skating.<p> <p>A spot visit found a significant number of tourists from home and abroad enjoying the ice skating in the ring.<p> <p>A Japanese couple, Yusuke Shimoura and Takako Shimoura, along with their five-year-old daughter Soma Shimoura, were found practising skating in the ring. The couple both of whom are schoolteachers told Daily Finland that they could do ice skating, although their child had no experience.<p> <p> Eskelinen said that people could take their won equipment to use the skating ring free. “Some local people also use it. But most of the people doing ice skating at Lordi’s Square are tourists,” he said.<p> <p>He also said that there are a number of ice skating rings in Rovaniemi, offering many options to choose from. <p> <p>“So I think we have enough rings to do ice skating, but a track on the river or on the Kirkkolampi would be great — a longer one, where the track is made simply by clearing a path from the snow,” he added.<p>", "time": "08 Jan 2019, 13:45", "type": "sports"}
{"title": "Kroos injury adds to Solari's problems at Real Madrid", "url": "http://www.dailyfinland.fi/sports/8695/Kroos-injury-adds-to-Solaris-problems-at-Real-Madrid", "review": "", "content": "<p>Real Madrid's injury crisis deepened on Monday with the confirmation that they will be without German international midfielder Tony Kroos for the rest of the month.<p> <p> The club confirmed on its official website that Kroos has suffered a 'Grade 2' strain on the left side of his groin. Although the club say his return \"depends on how the injury evolves\", that kind of injury usually sidelines a player for at least 3 weeks.<p> <p> Kroos will miss his side's two Copa del Rey games against Leganes, as well as next weekend's difficult Liga Santander game away to Betis, further league matches against Sevilla and Espanyol and the quarter-final games in the Cup if Madrid get past Leganes.<p> <p> The German picked up his injury during Sunday's 2-0 defeat at home to Real Sociedad which leaves Real Madrid fifth in the league standings, 10 points behind leaders FC Barcelona. Santiago Solari needs better results to keep his job.<p> <p> However, with Kroos joining Gareth Bale, Marcos Llorente and Marco Asensio on the injury list, Solari is running out of options.<p>", "time": "08 Jan 2019, 00:54", "type": "sports"}
