{"title": "Foreign tourist inflow remains unchanged in November", "url": "http://www.dailyfinland.fi/travel/8792/Foreign-tourist-inflow-remains-unchanged-in-November", "review": "", "content": "<p>The number of nights spent by foreign tourists in Finland remained on level with 2017 in November 2018, according to Statistics Finland.<p> <p>About 435,000 overnight stays were recorded at Finnish accommodation establishments, which was only 0.4 per cent more than one year before.<p> <p>The number of nights spent by resident tourists went up by 2.0 per cent and totalled good one million at accommodation establishments.<p> <p>A total of nearly 1.5 million overnight stays were recorded at Finnish accommodation establishments, which was 1.5 per cent more than in November 2017.<p> <p>Russia, Sweden and Germany have varied their order in the top monthly in 2018, but have clearly stood out from other countries.<p> <p>In November, visitors from Great Britain beat the Swedes and came third. Russians were, however, by far the largest group of foreign tourists with 60,500 overnight stays. Their overnight stays at accommodation establishments increased by 1.1 per cent from the year before.<p> <p>Germans came second and a total of nearly 34,000 overnight stays at Finnish accommodation establishments were recorded for them. The figure was 4.5 per cent higher than one year previously. British and Swedish visitors came next with around 33,000 overnight stays each. Overnight stays of British visitors increased by 13.7 per cent whereas those of Swedish visitors decreased by 5.9 per cent from the previous year.<p> <p>Finnish accommodation establishments recorded close on 21,000 overnight stays for Chinese visitors and good 18,000 overnight stays for Japanese visitors.<p> <p>Overnight stays by Chinese tourists increased by as much as 33.0 per cent and those by Japanese visitors by 18.6 per cent from November 2017. In addition to Japanese visitors, visitors from the United States and Estonia reached around 18,000 overnight stays. Overnight stays by visitors from the United States increased by 13.5 per cent, while overnight stays by Estonian visitors decreased by 2.5 per cent compared to November 2017.<p> <p>The biggest decreases in overnight stays among the most important countries of inbound tourism to Finland came from the Netherlands and Switzerland in November 2018. Overnight stays by visitors from the Netherlands decreased by 14.5 per cent and overnight stays by visitors from Switzerland by 12.3 per cent compared to November of the previous year. Overnight stays recorded for Dutch visitors at accommodation establishments numbered close on 9,000, while overnight stays by Swiss tourists stood at just under 7,000.<p>", "time": "14 Jan 2019, 04:13", "type": "travel"}
{"title": "Lufthansa becomes biggest airline in Europe in 2018", "url": "http://www.dailyfinland.fi/travel/8741/Lufthansa-becomes-biggest-airline-in-Europe-in-2018", "review": "", "content": "<p>Carrying 142 million passengers in 2018, the Lufthansa Group has set a new record and become the biggest airline in Europe, the company announced on Thursday.<p> <p> The German airline was temporarily pushed from the throne as Europe's biggest airline by Ryanair in 2016.<p> <p> In 2018, the airlines of the Lufthansa Group operated more than 1.2 million flights and achieved a seat load factor above 80 percent.<p> <p> The biggest drivers of growth for Lufthansa's airlines were the Zurich, Munich and Vienna hubs, where the number of passengers grew by 9.5 percent, 9.3 percent and 8.5 percent respectively.<p> <p> The number of Lufthansa passengers at Germany's biggest airport Frankfurt grew by 4.7 percent in 2018. Eurowings, a subsidiary of the Lufthansa Group, significantly contributed to the passenger record with a growth of 18 percent.<p> <p> In 2018, the Eurowings Group carried a total of around 38.5 million passengers, representing around 27 percent of the total number of Lufthansa Group's passengers.<p>", "time": "11 Jan 2019, 00:16", "type": "travel"}
{"title": "Savonlinna airport cancels flights operation", "url": "http://www.dailyfinland.fi/travel/8697/Savonlinna-airport-cancels-flights-operation", "review": "", "content": "<p>The flights operation between Savonlinna and Helsinki were cancelled on Monday as well as the morning flights on Tuesday.<p> <p>The flights operation remained cancelled after Airlink's plane landed out of the Savonlinna airport's runway in early morning of Monday, said a press release issued by Finavia.<p> <p>It was on a positioning flight and thus there was only the members of the crew on the plane. No injuries were happened.<p> <p>The flights from Savonlinna to Helsinki at 6:00 am and from Helsinki to Savonlinna at 8:00 am are cancelled first. Later in the afternoon it was informed that also the evening flights of Monday and morning flights of Tuesday are also cancelled.<p> <p>The airport authority asked the passengers to follow Airlink's information concerning the evening flights.<p>", "time": "08 Jan 2019, 02:18", "type": "travel"}
{"title": "Dense fog disrupts flight operation at Helsinki Airport", "url": "http://www.dailyfinland.fi/travel/8654/Dense-fog-disrupts-flight-operation-at-Helsinki-Airport", "review": "", "content": "<p>Dense fog disrupted flight operation at Helsinki Airport on Friday, said a press release issued by Finavia, the company operates country´s airports. Due to fog, air traffic control restricted both the arriving and departing air traffic. The disruption began in the morning and continued till afternoon due to foggy weather and restrictions set by air traffic control. Passengers were asked to follow flight information provided by their airlines and Real time information on arrivals and departures is available also at Finavia's website. <p>", "time": "05 Jan 2019, 03:21", "type": "travel"}
{"title": "Rovaniemi keeps tourists charmed with nature, beauty", "url": "http://www.dailyfinland.fi/travel/8626/Rovaniemi-keeps-tourists-charmed-with-nature-beauty", "review": "", "content": "<p>Rovaniemi is a city that boasts of the uniqueness of its nature in all entirety.<p> <p>Rovaniemi is highly naturally endowed with forests, rivers and even the sky. This display of view is what makes the city a must visit for every adventure-seeker.<p> <p>The city of Rovaniemi usually wears a new look during the winter season. People from different countries are found either walking individually or in groups. Everyone seems to have a feel of the magical moments that come with the cool breeze of snow. The forest has all its green turning white while the rivers loses their waves by turning into ice.<p> <p>The Daily Finland spoke to a few tourists in Rovaniemi to know of their impression and expectations. They all mostly expressed satisfaction when they narrated their experiences.<p> <p>All the tourists have different expectations as their nationalities and needs differ. But despite all their different adventure needs, the magical home of Santa has a way of satisfying tourist’s needs and gives them the reason to ask for more.<p> <p>French national Vincent<p> <p>Vincent, a 47-year-old French citizen, was full of enthusiasm when he expressed his experience on arriving in Rovaniemi for the first time. He was quick to complain about the cold weather but the beauty of the city overshadowed the cold he felt. He, however, showed his love for the brightness of the Rovaniemi weather and promised to recommend that his friends visit the city.<p> <p>Thai tourist Pearl<p> <p>Another tourist, Pearl from Thailand, however, said that one of the things that brought her to Rovaniemi is the Aurora Borealis and all different kinds of activities that come with the winter season in Rovaniemi. She came to Rovaniemi for the first time and despite the weather being entirely different from her hometown which is usually three degrees Celsius, she was satisfied with what she experienced in the city during her short stay and wouldn’t mind recommending the town to her friends and family. Although she has not yet fulfilled her dream of sighting the Aurora, she hoped to see it since she has only spent two days out of the two weeks’ vacation.<p> <p>Felipe and Matta from Brazil<p> <p>The adventure was the same with the two Brazilian young lovers, Felipe and Matta. The two are in their late twenties and have been visiting Rovaniemi regularly for more than five years. They said that the feel of the Santa Claus village, reindeer ride, forest walk under the guise of the northern light and ice fishing were the adventure activities that attracted them to the city. “Despite having been here for more than once, we are yet to have enough.’ They were overjoyed every moment by their stay and promised to visit the city again next year with their friends.<p> <p>Japanese tourist Nikita<p> <p>The most intrigued experience was revealed by 25-year-old Nikita from Japan. “I broke my fingernail in my first visit while skiing.” Breaking the finger was painful, “yet I could not stop coming to Rovaniemi during my vacation. My expectations have been met. The place I like most to walk around is the Santa Claus office and to listen to his stories. I usually miss eating rice porridge and it’s the only meal I crave for on arriving at the city.”<p>", "time": "02 Jan 2019, 21:27", "type": "travel"}
{"title": "New Rail Transport Act enters into force on January 1", "url": "http://www.dailyfinland.fi/travel/8597/New-Rail-Transport-Act-enters-into-force-on-January-1", "review": "", "content": "<p>The Rail Transport Act will enter into force on January 1, 2019 with the exception of the provisions concerning railway safety and interoperability of the rail system, which will become applicable on June 16.<p> <p>The President approved a new Rail Transport Act last week, said an official press release.<p> <p>The comprehensive reform of the legislation governing rail transport aims to improve the functioning of the rail market, while it also implements the Fourth Railway Package of the European Union in Finland.<p> <p>The new Act will replace the current Railway Act and the Urban Railway Traffic Act.<p> <p>Minister of Transport and Communications Anne Berner said that the new Act will create a favourable environment for the development of rail transport.<p> <p>\"The objective of this comprehensive legislative reform is to make rail transport a more attractive option and increase the number of rail passengers. This is absolutely necessary, for example in order to reach the emission reduction targets set for transport,\" said Berner.<p> <p>The Rail Transport Act laid down provisions that guarantee equal access to the railway infrastructure for operators of domestic passenger transport. This means that all rail undertakings will in future have equal opportunities to be allocated railway infrastructure capacity for the purposes of operating domestic passenger transport and access to the railway infrastructure accordingly.<p> <p>National provisions on equal access to the railway infrastructure for the purposes of rail freight services and international passenger transport services by rail within the EU have been enacted already earlier, as required by Union law. <p> <p>As of December 2023 at the latest, the competent authority must open up new contracts imposing a public service obligation in rail passenger transport to competition instead of direct award of contracts. The provisions allow certain exemptions. Contracts imposing a public service obligation that have been concluded before 3 December 2019 may continue to apply until they have been agreed upon. <p> <p>In future, railway undertakings may apply for a single safety certificate and a vehicle authorisation for placing on the market either at the Finnish Transport and Communications Agency or at the European Union Agency for Railways, if the certificate and authorisation are applied for transport taking place in the Finnish railway network only. However, for transport taking place in the area of several Member States, these certificates and authorisations must be applied for at the EU Agency.<p> <p>Managers of private railway infrastructures may choose to follow a lighter notification procedure instead of applying for a safety certificate under EU law. Furthermore, vehicles operated in private railway infrastructures can be placed in service under an authorisation for placing in service, which is a lighter procedure than the procedure under the EU law.<p> <p>VR Group Ltd and managers of railway lines connecting to seaports must, however, continue to apply for a safety certificate at the Finnish Transport and Communications Agency also in future, because the European Commission has considered private railway infrastructures managed by these to be of strategic importance in Finland.<p> <p>The Act also contains an obligation concerning positioning. Location data may be needed for example in traffic control to ensure smooth and safe traffic.<p>", "time": "31 Dec 2018, 02:48", "type": "travel"}
{"title": "Border Guards prepare for seasonal tourists from Russia", "url": "http://www.dailyfinland.fi/travel/8558/Border-Guards-prepare-for-seasonal-tourists-from-Russia", "review": "", "content": "<p>Border Guards in southeast Finland are taking preparations for influx of huge tourists from Russia on the occasion of the New Year.<p> <p>The influx of tourists on the eve of New Year has been traditionally one of the busiest seasons for the border check post in the region, reported National broadcaster Yle.<p> <p>More than 38,000 boarder crossings were recorded by southeastern Border Guards in one day, said the Yle report quoting official sources.<p> <p>The Border Guard officials are also expecting increased number of Russian tourists during the during the weekend as the Russian tourists visit Finland for vacations and post-Christmas sales.<p> <p>The busiest period for the seasonal border crossings is expected to be the first weekend in January, when Russian tourists pour into Finland and the second week in January, when visitors return home, the Yle report added.<p>", "time": "28 Dec 2018, 02:42", "type": "travel"}
{"title": "Tourism in Rovaniemi booms in October", "url": "http://www.dailyfinland.fi/travel/8459/Tourism-in-Rovaniemi-booms-in-October", "review": "", "content": "<p>The number of overnight stays by tourists at the accommodation facilities in Rovaniemi rose as much as 22.7 per cent in October 2018 from that in October 2017, according to Visit Rovaniemi.<p> <p>A total of 38,500 overnight stays were registered in the month in Rovaniemi, of which Finns accounted for 19,500, showing a three per cent hike, and foreign residents 19,000, posting a 52 per cent hike year on year.<p> <p>Among the international tourists, Japanese made the highest number of 2,500 overnight stays, followed by USA 2,400, China 1,800, Belgium 1,300, Germany 970, Russia 900, Norway and UK 740 each, Australia 680, and Sweden 570. Overnight stays by tourists of all these countries marked a year-on-year increase in October, except a 16.9 per cent decline posted by visitors from China.<p> <p>According to Visit Rovaniemi sources, in October 2017, a total of 31,400 overnight stays by tourists were registered in Rovaniemi, of which Finns accounted for 18,900, registering a 17 per cent rise, and foreign tourists 12,500, showing a 29 per cent rise year on year. In October 2016, the number of overnight stays by tourists in Rovaniemi was recorded at 25,700, including 16,000 by Finnish tourists and 9,700 by foreign tourists, the Visit Rovaniemi sources said.<p> <p>A total of 476,000 overnight stays in Rovaniemi were recorded in January to October 2018, which is 2.9 per cent more than that in the same period of last year. <p> <p>“The reason behind the remarkable increase in October overnight stays is the big meetings and conferences like Arctic Biodiversity Congress, Arctic Environment Ministers’ Meet and the Meeting of Senior Arctic Officials (SAO) held in Rovaniemi,” said Visit Rovaniemi Managing Director Sanna Kärkkäinen.<p> <p>Rovaniemi Congresses Manager Juhani Sallanmaa of Visit Rovaniemi said about 450 people took part in the Arctic Biodiversity Congress 2018 organised by the Ministry of the Environment &amp; CAFF (Conservation of Arctic Flora and Fauna) as a part of the programmes under the Finnish presidency of the Arctic Council which had a positive impact on the overnight stays by tourists in October.<p> <p>About 200 people took part in the conference of Arctic Council foreign ministers and the meetings of the Sustainable Development Working Group (SDWG) and the Senior Arctic Officials (SAO) which, too, contributed a lot towards the increase in overnight stays.<p> <p>“Both the congress and the meetings (ABC2018-week and SDWG/SAO-week) lasted for five days each. The meeting days as well as those of preparations boosted the number of overnight stays,” Sallanmaa pointed out.<p> <p>Kärkkäinen said she expects a further growth in the number of tourists in Rovaniemi in the upcoming winter. “We are expecting a five to 10 per cent growth in the number of tourists in the winter season this year.”<p> <p>She also detailed out various cooperation between Visit Rovaniemi and different companies to increase the attraction of Rovaniemi as a tourist destination. “We have cooperation with more than 215 companies to attract more tourists. We have a number of ongoing programmes,” said Kärkkäinen, adding that although there are not many new things, all the programmes are different and related to the Lappish culture and lifestyle.<p>", "time": "20 Dec 2018, 01:38", "type": "travel"}
{"title": "Turku-London direct flight opens next year", "url": "http://www.dailyfinland.fi/travel/8432/Turku-London-direct-flight-opens-next-year", "review": "", "content": "<p>Wizz Air will launch a route from Turku Airport to Luton Airport, London from 2 July 2019.<p> <p>Operated with Airbus 320-200 aircraft, the route will be the first direct one from Turku to London. It will be operated three times a week – on Tuesdays, Thursdays and Saturdays, said a Finavia press release.<p> <p>“We have had new route openings this year with Wizz Air and we are delighted to deepen our cooperation. Direct route to London extends the network from Turku considerably and serves both business and leisure travellers,” said Finavia Senior Vice President of Airport Network Jani Jolkkonen.<p> <p>The route is very important for Turku from the point of view of tourism. London and other new route openings are expected to boost tourism in Turku. Turku Airport provides a smooth customer experience and interesting destinations at a competitive price.<p> <p>“This is fantastic news for Turku and we are very happy about it. Turku is actively developing the economic growth in the southwest Finland and the direct route between London and Turku serves the needs of the entire business sector in the region. We are sure that it interests and benefits both the existing companies and companies that are seeking growth in the Turku region,” said Turku Mayor Minna Arve.<p> <p>Wizz Air launched a new route from Turku to Kaunas, Lithuania, on 9 November. The route is operated twice a week – on Mondays and Fridays.<p> <p>Moreover, in May 2019, Wizz Air will launch a new route to Krakow, Poland. The route will be operated twice a week – on Wednesdays and Sundays. The inaugural flight to Krakow will be on the first of May 2019 and the tickets are now on sale.<p>", "time": "18 Dec 2018, 04:07", "type": "travel"}
{"title": "Helsinki Airport-bound buses to touch only T2", "url": "http://www.dailyfinland.fi/travel/8398/Helsinki-Airport-bound-buses-to-touch-only-T2", "review": "", "content": "<p>All the buses of Helsinki Regional Transport Authority (HSL) bound for Helsinki Airport will drop off and pick up passengers only in front of the terminal 2 (T2) from Monday, said a press release issued by Finavia, the country’s airport operator.<p> <p>The buses will not touch the terminal 1 (T1) due to the construction and renovation work being carried out under the Helsinki Airport development programme.<p> <p>The change affects all HSL bus routes to the airport, meaning routes 415, 415N, 561, 562N, 615, and 617.<p> <p>Passengers can access terminal 1 from the bus stop at terminal 2 via a corridor connecting the two terminals. It is no longer possible to walk outside between T1 and T2.<p> <p>Finavia’s shuttle bus runs every 15 minutes from 3:30am to 1:30am. The bus also runs the entire night between Saturday and Sunday.<p> <p>The shuttle bus enables passengers to travel from one terminal to the other and its stops are located on platform 10 at terminal 1 and platform 21 at terminal 2.<p>", "time": "16 Dec 2018, 02:42", "type": "travel"}
{"title": "Policies taken to make walking, cycling safer in winter", "url": "http://www.dailyfinland.fi/travel/8383/Policies-taken-to-make-walking-cycling-safer-in-winter", "review": "", "content": "<p>A new winter maintenance policies, to be implemented in 2019, aim to take into account abnormal weather conditions in the maintenance of walking and cycling routes more effectively and with higher quality results.<p> <p>The policies taken by the Finnish Transport Agency and ELY centre for winter maintenance seek to promote walking and cycling in winter, said a press release issued by Finnish Transport Agency.<p> <p>High-quality maintenance of walking and cycling routes increases the safety in winter.<p> <p>It is now possible to offer, in cooperation with city governments, a higher service level for busy pedestrian and cycling routes through the use of “quality corridors”.<p> <p>With quality corridors, efforts are made to implement a standardised level of winter maintenance regardless of the party responsible for the maintenance of the road.<p> <p>On these travel routes, a high service level is recommended; one which promotes walking and cycling as a means of travel and which also facilitates the use of prams, wheelchairs and Zimmer frames.<p> <p>The objective is that, at a regional level, these quality corridors will form a coherent network which would provide an excellent service to those cycling to work, as well as many others. Quality corridors have already been either initiated or completed in a number of cities, including Oulu, Jyväskylä, Tampere, Kuopio, Helsinki and Vantaa.<p> <p>In abnormal weather conditions, the safety and reasonable functionality of traffic routes is ensured first of all for the most central routes. The most important methods for this are clearly agreed procedures and careful advance planning, as well as the use of all the road maintenance equipment available.<p> <p>Information systems are actively developed. Cooperation with road weather operators and contractors is being strengthened so that even more precise weather and road condition forecast data will be available. Quality assurance is also being strengthened using digital technologies.<p> <p>Regular dialogue with contractors, city governments, municipalities, ELY centres, and other stakeholder groups aims towards the identification of changing customer needs.<p> <p> <p>", "time": "15 Dec 2018, 03:03", "type": "travel"}
{"title": "Rovaniemi-Istanbul route to open in Dec 2019", "url": "http://www.dailyfinland.fi/travel/8333/Rovaniemi-Istanbul-route-to-open-in-Dec-2019", "review": "", "content": "<p>Turkish Airlines will start operating a direct flight from Istanbul to Rovaniemi from December next year for the season 2019-2020.<p> <p>The first flight will depart from Istanbul on 5 December 2019, said a Finavia press release.<p> <p>The route will be operated three times a week on Tuesdays, Thursdays, and Sundays. Turkish Airlines will be the first airline to offer seats on business class to Rovaniemi.<p> <p>“We at Finavia are very delighted to welcome Turkish Airlines to Rovaniemi next year and opening the historic scheduled route. We strongly believe in Lapland airports’ future and the new Istanbul connection enables the further growth of Lapland’s tourism industry and increases Finland’s accessibility and competitiveness. The Rovaniemi Airport expansion project will be completed perfectly by the Christmas season of 2019 and the new Istanbul route,” said Finavia Senior Vice President Jani Jolkkonen.<p> <p>The flights will be available for both travel companies and individual travellers.<p>", "time": "12 Dec 2018, 04:41", "type": "travel"}
