{"title": "Fog, snowfall likely to delay flight operation at Helsinki", "url": "http://www.dailyfinland.fi/weather/8709/Fog-snowfall-likely-to-delay-flight-operation-at-Helsinki", "review": "", "content": "<p>According to the forecasts there will be heavy snow fall on the Wednesday morning and the passengers are asked to pay attention to any potential effects on air traffic, said a Finavia press release.<p> <p>Finavia’s maintenance team at Helsinki Airport is fully prepared and ready to keep the runways clear of snow.<p> <p>According to the weather forecast, winds are favourable. So it is believed that air traffic will operate rather smoothly regardless of snowfall.<p> <p>However, if freezing fog (freezing drizzle) appears, airplane engines must be defrosted between the flights. In this case, the de-icing operations will be busy, since de-icing must be done in two stages. This would cause delays.<p> <p>In winter, weather conditions around zero degrees are challenging for airlines and other airport operators because of the changes between freezing and warming temperatures.<p> <p>In Finland, the winter “snow-how” is shipshape and Finavia is used to run its airports even under extreme conditions. Sometimes , there will be some delays in order to ensure safe flying.<p> <p>The authority apologise for any inconvenience, if this happens.<p>", "time": "09 Jan 2019, 03:33", "type": "weather"}
{"title": "Country experiences warmer, dryer weather in 2018", "url": "http://www.dailyfinland.fi/weather/8666/Country-experiences-warmer-dryer-weather-in-2018", "review": "", "content": "<p>The country experienced warm and dry weather in the outgoing year 2018, according to Finnish Meteorological Institute (FMI).<p> <p>According to the figures of FMI, the year 2018 was 1 to 2 degrees warmer than usual. On the basis of statistics covering over 100 years, such a warm year occurs on average once every 10 to 15 years, said a press release.<p> <p>However, with climate change, equally warm or warmer years have occurred frequently in recent years: 2011, 2013, 2014 and 2015. <p> <p>\"Finland's average temperature has been assessed since the middle of the 19th century, for more than 150 years. Half of the warmest ten summers are from the current decade\", said Meteorologist Pauli Jokinen. <p> <p>In the summer, the long-standing warmth led to a record high thermal time sum of the growing season. Thermal time sum accumulates during days when permanent snow has melted and the average temperature for the day is above +5 degrees. <p> <p>Total thermal time sum accumulated at Artukainen, Turku was 1974 °Cd. The previous record was 1852 °Cd measured in Kumpula, Helsinki in 2011. <p> <p>The highest temperature of the year, 33.7°C, was recorded in Klemettilä, Vaasa, on July 18. The lowest temperature of the year was minus 37.1°C, recorded in Kevojärvi, Utsjoki on February 4.<p> <p>Particularly in the area from the western part of the country to Sea Lapland, the annual rainfall was exceptionally low, occurring less frequently than once in 30 years. <p> <p>Various observation stations measured record low rainfall as a result of the dry summer. <p> <p>For example, in Merikarvia's Tuorila it only rained 425.5 mm, while the typical precipitation is 683 mm. In Merikarvia, 2018 was the driest year in the 50 years of measurement history. In many drier areas, rainfall remained at about 400 mm, which is only two thirds of the ordinary. Northern Lapland and eastern parts of the country measured precipitation levels closest to the typical rainfall. <p> <p>The average temperature for the month of December was 1 to 4 degrees higher than usual. The greatest thermal deviation was measured in the north, the smallest in the south. On average, such a mild December is repeated every few years. <p> <p>December's lowest temperature was minus 30.2°C, recorded in Tähtelä, Sodankylä, on December 23. <p> <p>The highest temperature, 7.2°, was recorded in Kökar and Utö on December 4. <p> <p>Rainfall in December remained lower than usual in large parts of Finland, and in the central parts of the country, it was approximately half of the long-term average in places. However, Central Lapland had clearly more rain than usual. <p> <p>The highest level of precipitation, 80.6 mm, was measured in Kemiö, Kemiönsaari, and the lowest, 12.3 mm, in Kilpisjärvi. Low December level of precipitation in the central parts of the country and high rainfall in Central Lapland typically recur every 5 to 10 years. <p> <p>At the end of the month, the eastern and northern parts of the country had 20 to 30 cm snow, while the western part of the country had mostly 0 to 10 cm. In the whole country, there was less snow than usual in December, and in some parts of Lapland, exceptionally little.<p> <p> <p>", "time": "06 Jan 2019, 00:02", "type": "weather"}
{"title": "Power outage remains in parts of Äaland after storm", "url": "http://www.dailyfinland.fi/weather/8632/Power-outage-remains-in-parts-of-Äaland-after-storm", "review": "", "content": "<p>The Finnish autonomous region Äaland islands, off the southwestern coast of the country, continued suffering on Thursday from power outage as the impact of the severe storm.<p> <p>Although electricity was restored in the provincial capital Mariehamn, all rural parts of the province remained without electricity as of mid-Thursday.<p> <p>Municipal centers and shopping malls have been opened to the local residents, whose home are too cold, for overnight stay.<p> <p>Provincial police chief Maria Hoikkala said many seniors live alone in Äaland. The police had checked their situation and helped inhabitants to switch to warm facilities, she said.<p> <p>\"Here we see how vulnerable modern society is, when electricity is off,\" Hoikkala told national broadcaster Yle.<p> <p>Lennart Johansson, the provincial head of rescue services, told newspaper Nya Aland on Thursday that the damage to the island's electricity and communications networks were more serious than initially estimated. The province was receiving electricians from the mainland on Thursday.<p> <p>Besides the Helsinki region, Äaland belongs to the most affluent areas in Finland in terms of personal income. The rural areas are highly dependent on household electricity.<p>", "time": "03 Jan 2019, 19:45", "type": "weather"}
{"title": "Finland measures record strong wind", "url": "http://www.dailyfinland.fi/weather/8624/Finland-measures-record-strong-wind", "review": "", "content": "<p>Record strong winds hit Finland early Wednesday, with the highest wind speed of 32.5 meters per second ever seen in the country measured on the island of Kokar in Äaland.<p> <p>According to national broadcaster Yle, Kokar even measured gust at speed of 41 meters per second.<p> <p>Police in the Äaland islands have advised local residents to stay indoors to keep safe.<p> <p>Strong winds have blacked out parts of the island, leaving nearly half of the 30,000 households without electricity, reported the newspaper Nya Äland.<p> <p>It also said the local public broadcaster Älands radio was disabled. Until late this morning, the radio can only be accessed through internet.<p> <p>The Äaland islands are located in the Baltic between Finnish mainland and Sweden.<p> <p>High waves of 7.9 meters were registered amid strong winds. But it remained less than the highest ever 8.2 meters.<p> <p>The large passenger liners between Finland and Sweden were sailing on schedule with skipped port calls on the Äaland islands.<p> <p>The three leading Finnish mobile operators also reported problems in their networks.<p> <p>In mainland Finland, 85,000 households were out of electricity. Road traffic suffered from heavy snowfall, but no major accidents were reported.<p> <p>Fallen trees caused the closure of railroad track both in eastern and western Finland. There were no major delays in air traffic.<p>", "time": "02 Jan 2019, 19:25", "type": "weather"}
{"title": "Heavy storm disrupts sea, land transport", "url": "http://www.dailyfinland.fi/weather/8617/Heavy-storm-disrupts-sea-land-transport", "review": "", "content": "<p>High winds caused damage and hampered transit in Finland on Tuesday evening, with conditions predicted to worsen overnight and on Wednesday.<p> <p>It was reported that the wind speed reached 27 meters per second. The Finnish Meteorological Institute predicted waves reaching the height of seven meters in the northern Baltic, reported a Finnish language newspaper Helsingin Sanomat.<p> <p>Cruise ship operator Viking Line said some of its crossings between the Äaland islands and Sweden would be cancelled. Viking and another cruise ship operator Tallink said the rest of ships would depart on schedule, but may skip calling on the Äaland islands. Passengers were told to prepare for being seasick.<p> <p>On land, a bus capsized in Ypaja, southwestern Finland. All 18 passengers got out, some with slight injuries.<p> <p>On the eastern north-south railroad track, a long haul train ran into trees that had fallen on the rail on Tuesday evening. Train service was suspended until Wednesday morning at least.<p> <p>Some 40,000 households were without electricity late Tuesday, HS reported.<p>", "time": "02 Jan 2019, 01:09", "type": "weather"}
{"title": "Stormy weather likely to affect New Year´s fireworks", "url": "http://www.dailyfinland.fi/weather/8594/Stormy-weather-likely-to-affect-New-Year´s-fireworks", "review": "", "content": "<p>The New Year´s fireworks likely to be affected by stormy weather, reported national broadcaster Yle quoting Finnish Meteorological Institute.<p> <p>Strong winds blowing on New Year's Eve in the west coast may affect the shooting of fireworks, said the north Ostrobothnia rescue department.<p> <p>In the west coast the winds may even exceed storm reading, according to the forecast. On New Year's Eve, wind speed may exceed over 20 metre per second in the Ostrobothnia sea areas.<p> <p>Strong winds and snow showers is also forecast in Southwest Finland.<p> <p>The rescue departments of Ostrobothnia and Southwest Finland are monitoring the situation closely and may issue warnings on Monday morning.<p> <p>Due to strong winds, fireworks should be handled with extra care since they might head another direction unexpectedly.<p>", "time": "31 Dec 2018, 02:22", "type": "weather"}
{"title": "Windy, rainy weather forecast during New Year celebration", "url": "http://www.dailyfinland.fi/weather/8570/Windy-rainy-weather-forecast-during-New-Year-celebration", "review": "", "content": "<p>The turn of the year in most parts of the country will be celebrated in rainy and windy conditions, reported Finnish language daily Savon Sanomat quoting Finnish Meteorological Institute.<p> <p>During the turn the of the year, the temperature in the southern and western parts of the country will range between zero and minus five degrees Celsius, and between minus five and minus 10 degrees Celsius in the eastern and northern parts of the country.<p> <p>On New Year's Day, low pressure will move towards southeast, and the road conditions may be poor in the southern and central parts of the country.<p> <p>Following the low pressure episode, chilly northeast winds will take hold, and the temperature will drop intensively.<p>", "time": "29 Dec 2018, 01:12", "type": "weather"}
{"title": "Study tells whether colder temperatures affect lifespan", "url": "http://www.dailyfinland.fi/weather/8561/Study-tells-whether-colder-temperatures-affect-lifespan", "review": "", "content": "<p>While many believe that animal species live longer at lower temperatures than they do at higher temperatures, a study from the University of Chicago (UChicago) indicates that the extent to which temperature affects lifespan depends on an individual's genes.<p> <p> The study was conducted in the rotifer, a tiny animal that the researchers have been developing as a modern model system for aging research. The researchers exposed 11 genetically distinct strains of Brachionus rotifers to low temperature, with the hypothesis that if the mechanism of lifespan extension is purely a thermodynamic response, all strains should have a similar lifespan increase.<p> <p> Nevertheless, the median lifespan increase ranged from 6 percent to 100 percent across the strains, the researchers found. They also observed differences in mortality rate.<p> <p> The results show that the change in lifespan under low temperature is likely actively controlled by specific genes. \"This means we really need to pay more attention to genetic variability in thinking about responses to aging therapies,\" said Kristin E Gribble of Marine Biological Laboratory at UChicago. \"That is going to be really important when we try to move some of these therapies into humans.\"<p> <p> The study clarifies the role of temperature in the free-radical theory of aging. The theory, which has dominated the field since the 1950s, proposes that animals age due to the accumulation of cellular damage from reactive oxidative species (ROS), a form of oxygen that is generated by normal metabolic processes.<p> <p> The study has been published in Experimental Gerentology.<p>", "time": "28 Dec 2018, 03:03", "type": "weather"}
{"title": "CO2 emission in energy sector ups 4% in Jan-Sep", "url": "http://www.dailyfinland.fi/weather/8517/CO2-emission-in-energy-sector-ups-4-in-Jan-Sep", "review": "", "content": "<p>The total energy consumption in the country in the January to September period amounted to 997 million terajoule or one per cent more than that in the corresponding period of last year, according to the Statistics Finland.<p> <p>Electricity consumption amounted to 64 terawatt hours, which is three per cent more than that one year earlier. The use of peat increased clearly, which was the main reason for the four per cent growth in carbon dioxide emissions in the energy sector.<p> <p>The consumption of peat grew in January to September by 30 per cent compared with that in the corresponding period of last year.<p> <p>Examined in the longer term, the consumption of peat has, however, been on the decline and this year the consumption increased especially as a result of the cold weather in the early part of the year. Carbon dioxide emissions also increased as the consumption of natural gas started to rise after having fallen for seven years. The consumption of wood fuels went down by five per cent and that of coal by two per cent.<p> <p>The growth in the consumption of electricity was caused by the cold weather as well as the improved economic situation of industry. The production of condensing power, which has been falling in several successive years, grew by 51 per cent in this year’s January to September. Solar and wind power also continued growing strongly. Net imports of electricity decreased four per cent, which was mostly due to increased exports to Estonia.<p> <p>In January to September, diverse energy products were imported into Finland to the value of EUR 7.9 billion, which was 23 per cent more than that one year earlier. Most energy products were imported from Russia, whose share of the value of imports was 63 per cent. Energy products were exported to the value of EUR 4 billion, which was 15 per cent more than that one year previously. Most energy products were exported from Finland to EU countries, which accounted for 80 per cent of the value of exports.<p>", "time": "23 Dec 2018, 02:27", "type": "weather"}
{"title": "Country experiences mild, dry November", "url": "http://www.dailyfinland.fi/weather/8334/Country-experiences-mild-dry-November", "review": "", "content": "<p>A mild November brought an end to a mild autumn. In mid-November there was exceptionally little snow, according to the Finnish Meteorological Institute.<p> <p>November was milder than normal throughout the country and exceptionally mild in Lapland. On an average, similar conditions occur less than once every 30 years, said the Met office in a press release on Tuesday.<p> <p>The deviation from the long-term average temperature was about two degrees Celsius in the south and more than six degrees Celsius in northern Lapland.<p> <p>The month’s highest temperature of 11.0°C was recorded on the island of Kemiö on 1 November while the lowest temperature was minus 22.0°C recorded in Naruska, Salla on 27 November.<p> <p>The mild and dry November resulted in exceptionally low snow cover in Lapland. In mid-November almost all of Lapland was without snow. By the end of the month, there were one to 10 centimetres of snow in the eastern and northern parts of the country. For the most part in the west, the ground remained free of snow.<p> <p>In most parts of the country, the autumn (September to November) was one to three degrees Celsius warmer than usual. On an average, a warm autumn like this is recorded in Finland once every 10 years, although the previous comparable autumn was in 2015.<p>", "time": "12 Dec 2018, 04:49", "type": "weather"}
{"title": "Lack of snow harms Lapland´s \"white wonderland\" image", "url": "http://www.dailyfinland.fi/weather/8216/Lack-of-snow-harms-Lapland´s-", "review": "", "content": "<p>Winter tourism to Finnish Lapland has suffered from the unusual lack of snow this winter.<p> <p>Particularly tourists from the United Kingdom have been disappointed. Several British tour organizers have canceled their charter flights.<p> <p>Among the eleven chartered flights originally planned to land in Enontekio, northwestern Lapland during the last week, only three were actually flown, national broadcaster Yle reported.<p> <p>Joni Nojonen, the director of the Tornio airport, told Yle that one of the Enontekio flights was canceled when it had already taken off from the UK. Nojonen underlined that the conditions at the airport did not cause the calling-off.<p> <p>December charters from the UK have been a growing trend for over two decades. Finnish Lapland is marketed in the UK mainly as a \"white snow winter wonderland\". Earlier in November British travel writers described Lapland as \"crapland\".<p> <p>Lack of snow has not affected incoming tourist flow from other countries and continents. In marketing for Asians, the possibility of seeing Northern Lights has been accentuated, and snow does not impact the availability of the Northern Lights. Northern lights are actually more evident against a dark terrain.<p> <p>The Finnish Meteorological Institute told Yle earlier that in November the depth of snow in Lapland was the thinnest since measurements began in 1961. There were local differences though.<p> <p>Juha-Pekka Mikkola, an entrepreneur offering activities to tourists, told Yle that alternative programming has been arranged, but purchased services have also been reimbursed. Rides in sleighs driven by huskies have been replaced with husky driven carriages.<p> <p>Yle reported that in some tourist hotels snow from last winter has been storaged. But it has been used only in days with sub-zero temperatures, as in warm weather it would melt away soon. Service providers have also purchased snow.<p> <p>For the pre-Christmas and Christmas weeks, some 700 charter flights have been planned. They are supposed to land in Kittilä, Rovaniemi, Ivalo, Enontekiö and Kuusamo airports.<p>", "time": "04 Dec 2018, 01:14", "type": "weather"}
{"title": "Motorists urged to use winter tyres as deadline expires", "url": "http://www.dailyfinland.fi/weather/8185/Motorists-urged-to-use-winter-tyres-as-deadline-expires", "review": "", "content": "<p>The Finnish Transport Safety Agency- Trafi reminded the motorists to change tyres of their vehicles as the delaine for setting winter tyres on to vehicles is Saturday, December 1.<p> <p>Although the motorists can use winter tyres from November 1 as per the necessity and already started to use at the Northern parts of the country, winter tyres are compulsory in Finland as of 1 December, said Trafi.<p> <p>This rule also applies to cars and vans registered abroad when they are driven in Finland.<p> <p>Before fitting tyres, it should be ensured that they are in good condition and compatible with the vehicle and that the tyre pressure is correct.<p> <p>The groove depth of winter tyres must be at least 3.0 millimetres measured in the principle grooves of the tyre pattern.<p> <p>Winter tyres are compulsory until the end of February and may be used until 20 April.<p>", "time": "01 Dec 2018, 23:40", "type": "weather"}
